/*
Navicat MySQL Data Transfer

Source Server         : 10.12.107.80
Source Server Version : 50730
Source Host           : 10.12.107.80:3306
Source Database       : cc_dum2

Target Server Type    : MYSQL
Target Server Version : 50730
File Encoding         : 65001

Date: 2022-10-12 19:11:16
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for igj
-- ----------------------------
DROP TABLE IF EXISTS `igj`;
CREATE TABLE `igj` (
  `id` varchar(255) DEFAULT NULL,
  `a` varchar(255) DEFAULT NULL,
  `b` varchar(255) DEFAULT NULL,
  `c` varchar(255) DEFAULT NULL,
  `d` varchar(255) DEFAULT NULL,
  `f` varchar(255) DEFAULT NULL,
  `h` varchar(255) DEFAULT NULL,
  `g` varchar(255) DEFAULT NULL,
  `k` int(11) DEFAULT '0' COMMENT '数据类型（1、公厕，2、垃圾分类，3、城管窗口，4、天天骑行））'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- ----------------------------
-- Records of igj
-- ----------------------------
INSERT INTO `igj` VALUES ('452', '莲湖路B01-4', '莲湖路莲湖边', '114.10981', '23.01882', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('704', '乌沙4号公厕', '长安镇乌沙社区西坊街7号旁李屋新村公园', '113.78713', '22.79712', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('107', '世博广场A区一楼公厕', '世博广场A区一楼', '113.777962', '23.032017', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('927', '凤岗镇01号公厕', '永盛大街凤晖园小区', '114.138921', '22.746649', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('970', '凤岗镇45号公厕', '同兴路足球场旁', '114.16801', '22.725874', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1330', '江滨公园公厕', '万江街道江滨桥旁江滨小公园内', '113.73893', '23.05062', '6', '万江街道', '8', '1');
INSERT INTO `igj` VALUES ('716', '04沙头商贸城东站公厕', '长安镇沙头德隆路六巷21号旁', '113.77077', '22.7827', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('152', '国贸城公厕', '东莞市鸿福东路1号民盈国贸中心', '113.751796', '23.020704', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('449', '东山木棉工业区公厕', '企石镇东山村木棉工业区篮球场', '114.24855', '23.023651', '6', '企石镇', '8', '1');
INSERT INTO `igj` VALUES ('1484', '南栅四区公厕', '\"东莞市虎门镇南栅社区四区文明路', '113.68979', '22.79451', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1459', '\"博美', '万悦商场后\"', '113.677424', '22.834017', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('286', '长塘公厕\"', '东莞市虎门镇博涌社区博美长塘塘边', '113.877492', '23.091576', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('78', '博头村篮球场旁公厕', '博头村篮球场旁；', '113.802315', '22.965139', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('398', '同沙生态公园北门驿站公厕', '东莞市同沙生态公园', '113.94363', '22.98354', '6', '东坑镇', '8', '1');
INSERT INTO `igj` VALUES ('292', '黄麻岭公厕', '黄麻岭村广场', '113.86647', '23.067248', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('523', '下朗村陈屋塘公厕', '陈屋塘篮球场旁；', '113.85858', '23.11738', '6', '石龙镇', '8', '1');
INSERT INTO `igj` VALUES ('87', '石龙镇织箩街公共厕所', '东莞市石龙镇中山西社区织箩街62号', '113.817469', '23.081885', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('933', '榴花公园西门公厕', '东莞榴花公园', '114.132768', '22.750003', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1274', '凤岗镇07号公厕', '兴贸西路休闲长廊公园', '113.63352', '22.8702', '6', '沙田镇', '8', '1');
INSERT INTO `igj` VALUES ('1337', '沙田大泥村公共厕所', '沙田镇大泥村大泥市场旁（113.63352；22.8702）', '113.71242', '23.02686', '6', '万江街道', '8', '1');
INSERT INTO `igj` VALUES ('1199', '万科乐跑公园公厕', '万江街道龙湾乐跑公园', '113.63122', '23.00191', '6', '洪梅镇', '8', '1');
INSERT INTO `igj` VALUES ('192', '洪梅夏汇公共厕所', '洪梅镇夏汇村广场旁边', '114.035217', '22.801874', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('1514', '龙背岭广场公厕', '东莞市塘厦镇龙背岭广场', '113.67314', '22.80924', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1058', '九门寨市场公厕（2）', '东莞市虎门镇九门寨综合市场三楼', '113.69179', '22.88877', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('445', '厚街镇沙溪湖公园4号公厕     ', '东莞市厚街镇沙溪湖公园4号驿站', '114.03963', '23.05902', '6', '企石镇', '8', '1');
INSERT INTO `igj` VALUES ('1315', '东山村公厕', '企石镇东山村西安东路', '113.6197', '23.09535', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('374', '鸥涌农资大棚公厕', '东莞市麻涌镇鸥涌村农资大棚侧', '114.03149', '22.98024', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('684', '常平镇隐贤山庄海盗船02公厕', '东莞市常平镇隐贤山庄景区内', '113.81933', '22.81975', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('888', '霄边石仔路公厕05号', '长安镇霄边社区石仔路22号', '113.8725', '22.94512', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('581', '马蹄岗村公厕', '马蹄岗村公园侧边', '113.363', '23.27', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('1024', '望牛墩朱平沙村文化广场公共厕所', '朱平沙村文化广场旁', '113.75168', '23.0409', '6', '莞城街道', '8', '1');
INSERT INTO `igj` VALUES ('165', '莞城区博厦公厕12号', '东莞市莞城区可园路10号', '113.76273', '22.98845', '6', '南城街道', '8', '1');
INSERT INTO `igj` VALUES ('742', '百花林公厕', '宏伟七路百花林公园内', '113.7393', '22.79629', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('1233', '厦边横村路2号中转站05公厕', '长安镇厦边社区横村路与银城二路交叉口', '113.94144', '23.0779', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('1391', '石排镇谷吓村公共厕所1201', '东莞市石排镇谷吓石岗路', '113.6597', '23.08992', '6', '中堂镇', '8', '1');
INSERT INTO `igj` VALUES ('887', '一村公厕', '东莞市中堂镇一村村一村公园内', '113.85952', '22.91574', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('1192', '金地格林花园公厕', '大岭山镇金地格林', '113.61914', '22.99463', '6', '洪梅镇', '8', '1');
INSERT INTO `igj` VALUES ('1424', '洪梅中心广场公共厕所', '镇文化体育广场', '113.728314', '22.818819', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('245', '\"大宁', '东莞市虎门镇大宁社区广场路1号', '113.88363', '23.0782', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('751', '广场公厕\"', '东岳公园新建厕所；', '113.897533', '23.002339', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('1152', '东岳公园公厕', '东莞市寮步镇寮步社区香江公园', '113.67009', '22.8896', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('476', '香江公园公厕', '东莞市厚街镇宝塘东村环村路', '114.04811', '23.00869', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('442', '厚街镇宝塘01公厕', '田头角广场', '114.09086', '23.07809', '6', '企石镇', '8', '1');
INSERT INTO `igj` VALUES ('527', '田头角广场B17', '企石镇铁岗村文明路市场旁', '113.86217', '23.11479', '6', '石龙镇', '8', '1');
INSERT INTO `igj` VALUES ('416', '铁岗村市场公厕', '东莞市石龙镇兴龙社区顺兴路', '114.02116', '23.02507', '6', '横沥镇', '8', '1');
INSERT INTO `igj` VALUES ('1371', '石龙镇顺兴路公共厕所', '东莞市横沥镇六甲村委会', '114.079113', '22.876979', '6', '樟木头镇', '8', '1');
INSERT INTO `igj` VALUES ('1372', '横沥镇六甲公共厕所', '东莞市樟木头镇樟洋黄沙区', '114.083686', '22.880743', '6', '樟木头镇', '8', '1');
INSERT INTO `igj` VALUES ('1296', '樟木头樟洋公厕', '东莞市樟木头镇金洋街金洋综合市场', '113.594', '23.06104', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('1236', '樟洋金洋市场公厕', '东莞市麻涌镇新基大道村治保会旁', '113.93799', '23.09331', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('341', '新基大道公厕', '东莞市石排镇埔心上汴村小组古塔公园侧', '114.02738', '22.94389', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1532', '埔心村古塔公厕1304', '东莞市常平镇常平镇卢屋马腰岭公园内', '113.67453', '22.82983', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('311', '常平镇卢屋腰岭公园公厕', '东莞市虎门镇东方社区中上三巷28号对面', '113.98333', '22.98052', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1472', '\"东方', '东莞市常平镇桥梓文化城公园', '113.69946', '22.81366', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('403', '五眼井公厕\"', '东莞市虎门镇金洲梁屋球场路8号', '113.95365', '23.02036', '6', '横沥镇', '8', '1');
INSERT INTO `igj` VALUES ('985', '常平镇桥梓文化城公厕', '东莞市横沥镇隔坑新村204号', '114.167243', '22.699901', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('874', '\"金洲', '祥新东路', '113.968749', '22.90053', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('1342', '梁屋公厕\"', '凤山农业园', '113.7064', '23.05871', '6', '万江街道', '8', '1');
INSERT INTO `igj` VALUES ('675', '横沥镇隔坑公共厕所', '万江街道严屋社区综合办事楼内', '113.82992', '22.80579', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('1226', '凤岗镇60号公厕', '长安汽车客运北站', '113.99815', '23.09688', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('334', '大朗90', '东莞市石排镇赤坎中围二巷2号', '114.02077', '22.96342', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('475', '严屋社区综合办事楼公厕', '东莞市常平镇新城大道常新公园内', '114.04811', '23.00869', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('495', '长安汽车客运北站候车厅斜对面临时洗手间', '桥头镇禾坑村禾坑文化广场', '114.0989', '23.03081', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('415', '石排0702', '邓屋村青龙路', '113.99175', '23.01513', '6', '横沥镇', '8', '1');
INSERT INTO `igj` VALUES ('770', '常平镇常新公园01公厕', '东莞市横沥镇田坑村综合市场', '113.504', '22.5959', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('44', '禾坑村公共厕所', '东莞市寮步镇动物园公厕4号（内3）', '113.790171', '23.070335', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('943', '青龙公厕', '东城区上桥官碌巷老人院旁', '114.143556', '22.733266', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('691', '横沥镇田坑市场公共厕所', '碧湖森林公园公厕', '113.80303', '22.79283', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('314', '动物园公厕4号（内3）', '长安镇锦厦社区锦厦环村东路42号之七旁边', '113.96525', '22.97186', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('528', '上桥老人院公厕', '东莞市常平镇苏坑路公园内', '113.86571', '23.1128', '6', '石龙镇', '8', '1');
INSERT INTO `igj` VALUES ('125', '凤岗镇17号公厕', '东莞市石龙镇林屋村林屋八巷', '113.751796', '23.020704', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('313', '河东公园06号公厕', '东莞市鸿福东路1号民盈国贸中心', '113.97572', '22.97346', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1228', '常平镇苏坑公园公厕', '常平镇桥梓公园内', '113.98057', '23.09889', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('1449', '石龙镇林屋八巷公共厕所', '东莞市石排镇向西村公园', '113.71297', '22.84784', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1507', '国贸城公厕', '东莞市虎门镇赤岗社区赤岗综合市场内', '113.68488', '22.76021', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('9', '常平镇桥梓公园公厕', '东莞市虎门镇沙角社区沙角市场内', '113.77492', '23.016285', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('612', '向西公园0802', '东莞市东城中路2号旗峰公园', '114.1148', '22.5823', '6', '谢岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1403', '\"赤岗', '东莞市谢岗镇黎村窑贝塘公园内', '113.45014', '22.48578', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('848', '市场公厕\"', '东莞市虎门镇树田社区向东三巷', '113.91719', '22.956115', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('57', '\"沙角', '黎贝岭市场', '113.780926', '22.999753', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('72', '市场公厕\"', '东城立新横岭村6巷14号', '113.802315', '22.965139', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('950', '旗峰公园山上平台厕所', '东莞市同沙生态公园', '114.123881', '22.735424', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('660', '黎村窑贝塘公园公厕', '畔坑路36-3号侧', '113.475509', '22.49457', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('199', '\"树田', '长安镇长安公园', '114.072115', '22.798254', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('542', '东方公厕\"', '塘厦镇莆心湖广场旁', '113.661', '23.04525', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('994', '大朗67', '望牛墩镇江畔路', '113.723679', '23.099007', '6', '高埗镇', '8', '1');
INSERT INTO `igj` VALUES ('402', '横岭公厕', '黄屋饭堂旁', '113.98313', '23.01136', '6', '横沥镇', '8', '1');
INSERT INTO `igj` VALUES ('743', '同沙生态公园七彩山公厕', '东莞市横沥镇新城区裕宁北路', '113.737032', '22.802145', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('1092', '凤岗镇24号公厕', '长安镇厦边社区文德街', '113.68072', '22.96707', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('832', '长安公园08号公厕', '东莞市厚街镇三屯上屯村球场旁', '113.582', '22.5519', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('443', '塘厦镇莆心湖广场旁公厕公厕', '环村二路公厕', '114.14524', '23.035202', '6', '企石镇', '8', '1');
INSERT INTO `igj` VALUES ('755', '望牛墩江畔路公共厕所', '企石镇下截东胜路', '113.860895', '23.001145', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('1004', '朱磡村', '东莞市寮步镇影视城对面', '113.712145', '23.092698', '6', '高埗镇', '8', '1');
INSERT INTO `igj` VALUES ('1310', '横沥镇铁路公园公共厕所', '莲塘公园旁', '113.60587', '23.08707', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('1177', '体育馆公厕03', '东莞市麻涌镇黎滘村三街路口工业区', '113.69911', '22.93879', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('233', '厚街镇上屯球场公厕    ', '东莞市厚街镇汀山新村小组', '113.856753', '23.067279', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('568', '大朗49', '茶花广场内；', '113.3819', '23.4', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('775', '下截村公厕', '望牛墩镇官桥涌村北环路治安岗亭旁', '113.874874', '23.017765', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('1454', '樱花广场公厕', '东莞市寮步镇富竹山南北门村（公园）', '113.677351', '22.834172', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('276', '芦村', '东莞市虎门镇博涌社区王屋向北路20号旁', '113.895255', '23.04041', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('767', '黎滘工业区公厕', '刘黄大禾塘；', '113.5056', '22.5958', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('379', '厚街镇汀山新村小组公厕        ', '东莞市寮步镇东莞香市动物园', '114.02667', '23.01145', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('965', '党建广场公厕', '东莞市常平镇常田路白石岗市场侧向北公园', '114.165656', '22.72323', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('739', '望牛墩官桥涌村公共厕所', '校塘路', '113.74424', '22.7944', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('570', '富竹山南北门公园公厕', '长安镇厦岗社区厦联路12号101铺后面', '113.3819', '23.34', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('33', '\"博涌', '芙蓉沙村球场23号', '113.809441', '23.054737', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1095', '王屋公厕\"', '东莞市东城区桑园广场', '113.69006', '22.97117', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1348', '刘黄大禾塘公厕', '东莞市厚街镇三屯伦品涌工业区邦泽厂旁', '113.71898', '23.07103', '6', '万江街道', '8', '1');
INSERT INTO `igj` VALUES ('1308', '动物园公厕1号（外1）', '万江街道拔蛟窝社区上东坊', '113.60945', '23.08658', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('1290', '常平镇白石岗市场公厕', '东莞市麻涌镇黎滘村委会公共服务中心侧（广场旁）', '113.5894', '23.04924', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('174', '凤岗镇40号公厕', '东莞市麻涌镇东太村东村文化广场内', '114.058413', '22.845421', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('1409', '厦联路09公厕', '128工业区商业街', '113.74775', '22.83842', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('551', '望牛墩芙蓉沙村公共厕所', '东莞市虎门镇怀德路怀德广场内', '113.6487', '23.03948', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('997', '桑园广场1公厕', '望牛墩镇五涌建设路口旁', '113.725322', '23.090535', '6', '高埗镇', '8', '1');
INSERT INTO `igj` VALUES ('1006', '厚街镇三屯伦品涌公厕', '格基停车场', '113.758308', '23.106552', '6', '高埗镇', '8', '1');
INSERT INTO `igj` VALUES ('327', '拔蛟窝社区上东坊公厕', '冼沙村委会旁', '113.97712', '22.96714', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1423', '黎滘广场公厕', '东莞市常平镇金兴公园', '113.727328', '22.858159', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('237', '东太广场公厕', '东莞市虎门镇黄村社区泉井路4号', '113.90116', '23.047106', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('297', '128公厕', '伟建工业园内（篮球场旁）；', '113.876774', '23.066715', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('694', '\"怀德', '茶山村球场旁；', '113.79924', '22.79588', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('68', '广场公厕\"', '长安镇锦厦社区兴龙街50号旁边', '113.787689', '23.010014', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('315', '望牛墩五涌村公共厕所', '东莞虎英公园', '113.96568', '22.96955', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('86', '新联村', '东莞市常平镇苏坑路供销社侧', '113.76508', '23.000667', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('140', '冼沙村', '东莞市东城东泰嘉荣商场', '113.751796', '23.020704', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('532', '常平镇金美金兴公园公厕', '东莞市鸿福东路1号民盈国贸中心', '113.85045', '23.11701', '6', '石龙镇', '8', '1');
INSERT INTO `igj` VALUES ('793', '黄村泉井西路公厕', '东莞市石龙镇新维村新泰路西侧', '113.5652', '22.5513', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('1115', '伟建工业园公厕', '湿地公园办公室旁', '113.678514', '22.908837', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('508', '茶山村球场公厕', '东莞市厚街镇南五塘新公园旁', '114.13802', '23.03613', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('889', '兴隆街09号公厕', '岗头村村前路（治安队对面）', '113.85553', '22.90548', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('538', '虎英公园办公室公厕', '东莞市大岭山镇南一路73号', '113.67217', '23.05064', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('1052', '常平镇苏坑供销社侧公厕', '望牛墩镇滨江公园管理处', '113.67366', '22.94803', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('522', '嘉荣商场公厕', '东莞市厚街镇松山公园东边公厕', '113.866952', '23.119161', '6', '石龙镇', '8', '1');
INSERT INTO `igj` VALUES ('93', '国贸城公厕', '东莞市石龙镇中山东路二巷2号', '113.777962', '23.032017', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('202003270008', '石龙镇新维村公共厕所', '世博广场D区二楼', '114.13415', '22.8566', '6', '清溪镇', '8', '1');
INSERT INTO `igj` VALUES ('202003270013', '大朗07', '东莞市清溪镇长山头广场附近', '114.17537', '22.857', '6', '清溪镇', '8', '1');
INSERT INTO `igj` VALUES ('1414', '厚街镇南五05公厕', '东莞市清溪镇上元公园附近', '113.75404', '22.84319', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('202003270006', '岗头村公厕', '东莞市虎门镇怀德深巷八巷12号', '114.22707', '22.8626', '6', '清溪镇', '8', '1');
INSERT INTO `igj` VALUES ('202003270018', '南一路公厕', '东莞市清溪镇铁场路老友钓鱼场附近', '114.14862', '22.8456', '6', '清溪镇', '8', '1');
INSERT INTO `igj` VALUES ('1205', '望牛墩滨江公园中区公共厕所', '东莞市清溪镇荔河街', '113.62297', '23.01261', '6', '洪梅镇', '8', '1');
INSERT INTO `igj` VALUES ('1518', '厚街镇松山公园01公厕       ', '洪梅镇梅新路廉政文化区内', '113.65335', '22.808963', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1465', '石龙镇中山东路一巷公共厕所', '东莞市虎门镇南面市场内', '113.67063', '22.86148', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('255', '世博广场D区二楼公厕', '东莞市虎门镇白沙社区白沙广场内', '113.905968', '23.069433', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('688', '长山头公厕', '南社北二综合大楼；', '113.80753', '22.79304', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('179', '上元公厕', '长安镇锦厦社区五坊东南巷52号旁边', '114.65', '22.4645', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('1234', '\"怀德', '塘厦镇凤凰岗老围西', '113.93886', '23.09139', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('1268', '深巷公厕\"', '东莞市石排镇埔心楼下农民公寓内', '113.60881', '22.84945', '6', '沙田镇', '8', '1');
INSERT INTO `igj` VALUES ('913', '铁场公厕', '沙田镇西大坦驿站（113.60881；22.84945）', '113.80871', '22.93773', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('1206', '荔横公厕', '连平计岭村篮球场旁', '113.63182', '23.00958', '6', '洪梅镇', '8', '1');
INSERT INTO `igj` VALUES ('1116', '廉政公园公厕', '氹涌村村前路六巷1号旁', '113.66096', '22.91516', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('644', '\"南面', '东莞市厚街镇新塘社区丽新路农贸市场内', '113.81725', '22.80813', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('5', '市场公厕\"', '长安镇长福路与长东路交界口', '113.77492', '23.016285', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('317', '\"白沙', '东莞市东城中路2号旗峰公园', '113.98755', '22.97733', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1135', '广场公厕\"', '东莞市常平镇塘角四街公园旁', '113.64386', '22.91685', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('984', '南社北二综合大楼公厕', '东莞市厚街镇双岗社区下环大道', '114.165363', '22.695099', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('516', '石闸口03号公厕', '怡安路满家福对面', '113.87832', '23.09144', '6', '石龙镇', '8', '1');
INSERT INTO `igj` VALUES ('519', '老围西公厕', '东莞市石龙镇环湖东路西湖工业园垃圾转运站旁', '113.86229', '23.11925', '6', '石龙镇', '8', '1');
INSERT INTO `igj` VALUES ('797', '埔心楼下村小组公厕1302', '东莞市石龙镇中山中路二巷9号二楼', '113.5543', '22.5834', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('1314', '沙田穗丰年水道公共厕所08', '佛新村委会前面', '113.61137', '23.08811', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('1272', '连平村', '东莞市麻涌镇鸥涌村旧村十四巷附近（公园长廊侧）', '113.61818', '22.89774', '6', '沙田镇', '8', '1');
INSERT INTO `igj` VALUES ('536', '氹涌村村前路公厕', '沙田镇体育南路侧（113.61818；22.89774）', '113.65249', '23.05592', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('553', '厚街镇新塘01公厕', '望牛墩镇西富路七夕公园内', '113.3935', '23.411', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('515', '长安镇长福路公厕', '上合村委会文化广场舞台后面', '113.86197', '23.1037', '6', '石龙镇', '8', '1');
INSERT INTO `igj` VALUES ('77', '旗峰公园正门厕所', '东莞市石龙镇西湖金源西路垃圾转运站旁', '113.802315', '22.965139', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1184', '常平镇塘角公园公厕', '东莞市同沙生态公园', '113.75222', '22.91219', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('52', '厚街镇双岗03公厕', '东莞市厚街镇大新路文化广场', '113.764381', '23.006193', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('720', '凤岗镇59号公厕', '东城火炼树金苑路', '113.77063', '22.7796', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('941', '石龙镇环湖东路公共厕所', '长安镇沙头靖海中路84号对面', '114.172866', '22.77058', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1394', '石龙镇东市场公共厕所', '南门山公园驴庄公厕', '113.65884', '23.11924', '6', '中堂镇', '8', '1');
INSERT INTO `igj` VALUES ('166', '大朗24', '东莞市中堂镇江南大塘公园内', '114.058413', '22.845421', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('922', '鸥涌公园公厕', '行政中心塘龙广场旁', '113.82486', '22.8791', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('380', '沙田民田村公共厕所', '水朗村广场', '114.01239', '23.00584', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('144', '望牛墩七夕公园公共厕所', '东莞市常平镇松柏塘广场内', '113.751796', '23.020704', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('903', '望牛墩上合村公共厕所', '东莞市鸿福东路1号民盈国贸中心', '113.85006', '22.92273', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('195', '石龙镇金源西路公共厕所', '金桔村浮桥', '114.084226', '22.767349', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('878', '同沙生态公园管理处公厕', '东莞市塘厦镇平山广场', '113.84582', '22.90527', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('1359', '厚街镇大迳广场公厕 ', '大岭山广场内', '113.71603', '23.02122', '6', '万江街道', '8', '1');
INSERT INTO `igj` VALUES ('347', '金苑路公厕', '万江街道胜利社区龙湾公园旁', '114.02048', '22.98209', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('168', '09沙头晶佳站公厕', '东莞市常平镇公园路铁路公园内', '114.058413', '22.845421', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('1139', '凤岗镇15号公厕', '138工业区宏业南二路', '113.66056', '22.90252', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1287', '江南公厕', '东莞市厚街镇溪头社区环村路溪头广场内', '113.57365', '23.04653', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('1297', '塘龙广场公厕', '东莞市麻涌镇麻四市场内', '113.5927', '23.06216', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('1045', '水朗村', '东莞市麻涌镇新基市场三鸟档旁', '113.67397', '22.945501', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('514', '常平镇松柏塘广场公厕', '东莞市厚街镇厚街广场', '113.87305', '23.11412', '6', '石龙镇', '8', '1');
INSERT INTO `igj` VALUES ('1249', '国贸城公厕', '东莞市石龙镇新城区金沙湾公园东桥旁', '113.92927', '23.09797', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('948', '25号金桔村公厕', '东莞市石排镇石排潇湴湖广场', '114.412405', '22.717813', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1245', '平山广场公厕', '宏盈工业区公厕', '113.95153', '23.09621', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('1262', '大岭山广场公共厕所', '东莞市石排镇石排公园篮球场', '113.6167', '22.8943', '6', '沙田镇', '8', '1');
INSERT INTO `igj` VALUES ('1503', '胜利龙湾公厕', '沙田镇体育北路龙舟广场（113.6167；22.8943）', '113.67944', '22.77044', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1505', '常平镇铁路公园03公厕', '东莞市虎门镇沙角社区河仔新村五巷', '113.68652', '22.75795', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('690', '宏业南二路公厕', '东莞市虎门镇沙角社区工业一路7号旁', '113.81002', '22.79537', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('368', '厚街镇溪头广场公厕      ', '长安镇锦厦社区三坊二巷1号之4旁边', '114.03272', '22.97988', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('376', '麻四市场公厕', '东莞市常平镇隐贤山庄景区内', '114.03996', '23.02674', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('569', '新基市场公厕', '东莞市常平镇白花沥六横路与白前路交叉处', '113.3826', '23.42', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('1473', '厚街镇厚街广场公厕', '望牛墩镇官桥涌村委会篮球场旁', '113.68887', '22.81838', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1257', '石龙镇金沙湾公园公共厕所', '东莞市虎门镇金洲北坊村前路榕树头', '113.61973', '22.92809', '6', '沙田镇', '8', '1');
INSERT INTO `igj` VALUES ('1105', '潇湴湖广场公厕2001', '沙田镇滨江路与横流南路交叉路口（113.61973；22.92809）', '113.67351', '22.92098', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1107', '凤岗镇22号公厕', '东莞市厚街镇桥头塘面球场1旁 ', '113.67233', '22.91978', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('404', '石排公园篮球场公厕1901', '东莞市厚街镇桥头元州球场旁 ', '113.96256', '23.02063', '6', '横沥镇', '8', '1');
INSERT INTO `igj` VALUES ('1015', '沙田龙舟广场公共厕所', '东莞市横沥镇和平路朱子公园', '113.75715', '23.04952', '6', '莞城街道', '8', '1');
INSERT INTO `igj` VALUES ('1212', '沙角河仔新村公厕', '东莞市莞城区北隅平乐坊横巷1号', '113.60922', '22.97749', '6', '洪梅镇', '8', '1');
INSERT INTO `igj` VALUES ('1390', '沙角工业一路公厕', '洪梅镇洪屋涡村新路东一巷', '113.68518', '23.08932', '6', '中堂镇', '8', '1');
INSERT INTO `igj` VALUES ('780', '锦厦路05号公厕', '东莞市中堂镇蕉利村村委会旁', '113.887455', '22.957275', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('121', '常平镇隐贤山庄景区花海生态公厕', '东莞市寮步镇牛杨村委会侧', '113.823906', '23.076934', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1207', '常平镇白花沥六横路公厕', '东莞市东纵路208万达广场万达广场', '113.62075', '23.01705', '6', '洪梅镇', '8', '1');
INSERT INTO `igj` VALUES ('155', '望牛墩官桥涌村文化活动中心公共厕所', '洪梅镇梅沙村西二十巷16号', '113.788918', '23.020941', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1193', '\"金洲', '东莞市东昇路星河城', '113.62233', '23.00399', '6', '洪梅镇', '8', '1');
INSERT INTO `igj` VALUES ('1355', '北坊公厕\"', '洪梅商业街公厕', '113.70195', '23.07891', '6', '万江街道', '8', '1');
INSERT INTO `igj` VALUES ('385', '沙田滨江公共厕所', '东莞市万江街道谷涌社区大洲口', '114.00736', '22.99213', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('85', '厚街镇桥头社区04公厕', '东莞市常平镇口岸大道常平公园内', '113.765595', '23.001123', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1201', '厚街镇桥头社区06公厕', '东莞市东泰友谊市场', '113.62111', '22.95794', '6', '洪梅镇', '8', '1');
INSERT INTO `igj` VALUES ('242', '横沥镇朱子公园公共厕所', '洪梅镇金鳌沙村图书馆旁', '113.87313', '23.068273', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('1222', '莞城区四眼井公厕02号', '综合市场；', '113.97769', '23.08382', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('272', '洪屋涡村西坊公厕', '东莞市石排镇石排大道福隆古塔公园', '113.906126', '23.036551', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('866', '蕉利公厕', '粟边陈坑鱼塘旁；', '113.927449', '22.87874', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('809', '牛杨村委会公厕', '水平喜庆堂旁', '113.5426', '22.5629', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('1174', '万达广场公厕', '盈丰路侧', '113.69732', '22.94035', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('434', '梅沙村下坊凉棚公厕', '东莞市厚街镇汀山市场', '114.018559', '23.076013', '6', '企石镇', '8', '1');
INSERT INTO `igj` VALUES ('1443', '星河城广场公厕', '企石镇旧市场', '113.70442', '22.84399', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('438', '洪梅商业街公共厕所', '东莞市虎门镇龙眼社区东八路佳华网吧后', '114.04535', '23.07923', '6', '企石镇', '8', '1');
INSERT INTO `igj` VALUES ('202003270024', '谷涌社区大洲口公厕', '企石镇江边村公园', '114.92', '22.483', '6', '清溪镇', '8', '1');
INSERT INTO `igj` VALUES ('153', '常平镇常平公园01公厕', '清溪镇三谢街与清凤路交叉口东南50米', '113.788918', '23.020941', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('425', '友谊城市场公厕', '东莞市东昇路星河城', '113.97489', '23.04598', '6', '横沥镇', '8', '1');
INSERT INTO `igj` VALUES ('761', '洪梅镇金鳌沙公共厕所', '横沥镇新四油榨村公园', '113.865975', '23.000767', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('491', '综合市场公厕', '东莞市寮步镇香市公园沉香馆旁', '114.084773', '23.013116', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('1034', '福隆古塔公园公厕0403', '工业大路2号', '113.77592', '23.02801', '6', '莞城街道', '8', '1');
INSERT INTO `igj` VALUES ('1137', '粟边陈坑鱼塘旁公厕', '东莞市莞城区东城中路', '113.66295', '22.89711', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1213', '大朗58', '东莞市厚街镇溪头社区西路一巷变压器旁', '113.61161', '22.97716', '6', '洪梅镇', '8', '1');
INSERT INTO `igj` VALUES ('718', '大朗22', '洪梅镇洪屋涡村旧小学旁', '113.76525', '22.77173', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('1198', '厚街镇汀山市场公厕  ', '长安镇沙头东大路29号后面', '113.62886', '22.98851', '6', '洪梅镇', '8', '1');
INSERT INTO `igj` VALUES ('133', '旧市场公厕', '洪梅镇尧均村洪尧路1号', '113.751796', '23.020704', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1493', '\"龙眼', '东莞市鸿福东路1号民盈国贸中心', '113.411994', '22.480511', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1540', '东八路公厕\"', '东莞市虎门镇东风社区西畔公园内', '113.67308', '22.82222', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('977', '江边村公园公厕', '东莞市虎门镇则徐社区贵立街二巷旁', '114.17915', '22.728134', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('360', '清凤路隧道口公厕', '官井头村民公寓公园', '114.05463', '22.98267', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1122', '星河城广场公厕', '东莞市常平镇漱新村市场旁', '113.65722', '22.91882', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('29', '横沥镇新四油榨村公园公厕', '东莞市厚街镇新塘社区新塘二路旁', '113.777603', '23.026079', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('668', '香市公园（沉香馆旁）公厕', '较寮新村路', '113.473217', '22.493318', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('1362', '啤酒广场厕所', '长安镇体育公园', '114.07571', '22.9088', '6', '樟木头镇', '8', '1');
INSERT INTO `igj` VALUES ('788', '莞城区旗峰广场一24号', '东莞市樟木头镇新兴街（八方酒店对面）', '113.5551', '22.571', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('1346', '厚街镇溪头鱼种塘公厕       ', '旧环卫所（停车场内）', '113.72355', '23.07151', '6', '万江街道', '8', '1');
INSERT INTO `igj` VALUES ('709', '洪屋涡综合服务楼公共厕所', '万江街道莫屋新村新丰路旁', '113.78804', '22.79245', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('194', '06沙头猫山公园公厕', '长安镇乌沙社区步步高大道2号旁江贝聚怡堂内', '114.047951', '22.805789', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('604', '洪梅镇尧均公共厕所', '东莞市塘厦镇龙背岭牛眠埔旧围广场', '114.17194', '22.97127', '6', '谢岗镇', '8', '1');
INSERT INTO `igj` VALUES ('363', '国贸城公厕', '东莞市谢岗镇银湖公园内', '114.03721', '22.98927', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1173', '东风西畔公园公厕', '东莞市常平镇元江元荔枝公路公园内', '113.68814', '22.95144', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1182', '\"则徐', '东莞市厚街镇寮厦社区寮厦竹园村前路20号', '113.72561', '22.933861', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('129', '泗盛街公厕\"', '东莞市厚街镇环冈社区新公园内建公厕', '113.751796', '23.020704', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1369', '凤岗镇52号公厕', '东莞市鸿福东路1号民盈国贸中心', '114.055108', '22.916125', '6', '樟木头镇', '8', '1');
INSERT INTO `igj` VALUES ('931', '常平镇漱新市场公厕', '东莞市樟木头镇百果洞百达工业区百达公园', '114.145884', '22.752123', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('680', '厚街镇新塘07公厕', '昌盛北路兴贸公园', '113.81544', '22.80635', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('116', '温塘白庙公厕', '长安镇霄边社区上洋路5号', '113.823906', '23.076934', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('574', '体育公园休闲中心一层公厕', '东莞市东纵路208万达广场万达广场', '113.3708', '23.0224', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('911', '樟木头新兴街公厕', '望牛墩镇横沥村十八巷702号之三', '113.82011', '22.95094', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('222', '大朗02', '旧飞鹅村公园老人活动中心侧面', '114.5137', '22.484702', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('652', '莫屋社区公厕', '\"东莞市塘厦镇', '113.482087', '22.504193', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('1511', '乌沙9号公厕', '诸佛岭潮流坊\"', '113.66533', '22.83726', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('407', '牛眠埔旧围广场公厕', '长安镇郊野公园', '113.95955', '23.027', '6', '横沥镇', '8', '1');
INSERT INTO `igj` VALUES ('406', '银湖公园公厕', '东莞市虎门镇镇口广场内', '113.97022', '23.04579', '6', '横沥镇', '8', '1');
INSERT INTO `igj` VALUES ('945', '常平镇元江元公园公厕', '东莞市横沥镇市场西街', '114.154081', '22.746922', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('307', '厚街镇竹园小组公厕    ', '东莞市横沥镇新四黄塘公园', '113.99019', '22.97716', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('727', '厚街镇环冈03公厕', '园龙山公园鬼屋旁公厕', '113.76489', '22.79258', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('779', '国贸城公厕', '常平镇西兴一街与兴隆一路交界', '113.494865', '23.013008', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('1316', '樟木头百果洞公园公厕', '长安镇上沙社区中山北路39号之一（沙溪管理处内）', '113.61583', '23.0971', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('454', '凤岗镇05号公厕', '东莞市寮步镇下岭贝溪源湖', '114.10712', '23.02564', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('979', '霄边上洋站公厕01号', '东莞市麻涌镇鸥涌村新立村新桥旁', '114.158307', '22.698698', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1229', '万达广场公厕', '桥虹影剧院侧', '113.96737', '23.0999', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('252', '望牛墩横沥村公共厕所', '雁田公园', '113.913789', '23.050171', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('259', '旧飞鹅村', '东莞市石排镇水贝工业区凯联路', '113.905433', '23.067711', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('291', '塘厦镇诸佛岭潮流坊公厕', '超朗市场农商行旁', '113.86953', '23.07022', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('74', '郊野公园20号公厕', '南社北一村停车场；', '113.802315', '22.965139', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('792', '\"镇口', '文化广场内；', '113.5621', '22.5543', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('1238', '广场公厕\"', '东莞市同沙生态公园', '113.93323', '23.08401', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('458', '横沥镇市场西街公共厕所', '5P绿道驿站', '114.110635', '23.03098', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('361', '横沥镇新四黄塘公共厕所', '东莞市石排镇古村一路戏院旁', '114.04608', '22.99986', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('492', '凤岗镇19号公厕', '广普街桥头派出所对面', '114.10199', '23.03435', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('960', '常平镇下墟西兴一街公厕', '东莞市常平镇黄泥塘市场路文化广场内', '114.126457', '22.764683', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1147', '上沙03公厕', '李屋村麻园塘八巷49号', '113.66383', '22.89387', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('423', '下岭贝溪源湖公厕', '浸校塘环村路', '114.01339', '23.03615', '6', '横沥镇', '8', '1');
INSERT INTO `igj` VALUES ('267', '鸥涌新立村公厕', '东莞市厚街镇沙塘旧塘公园旁', '113.853777', '23.047915', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('289', '桥虹影剧院B02-2', '横沥镇村头村体育公园', '113.866838', '23.049042', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('906', '凤岗镇54号公厕', '增埗卢屋文化广场；', '113.83714', '22.90397', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('1495', '水贝公厕0901', '卢边老人中心内，', '113.70007', '22.78552', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('110', '超朗市场农商行旁公厕', '大岭山镇矮岭冚背底岭路', '113.777962', '23.032017', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('241', '南社北一村停车场公厕', '东莞市虎门镇宴岗旧村新区路25号', '113.868739', '23.065189', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('159', '下朗村文化广场公厕', '世博广场A区四楼', '113.788918', '23.020941', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('40', '同沙生态公园瀛台公厕', '茶山圩社区（中心市场）；', '113.825718', '23.091876', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('910', '大朗06', '东莞市东昇路星河城', '113.83934', '22.90227', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('1516', '塘尾村上市街1401', '东莞市东城街道峡口社区新苑东路9号', '113.651248', '22.808022', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('646', '', '矮岭冚塘边路', '113.82152', '22.82418', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('149', '常平镇黄泥塘市场路公厕', '东莞市虎门镇南面长堤路南面广场内', '113.751796', '23.020704', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('482', '李屋村文化广场公厕', '长安镇新鸿北路莲花水库旁', '114.099719', '23.024904', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('1357', '凤岗镇35号公厕', '东莞市鸿福东路1号民盈国贸中心', '113.71652', '23.02362', '6', '万江街道', '8', '1');
INSERT INTO `igj` VALUES ('554', '厚街镇旧塘公厕   ', '杨公朗路43号对面', '113.3938', '23.3937', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('384', '横沥镇村头村体育公园公厕', '东莞市万江官桥滘社区文化广场旁边', '114.00632', '22.98469', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('420', '增埗卢屋文化广场公厕', '上合村望角中下坊中坊球场旁', '113.97736', '22.99871', '6', '横沥镇', '8', '1');
INSERT INTO `igj` VALUES ('1539', '卢边老人中心内公厕', '东莞市常平镇木棆大道市场内', '113.67249', '22.82432', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1395', '51号矮岭冚背底岭路公厕', '横沥镇田头村荔枝公园', '113.63276', '23.07149', '6', '中堂镇', '8', '1');
INSERT INTO `igj` VALUES ('1114', '宴岗广场公厕', '东莞市虎门镇则徐社区长堤路镇远桥底', '113.685146', '22.913939', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('27', '世博广场A区四楼公厕', '东莞市中堂镇马沥村委会新办公大楼', '113.803932', '23.036381', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('138', '茶山圩社区公厕（中心市场）', '东莞市厚街镇南五水口小组水口街', '113.751796', '23.020704', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('509', '星河城广场公厕', '新世纪星城小区内', '113.88146', '23.10976', '6', '石龙镇', '8', '1');
INSERT INTO `igj` VALUES ('239', '榴花东街公厕', '东莞市鸿福东路1号民盈国贸中心', '113.871186', '23.068407', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('279', '矮岭冚村', '东莞市石龙镇新城区政府广场旁', '113.882554', '23.077286', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('81', '\"南面', '茶山酒店旁', '113.802315', '22.965139', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('96', '广场公厕\"', '塘角坑霞；', '113.777962', '23.032017', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1110', '长安镇新鸿北路公厕', '东莞市同沙生态公园', '113.67533', '22.9212', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1108', '国贸城公厕', '世博广场F区一楼', '113.67085', '22.92084', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('221', '杨公朗鱼塘边公厕', '东莞市厚街镇桥头井头池塘边 ', '114.5864', '22.475322', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('1291', '官桥滘文化广场公厕', '东莞市厚街镇桥头南社南山路  ', '113.58162', '23.04653', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('69', '望牛墩上合村中坊公共厕所', '\"东莞市塘厦镇', '113.802315', '22.965139', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('261', '常平镇木棆市场公厕', '诸佛岭新村二期公园\"', '113.88178', '23.06366', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('834', '横沥镇田头荔枝公园公厕（2）', '东莞市麻涌镇大步市场三鸟档旁', '113.5855', '22.5529', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('982', '\"则徐', '东莞市同沙生态公园', '114.163086', '22.70626', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1210', '长堤路公厕\"', '上元卫生站后面；', '113.61347', '22.97902', '6', '洪梅镇', '8', '1');
INSERT INTO `igj` VALUES ('164', '马沥公厕', '仙一路公厕', '113.788918', '23.020941', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('351', '厚街镇南五04公厕', '北园路', '114.08055', '22.95358', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1074', '星城公厕', '洪梅镇洪屋涡村东坊一巷4号', '113.66172', '22.945211', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('131', '国贸城公厕', '东莞市东昇路星河城', '113.751796', '23.020704', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('900', '石龙镇政府广场公共厕所', '东莞市常平镇朗州村旗岭公园内', '113.81867', '22.92851', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('1232', '茶山酒店旁公厕', '东莞市厚街镇厚街社区小公园内', '113.93073', '23.10574', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('465', '塘角坑霞公厕', '东莞市鸿福东路1号民盈国贸中心', '113.673424', '22.948529', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('1185', '同沙生态公园公厕', '大岭山镇梅林村村中心公园旁', '113.76465', '22.91534', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('795', '世博广场F区一楼公厕', '东莞市石排镇横山钟屋村', '113.5626', '22.5632', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('1338', '厚街镇桥头社区09公厕', '松山公园半山腰', '113.74219', '23.03209', '6', '万江街道', '8', '1');
INSERT INTO `igj` VALUES ('173', '厚街镇桥头社区07公厕', '东莞市厚街镇大迳汪潭十一巷11号', '114.058413', '22.845421', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('338', '塘厦镇诸佛岭新村公厕', '大朗广场', '114.014282', '22.940821', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1103', '大步市场公厕', '万江街道坝头社区上坝公园', '113.6706', '22.92648', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('377', '同沙生态公园婚育文化园公厕', '莲湖清塘街', '114.03466', '23.02461', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1276', '上元村第二村民小组公厕', '东莞市常平镇桥沥公园内', '113.65537', '22.85208', '6', '沙田镇', '8', '1');
INSERT INTO `igj` VALUES ('294', '大朗51', '东莞市厚街镇桥头广场路', '113.880561', '23.084096', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('137', '凤岗镇57号公厕', '东莞市常平镇圣旗路沙溪广场公园内', '113.751796', '23.020704', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('762', '洪屋涡村东坊公厕', '沙田镇义沙村三排尾小公园内（113.65537；22.85208）', '113.866586', '23.004642', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('757', '星河城广场公厕', '冲美市场；', '113.882886', '23.001493', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('225', '常平镇朗洲旗岭公园公厕', '东莞市鸿福东路1号民盈国贸中心', '114.030564', '22.782955', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('1510', '厚街镇小公园公厕 ', '东莞市寮步镇香市公园', '113.66395', '22.83611', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1101', '国贸城公厕', '东莞市寮步镇寮步镇香市广场', '113.69927', '22.969401', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1463', '梅林治安队对面公厕', '广东省东莞市塘厦镇大坪下底围公园公厕', '113.67619', '22.86322', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1405', '钟屋公厕1102', '东莞市虎门镇镇兴路134号', '113.74875', '22.84077', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('435', '', '东莞市厚街镇陈屋后低岭公园公厕', '114.05826', '23.04956', '6', '企石镇', '8', '1');
INSERT INTO `igj` VALUES ('1270', '厚街镇大迳汪潭公厕  ', '东莞市虎门镇白沙社区真人公园旁', '113.6087', '22.87795', '6', '沙田镇', '8', '1');
INSERT INTO `igj` VALUES ('1278', '大朗23', '东莞市虎门镇怀德大禾路6号之一', '113.63727', '22.89189', '6', '沙田镇', '8', '1');
INSERT INTO `igj` VALUES ('968', '上坝公共厕所', '企石镇东平村广场', '114.173948', '22.721064', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1251', '清塘街公厕', '沙田镇穗丰年湿地公园东面（113.6087；22.87795）', '113.912972', '23.108014', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('66', '常平镇桥沥综合文化服务中心公厕', '沙田镇西太隆市场（113.63727；22.89189）', '113.787689', '23.010014', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1223', '厚街镇桥头社区02公厕', '青塘面步行街24号', '113.99701', '23.07902', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('1464', '常平镇沙湖口沙溪广场公厕', '东莞市石排镇石排红石山公园', '113.66539', '22.84935', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('202003270019', '沙田义沙村公共厕所', '东莞虎英公园', '114.16645', '22.8458', '6', '清溪镇', '8', '1');
INSERT INTO `igj` VALUES ('471', '冲美市场公厕', '东莞市石排镇沙角村市场公厕', '114.08161', '23.00788', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('1467', '国贸城公厕', '东莞市虎门镇白沙社区三村压缩站旁', '113.66356', '22.84527', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1311', '香市公园（南门）公厕', '东莞市清溪镇文化公园管理处旁', '113.61065', '23.0885', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('1470', '市民广场公厕', '中和圩5号饭堂侧', '113.68941', '22.80944', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('246', '大坪公园公厕', '东莞市虎门镇白沙三村长和一路', '113.91782', '23.050962', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('1387', '镇口市场二楼西门公厕', '东莞市麻涌镇黎滘村路北鱼塘边', '113.68817', '23.09747', '6', '中堂镇', '8', '1');
INSERT INTO `igj` VALUES ('566', '厚街镇陈屋04公厕', '东莞市虎门镇金洲二区二路', '113.385', '233.0403', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('837', '白沙真人公园公厕', '超朗文化广场', '113.5551', '22.5454', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('804', '\"怀德', '东莞市中堂镇鹤田村滨江体育公园内', '113.5525', '22.5733', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('344', '大禾公厕\"', '望牛墩镇寮厦村巷尾', '114.03332', '22.96519', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('481', '东平广场公厕', '升平路转运站二楼公厕', '114.092301', '23.020847', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('579', '沙田穗丰年水道公共厕所10', '巷头新公园', '113.62822', '23.0338', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('1323', '沙田西太隆市场公共厕所', '东莞市常平镇土塘桥东路', '113.58386', '23.07898', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('1119', '凤岗镇43号公厕', '田新社区墓园', '113.66275', '22.92526', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('198', '红石山1号2005', '望牛墩镇石排新村球场旁边', '114.172871', '22.795708', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('1526', '虎英公园游乐场公厕', '东莞市麻涌镇华阳村建设新村南九巷12号对面 ', '113.68489', '22.8062', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1528', '沙角市场公厕0501', '东莞市厚街镇康乐路凤山公园东门公厕', '113.672', '22.82884', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('254', '\"白沙三村', '东莞市塘厦镇莆心湖中心一路', '113.902217', '23.066152', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('180', '灰窑公厕\"', '东莞市虎门镇新湾社区新港北路15号旁', '114.613', '22.4642', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('923', '清溪镇文化公园公厕', '东莞市虎门镇东方社区中心三巷11号旁', '113.85569', '22.86284', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('1241', '中和圩5号B15-4', '南社村文化服务中心旁;', '113.93259', '23.09218', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('370', '白沙三村工业区公厕', '塘厦镇凤凰岗黄河路42号旁', '114.03413', '22.97898', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('917', '黎滘路北公厕', '杨屋村杨屋广场', '113.82336', '22.92205', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('220', '\"金洲', '东莞市石排镇李家坊公园侧', '114.45186', '22.483384', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('992', '工业区公厕\"', '东莞市常平镇隐贤山庄景区内', '114.160523', '22.703646', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1088', '超朗文化广场公厕', '太公岭旧围村祠堂旁', '113.68251', '22.967191', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('65', '滨江体育公园公厕1', '\"东莞市塘厦镇', '113.787689', '23.010014', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('662', '望牛墩寮厦村巷尾公共厕所', '诸佛岭椰山街\"', '113.475617', '22.491606', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('202003270015', '大朗54', '雁田楠木岭公园公厕', '114.18518', '22.82097', '6', '清溪镇', '8', '1');
INSERT INTO `igj` VALUES ('1317', '大朗16', '东莞市厚街镇三屯上屯新公园后面', '113.61505', '23.094', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('1536', '常平镇土塘休闲公园公厕', '东莞虎英公园', '113.67249', '22.82432', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('285', '田新社区墓园公厕', '长安镇长安公园', '113.880145', '23.09166', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('28', '望牛墩石排村公共厕所', '东莞市清溪镇渔梁围圆盘附近', '113.834663', '23.046741', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('202003270022', '华阳新村公厕', '东莞市麻涌镇鸥涌村规划路（停车场内）', '114.916', '22.5059', '6', '清溪镇', '8', '1');
INSERT INTO `igj` VALUES ('918', '厚街镇新塘04公厕', '东莞市虎门镇则徐社区人民南路38号', '113.81686', '22.92412', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('591', '塘厦镇莆心湖中心一路公厕', '博头村红石市场；', '114.1545', '22.96837', '6', '谢岗镇', '8', '1');
INSERT INTO `igj` VALUES ('244', '新湾新港北路公厕', '温塘万福园', '113.878261', '23.07297', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('1127', '\"东方', '东莞市清溪镇香芒西路南五街7号', '113.6462', '22.92659', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('928', '平房公厕\"', '下高田村电子阅览室', '114.134328', '22.745383', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('130', '南社村文化服务中心旁公厕', '谢岗镇党建公园内', '113.751796', '23.020704', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('534', '黄河路长堤公厕', '茶山东岳庙旁；', '113.65987', '23.0576', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('485', '杨屋村', '东莞市厚街镇涌口社区西社停车场侧', '114.10224', '23.01039', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('1332', '李家坊1501', '昌盛南路羊庄旁', '113.72971', '23.03564', '6', '万江街道', '8', '1');
INSERT INTO `igj` VALUES ('230', '常平镇隐贤山庄景区花果山漂流处公厕', '东莞市鸿福东路1号民盈国贸中心', '114.105447', '22.744035', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('1166', '太公岭村公厕', '望牛墩镇五福路11号', '113.69085', '22.92861', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('135', '塘厦镇诸佛岭椰山公厕', '迳联广场侧', '113.751796', '23.020704', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('55', '凤岗镇67号公厕', '万江街道金曲路绿道旁', '113.828812', '23.081646', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1543', '厚街镇上屯新公园公厕         ', '东莞市塘厦镇石马新围路39号', '113.67928', '22.82257', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('802', '虎英公园五指山公厕', '东莞市厚街镇河田新村垃圾中转站旁', '113.935', '22.9551', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('229', '长安公园11号公厕', '东莞市鸿福东路1号民盈国贸中心', '114.130178', '22.816711', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('555', '渔梁围19公厕', '东城区草塘路1号', '113.386', '23.342', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('578', '鸥涌规划路公厕', '东莞市虎门镇虎门寨永安路9号对面', '113.3644', '23.149', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('240', '\"则徐', '巷头农民公寓旁边', '113.870397', '23.063033', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('653', '大明星公厕\"', '东莞市塘厦镇横塘社区塘清东路107号旁', '113.484108', '22.505181', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('1112', '博头村红石市场公厕', '望牛墩镇聚龙江村庆云路', '113.671711', '22.911642', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1382', '万福园公交首末站公厕', '望牛墩镇官洲村文化广场', '113.74439', '23.13103', '6', '中堂镇', '8', '1');
INSERT INTO `igj` VALUES ('1133', '康怡公园公厕', '茶山圩社区（街心公园）；', '113.64668', '22.916101', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('115', '下高田村', '长安镇郊野公园', '113.823906', '23.076934', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1128', '党建公园公厕', '东莞市厚街镇南五文化公园内', '113.65234', '22.93068', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1349', '茶山东岳庙旁公厕', '东莞市中堂镇潢涌村核心价值观公园内', '113.71743', '23.06968', '6', '万江街道', '8', '1');
INSERT INTO `igj` VALUES ('687', '厚街镇涌口05公厕', '东莞市厚街镇双岗社区官美厦公园南路', '113.80375', '22.803', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('1060', '凤岗镇02号公厕', '东莞市东纵路208万达广场万达广场', '113.6764', '22.95601', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1170', '国贸城公厕', '东莞市厚街镇涌口社区水北公园侧', '113.68363', '22.94382', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('988', '望牛墩万众城公共厕所', '东莞万江街道拔蛟窝社区南边坊旁', '114.152457', '22.71338', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('134', '桥头B14', '长安镇锦厦社区沙埔头东九巷2号旁边', '113.751796', '23.020704', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('32', '曲海绿道公厕', '东莞市厚街镇体育公园司法所旁', '113.828156', '23.059753', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1243', '石马新围路91号公厕', '东莞市厚街镇寮厦社区寮厦村前路小公园', '113.92817', '23.09406', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('38', '厚街镇河田05公厕', '水贝小公园', '113.826613', '23.071489', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1180', '国贸城公厕', '东莞市鸿福东路1号民盈国贸中心', '113.724066', '22.932177', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('876', '余屋草塘一路公厕', '温塘砖窖工业区垃圾转运站二楼', '113.968749', '22.900532', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('830', '\"虎门寨', '东莞市石排镇田边盘岭大地路14号', '113.5846', '22.5551', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('861', '中巴站公厕\"', '东莞市东城街道周屋社区荔林公园', '113.972064', '22.926019', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('790', '大朗14', '东莞市厚街镇环冈社区市场二巷5号', '113.5716', '22.553', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('964', '塘厦横塘市场公共厕所', '凤山农业园', '114.163291', '22.731602', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1523', '望牛墩聚龙江村公共厕所', '沙塘围公厕', '113.66589', '22.82203', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('642', '望牛墩官洲村公园公共厕所', '郑公涌公园（宗南路17号旁）', '113.81104', '22.80579', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('808', '街心公园公厕', '湿地公园烧烤场旁', '113.5656', '22.5716', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('396', '郊野公园21号公厕', '狮石厦村成衣市场旁', '113.95769', '22.98066', '6', '东坑镇', '8', '1');
INSERT INTO `igj` VALUES ('436', '厚街镇南五02公厕', '东莞市虎门镇武山沙威远桥旁', '114.09163', '23.08263', '6', '企石镇', '8', '1');
INSERT INTO `igj` VALUES ('226', '潢涌核心价值观公园公厕', '长安镇长源街尾财政分局水塘侧', '114.08244', '22.80937', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('955', '厚街镇双岗01公厕', '大井头富贵路旧村委会鱼塘旁', '114.158554', '22.752245', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('693', '万达广场公厕', '长安塘长安路92号', '113.80093', '22.78839', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('1363', '厚街镇涌口06公厕', '企石镇深南路中转站公厕', '114.07815', '22.90911', '6', '樟木头镇', '8', '1');
INSERT INTO `igj` VALUES ('980', '拔蛟窝南边公厕 ', '东莞市塘厦镇四村塘福路', '114.163901', '22.702157', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1508', '沙浦头02号公厕', '黄洞市场旁', '113.69047', '22.77061', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('120', '厚街镇体育公园02公厕 ', '长安镇锦厦社区锦江路351号旁边', '113.823906', '23.076934', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('251', '厚街镇寮厦村前路小公园公厕     ', '东莞市樟木头镇广明街广明巷', '113.925809', '23.044571', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('869', '凤岗镇63号公厕', '南园路', '113.940149', '22.884688', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('63', '国贸城公厕', '东莞市虎门镇沙角社区沙角加油站旁', '113.787689', '23.010014', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('996', '砖窖工业区公厕', '东莞市东纵路208万达广场万达广场', '113.728825', '23.084561', '6', '高埗镇', '8', '1');
INSERT INTO `igj` VALUES ('1121', '田边村大地路1602', '超朗村陈屋篮球场旁;', '113.66237', '22.92747', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('235', '荔林公园公厕', '屏山市场后面', '113.87475', '23.08163', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('97', '厚街镇环冈01公厕', '东莞虎英公园', '113.777962', '23.032017', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1134', '大朗92', '高埗村老人院对面', '113.64379', '22.91985', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('387', '大朗47', '东莞市厚街镇大陂河凤山公园北门公厕', '114.00505', '22.9945', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('561', '大朗80', '宪法主题广场内；', '113.643096', '23.044634', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('976', '大朗04', '世博广场F区二楼', '114.18098', '22.724962', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1521', '凤岗镇39号公厕', '东莞市厚街镇双岗社区上环菜园路', '113.65066', '22.81946', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1253', '\"武山沙', '东莞市常平镇口岸大道常平公园内', '113.912154', '23.10794', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('638', '威远桥公厕\"', '洲湾村石头村高速公路底旁', '114.104', '22.5039', '6', '清溪镇', '8', '1');
INSERT INTO `igj` VALUES ('510', '长安长源街公厕', '官井头滨河北路邮政旁', '113.861823', '23.11641', '6', '石龙镇', '8', '1');
INSERT INTO `igj` VALUES ('357', '大朗21', '东莞市虎门镇北面南北路12号', '114.07311', '22.98299', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('157', '长安塘公厕', '东莞市石排镇石排红石山公园', '113.788918', '23.020941', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('643', '深巷公园公厕', '东莞市清溪镇文化公园55号公厕', '116.39718', '39.91265', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('1388', '四村塘福路公厕', '东莞市石龙镇中山东社区中山公园内', '113.6906', '23.0978', '6', '中堂镇', '8', '1');
INSERT INTO `igj` VALUES ('1343', '凤岗镇30号公厕', '东莞市常平镇司马市场内', '113.70224', '23.07075', '6', '万江街道', '8', '1');
INSERT INTO `igj` VALUES ('641', '步行街08号公厕', '东莞市东昇路星河城', '113.81122', '22.80773', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('1026', '樟木头广明街公厕', '长安镇长兴街尾停车场内', '113.75693', '23.04651', '6', '莞城街道', '8', '1');
INSERT INTO `igj` VALUES ('1541', '凤岗镇55号公厕', '东莞市中堂镇鹤田村滨江体育公园内', '113.67529', '22.82154', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1041', '\"沙角', '万江街道谷涌社区子来坊', '113.75265', '23.04073', '6', '莞城街道', '8', '1');
INSERT INTO `igj` VALUES ('1529', '油站公厕\"', '长安镇长中路文化中心侧', '113.67328', '22.82787', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('202003270005', '万达广场公厕', '东莞市莞城区向阳路', '114.15227', '22.78676', '6', '清溪镇', '8', '1');
INSERT INTO `igj` VALUES ('1286', '超朗村陈屋篮球场旁公厕', '东莞市虎门镇则徐社区东安街19号', '113.57388', '23.04362', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('1456', '大朗60', '东莞市莞城区创业新村市场侧', '113.679637', '22.831231', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('899', '虎英公园鲤鱼湖公厕', '东莞市虎门镇东方中心路39号旁', '113.83382', '22.8815', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('730', '高埗村', '东莞市清溪镇浸校塘创业路', '113.75465', '22.78207', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('306', '厚街镇新塘06公厕', '东莞市麻涌镇麻四村魁楼晚望公园内', '113.9937', '22.98204', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('210', '宪法主题公园公厕', '东莞市虎门镇博涌社区大卢向北新区一路', '114.097802', '22.763428', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('372', '世博广场F区二楼公厕', '大岭山大塘村委会旁', '114.02946', '22.98057', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('223', '厚街镇双岗02公厕', '长安镇上沙社区华丽路35号（振华园对面）', '114.031623', '22.779802', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('169', '常平镇常平公园03公厕', '东莞市常平镇沙边街下墟公园', '114.058413', '22.845421', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('590', '望牛墩洲湾村石头村公共厕所', '东莞市塘厦镇石鼓英才路30号', '114.17288', '22.97074', '6', '谢岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1239', '凤岗镇51号公厕', '东莞市常平镇隐贤山庄景区内', '113.931189', '23.084229', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('715', '\"北面', '广东省东莞市塘厦镇大坪林坪路3号', '113.76992', '22.7948', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('805', '变电站公厕\"', '花园街', '113.551', '22.574', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('1365', '红石山3号2007', '谢岗镇银湖商贸城内', '114.11778', '22.93224', '6', '樟木头镇', '8', '1');
INSERT INTO `igj` VALUES ('1491', '文化公园公厕', '东莞市石排镇塘尾公园', '113.413238', '22.481721', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1530', '石龙镇中山公园公共厕所', '长安镇沙头德隆路六巷11号旁', '113.66691', '22.8281', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('818', '常平镇司马市场公厕', '巷头文化广场', '113.5719', '22.56214', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('321', '星河城广场公厕', '东莞市樟木头镇金河社区路口', '113.98732', '22.95998', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('533', '长安镇长兴街公厕', '东莞市虎门镇东风社区新圩旧村二巷10号', '113.66176', '23.06097', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('673', '滨江体育公园公厕2', '东莞市虎门镇东方社区东方水运路4号旁', '113.8288', '22.80644', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('269', '谷涌子来坊公厕', '水常路治安队对面', '113.856866', '23.052238', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('94', '长安文化中心公厕', '东莞市常平镇袁山大道昌盛工业园旁', '113.777962', '23.032017', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('702', '莞城区文化广场公厕14号', '望牛墩镇绿榕路西二坊一巷4号之一', '113.79529', '22.79635', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('844', '\"则徐', '长安汽车客运总站', '113.931282', '22.961472', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('1157', '大堂公厕\"', '沙墩农贸市场；', '113.66441', '22.86911', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1023', '莞城区创业路公厕31号', '世博广场D区三楼', '113.75255', '23.04786', '6', '莞城街道', '8', '1');
INSERT INTO `igj` VALUES ('109', '\"东方', '长安镇乌沙社区沿中街九巷与沿中街十巷交叉口陈屋新村篮球场', '113.777962', '23.032017', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('949', '中心公厕\"', '巷头花园市场', '114.163629', '22.743603', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('378', '三中公厕', '东莞市厚街镇白濠绿洲大道', '114.02156', '23.01492', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('682', '魁楼晚望公厕', '东莞市莞城区可湖花闸门39号侧', '113.81252', '22.80114', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('70', '\"博涌大卢', '世博广场A区三楼', '113.802315', '22.965139', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('736', '向北公厕\"', '金凤凰公园旁', '113.74759', '22.7947', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('56', '大塘广场34号公厕', '常平镇沙湖口旧围鱼塘旁', '113.697102', '22.979063', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('603', '上沙06公厕', '长安镇霄边社区长东路29号', '114.15833', '22.96766', '6', '谢岗镇', '8', '1');
INSERT INTO `igj` VALUES ('936', '常平镇下墟公园公厕', '东莞市同沙生态公园', '114.140952', '22.748948', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('880', '塘厦镇石鼓英才路公厕', '长安镇厦岗社区厦联路', '113.84093', '22.91834', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('1488', '常平镇隐贤山庄烧烤乐园公厕', '余屋小塘路88号（公交首末站）', '113.69634', '22.79221', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('689', '大坪市场公厕', '东莞市谢岗镇育贤湖公园内', '113.79623', '22.79218', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('789', '花园街环保公厕', '永盛北路中心市场侧门', '113.5617', '22.5648', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('202003270020', '银湖商贸城公厕', '大岭山体育公园', '114.16766', '22.84422', '6', '清溪镇', '8', '1');
INSERT INTO `igj` VALUES ('886', '塘尾公园一期1401', '东莞市虎门镇南栅社区办公楼内', '113.85867', '22.94786', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('814', '03西坊大塘公厕', '长安镇锦厦社区锦富路8号旁边', '113.5427', '22.556', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('1196', '大朗17', '金朗中路（憩趣园旁）', '113.62133', '23.01802', '6', '洪梅镇', '8', '1');
INSERT INTO `igj` VALUES ('1049', '樟木头金河公厕', '文化公园', '113.66565', '22.946641', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('726', '\"东风', '鸡翅岭村工业区广场', '113.76316', '22.79682', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('80', '新圩公厕\"', '黄草朗广场后转运站二楼', '113.802315', '22.965139', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1458', '\"东方', '洪梅镇梅沙村西十二巷23号', '113.677895', '22.833217', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('265', '水运队公厕\"', '东莞市厚街镇厚街社区小公园旁', '113.886449', '23.047399', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('216', '大朗35', '长安镇上沙社区湖景路58号（中山公园内）', '114.04793', '22.800983', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('3', '常平镇袁山贝大道公厕', '东莞市同沙生态公园', '113.77492', '23.016285', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1275', '望牛墩一坊公共厕所', '东莞市虎门镇博涌社区博美广场', '113.63987', '22.85184', '6', '沙田镇', '8', '1');
INSERT INTO `igj` VALUES ('1420', '长安汽车客运总站2楼女厕', '上元下周塘村民小组；', '113.73077', '22.85235', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('16', '沙墩农贸市场公厕', '东莞市塘厦镇田心社区鹿乙路196号', '113.77581', '23.00456', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1271', '世博广场D区三楼公厕', '东莞市东城中路2号旗峰公园', '113.6146', '22.89584', '6', '沙田镇', '8', '1');
INSERT INTO `igj` VALUES ('284', '乌沙2号公厕', '沙田镇环保城万国超市旁（113.63987；22.85184）', '113.879214', '23.095624', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('1040', '大朗63', '东莞市虎门镇陈村社区市场旁', '113.76974', '23.04581', '6', '莞城街道', '8', '1');
INSERT INTO `igj` VALUES ('1065', '厚街镇白濠01公厕', '体育公园公交首末站', '113.6956', '22.94498', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1417', '莞城区可湖公厕11号', '沙田镇体育南路立沙新区市场旁（113.6146；22.89584）', '133.43001', '22.493484', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('714', '世博广场A区三楼公厕', '博头村横亨路；', '113.77364', '22.79324', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('318', '凤岗镇23号公厕', '东莞市莞城区罗沙路47路', '113.98235', '22.97709', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1504', '常平镇沙湖口开灯楼公厕', '东莞市厚街镇飞翔路竹园路文化公园内', '113.68869', '22.75778', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('319', '霄边长东路公厕03号', '东莞市虎门镇村头社区原海琪公园内', '113.9783', '22.97219', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1269', '同沙生态公园跨湖大桥公厕', '长安镇沙头新南街48号对面', '113.60839', '22.85716', '6', '沙田镇', '8', '1');
INSERT INTO `igj` VALUES ('665', '厦联路06公厕', '东莞市常平镇塘角路喜庆堂后面', '113.473933', '22.492478', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('572', '余屋首末站公厕', '东莞市虎门镇沙角社区江下路北二巷9号对面', '113.64069', '23.06253', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('1352', '育贤湖公园公厕', '东莞市常平镇振兴西路河西公园内', '113.72037', '23.06811', '6', '万江街道', '8', '1');
INSERT INTO `igj` VALUES ('1220', '凤岗镇10号公厕', '沙田镇启盈物流旁（东面）（113.60839；22.85716）', '113.96176', '23.07018', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('479', '体育公园篮球场旁公厕', '长安镇体育公园', '114.092301', '23.020845', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('1190', '\"南栅', '望牛墩镇杜屋村横滘桥旁边', '0', '', '6', '洪梅镇', '8', '1');
INSERT INTO `igj` VALUES ('191', '社区公厕\"', '万江街道上甲社区上甲市场内', '114.035944', '22.800856', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('91', '锦富路6-1今明公园04号公厕', '东莞市石排镇庙边王兴龙六路', '113.817469', '23.081885', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('108', '大朗03', '田新社区马鞍岭公园内', '113.777962', '23.032017', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('549', '居民55号公厕', '洪梅镇中兴路25号', '113.3943', '23.318', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('1218', '鸡翅岭村公厕', '东莞市塘厦镇龙背岭永福路口', '113.96867', '23.06729', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('1411', '大朗29', '东莞榴花公园', '113.75299', '22.82975', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1073', '洪梅梅沙公共厕所', '世博广场A区二楼', '113.65738', '22.94615', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('422', '厚街镇小公园公厕 ', '望牛墩镇赤滘北村篮球球场旁', '114.00171', '23.01815', '6', '横沥镇', '8', '1');
INSERT INTO `igj` VALUES ('459', '上沙02公厕', '东莞市石排镇下沙上沙塘边一巷4号', '113.998104', '22.982493', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('831', '同沙生态公园鸡肠山驿站公厕', '东莞市虎门镇怀德田心村前路旁(广东长大）', '113.5836', '22.5514', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('37', '\"博美', '东莞市厚街镇厚街社区大塘小组小公园', '113.852402', '23.105021', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('882', '广场公厕\"', '横沥镇田坑村委会', '113.87452', '22.9574', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('7', '上元下周塘村民小组公厕', '沙边街粮所附近', '113.77492', '23.016285', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1267', '塘厦镇田心市场公厕', '石厦广场公园', '113.60673', '22.85379', '6', '沙田镇', '8', '1');
INSERT INTO `igj` VALUES ('64', '旗峰公园沙池公厕', '东莞市东城街道周屋社区公交首末站', '113.787689', '23.010014', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('801', '沙田稔洲环保城公共厕所', '大塘朗村农贸市场对面', '113.5519', '22.5719', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('145', '\"陈村', '东莞市东城中路2号旗峰公园', '113.751796', '23.020704', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('352', '市场公厕\"', '沙田镇进港南路西大坦桥边驿站（113.60673；22.85379）', '114.09981', '22.95041', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('636', '体育公园公交首末站公厕', '东莞虎英公园', '114.14935', '22.80551', '6', '清溪镇', '8', '1');
INSERT INTO `igj` VALUES ('756', '沙田穗丰年水道公共厕所11', '水塘区', '113.883684', '23.002278', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('1153', '博头村横亨路公厕', '东莞市鸿福东路1号民盈国贸中心', '113.66778', '22.88966', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('613', '莞城区罗沙路公厕30号', '东莞市常平镇朗州村旗岭公园二期内', '114.532', '22.5845', '6', '谢岗镇', '8', '1');
INSERT INTO `igj` VALUES ('206', '厚街镇文化公园02公厕         ', '东莞市清溪谢坑球场公厕', '114.034702', '22.770135', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('1340', '\"村头海琪', '东莞市寮步镇寮步社区香市广场', '113.72361', '23.04765', '6', '万江街道', '8', '1');
INSERT INTO `igj` VALUES ('1479', '公园公厕\"', '东莞市厚街镇宝塘东村鱼塘旁', '113.69541', '22.79186', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('136', '02中坊大塘公厕', '东莞市谢岗镇银山湿地公园C区展厅', '113.751796', '23.020704', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('323', '常平镇塘角村喜庆堂公厕', '沙湖文化广场旁', '113.98483', '22.94912', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1475', '沙角江下小组公厕', '万江街道大莲塘社区莲溪东路八巷11号', '113.70443', '22.81381', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('193', '常平镇河西公园01公厕', '东莞市虎门镇南栅社区八行坊村小组办公楼内', '114.052959', '22.814103', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('1432', '沙田穗丰年水道公共厕所09', '东莞市鸿福东路1号民盈国贸中心', '113.71969', '22.83219', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('678', '体育公园南管理楼公厕', '东莞市常平镇思进路广场', '113.83243', '22.81198', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('99', '望牛墩杜屋村横滘桥公共厕所', '东莞市虎门镇小捷滘社区金捷路30号大院旁边', '113.774541', '23.032937', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1336', '上甲社区市场公厕', '东莞市塘厦镇龙背岭牛眠埔新围广场', '113.73373', '23.0466', '6', '万江街道', '8', '1');
INSERT INTO `igj` VALUES ('277', '石排利屋村小组0301', '东莞市虎门镇北栅社区中墩村（中墩老人康乐中心对面）', '113.895863', '23.039162', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('1502', '马鞍岭公园公厕', '长安镇涌头社区德政东路文天祥公园门口', '113.67806', '22.7665', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1012', '洪梅中兴路公共厕所', '世纪广场负一楼', '113.753155', '23.094317', '6', '高埗镇', '8', '1');
INSERT INTO `igj` VALUES ('1197', '龙背岭公厕', '万江街道金鳌洲主题公园', '113.60933', '22.97673', '6', '洪梅镇', '8', '1');
INSERT INTO `igj` VALUES ('50', '烧烤园公厕', '刘黄市场；', '113.792672', '22.990466', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1415', '世博广场A区二楼公厕', '东莞市虎门镇沙角社区西湖路107号', '113.733611', '22.816111', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('940', '望牛墩赤滘村公共厕所', '高埗广场东', '114.151156', '22.745208', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('563', '下沙上沙公厕0203', '洪梅镇洪屋涡村洪市路', '113.373', '23.228', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('564', '\"怀德', '东莞光明三路不锈钢铝合金门旁', '113.3741', '23.234', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('925', '田心公厕\"', '东莞市虎门镇居岐社区楼仔公园内', '113.83558', '22.85271', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('1256', '厚街镇大塘公厕   ', '凤凰围驿站公厕', '113.62411', '22.91739', '6', '沙田镇', '8', '1');
INSERT INTO `igj` VALUES ('1087', '横沥镇田坑村委会公厕', '望牛墩镇洲涡村五十七巷596号旁', '113.68364', '22.963161', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1446', '', '望牛墩镇洲涡塔洲南路16号停车场对面', '113.70136', '22.84892', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('907', '大朗48', '颜屋市场旁', '113.85081', '22.9067', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('999', '周屋公交首末站公厕', '沙田镇中心广场（113.62411；22.91739）', '113.743762', '23.067181', '6', '高埗镇', '8', '1');
INSERT INTO `igj` VALUES ('30', '大塘朗村公厕', '东莞市厚街镇三屯企山头古坑', '113.834133', '23.041663', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('375', '旗峰公园道院厕所', '东莞市虎门镇龙眼社区十五路联升商场旁', '114.04012', '23.01692', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1069', '沙田穗丰年水道公共厕所07', '市民花园内', '113.69462', '22.94269', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('786', '虎英公园迎宾路驿站公厕', '江滨公园', '113.859494', '22.966081', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('408', '大朗13', '茶岭公园', '113.94469', '23.01979', '6', '横沥镇', '8', '1');
INSERT INTO `igj` VALUES ('283', '国贸城公厕', '东莞市常平镇田尾富田路广场对面', '113.876654', '23.039803', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('998', '常平镇朗洲旗岭公园二期公厕', '东莞市厚街镇龙阁山体育休闲公园（环莞快速路寮夏路段旁）', '113.746266', '23.084226', '6', '高埗镇', '8', '1');
INSERT INTO `igj` VALUES ('1509', '谢坑公厕', '东莞市寮步镇香博园', '113.66493', '22.83621', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('881', '市民广场公厕', '东莞市横沥镇西环路', '113.83936', '22.91856', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('12', '厚街镇宝塘02公厕', '寒溪水村前塘街六巷；东经：', '113.759804', '23.050501', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('67', '银山湿地公园C区展厅公厕', '凌屋村公园北边旧电房旁', '113.787689', '23.010014', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1358', '塘厦公厕58', '东莞市虎门镇镇兴路134号', '113.71422', '23.04975', '6', '万江街道', '8', '1');
INSERT INTO `igj` VALUES ('202003270011', '大莲塘村内公厕', '大岭山体育公园', '114.20346', '22.82195', '6', '清溪镇', '8', '1');
INSERT INTO `igj` VALUES ('111', '南栅八行坊村公厕', '花园新村市场旁', '113.777962', '23.032017', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1351', '国贸城公厕', '东莞虎英公园', '113.72037', '23.06811', '6', '万江街道', '8', '1');
INSERT INTO `igj` VALUES ('657', '常平镇袁山贝广场公厕', '万江街道水蛇涌社区教育路十五横巷6号', '113.475428', '22.485151', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('676', '小捷滘市场公厕', '东莞市清溪镇大埔球场附近', '113.82482', '22.80297', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('552', '牛眠埔广场公厕', '世博广场D区一楼', '113.3752', '23.122', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('774', '\"北栅中墩', '东莞万江街道拔蛟窝社区市场旁', '113.876245', '23.016275', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('1066', '球场公厕\"', '长安镇长安广场', '113.69832', '22.94637', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('602', '涌头05号公厕', '长安镇涌头社区涌溪街西坊28巷30号涌头市场内', '114.529', '22.5843', '6', '谢岗镇', '8', '1');
INSERT INTO `igj` VALUES ('975', '世纪广场负一楼公厕', '望牛墩镇下漕村官派南路官派卫生站对面', '114.18364', '22.725079', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('262', '万江金鳌洲主题公园星级公厕', '东莞市寮步镇富竹山村委会后', '113.878622', '23.0565', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('1187', '刘黄市场公厕', '东莞市厚街镇飞翔路竹园路文化公园内', '113.75956', '22.91542', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1169', '沙角西湖路公厕', '谢岗镇银山湿地公园D区', '113.68602', '22.9465', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('659', '高埗广场东', '滨河路下片', '113.47581', '22.49924', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('939', '洪屋涡村市场公厕', '上元一社综合楼后面；', '114.143625', '22.752005', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1329', '市场北面公厕', '东莞市厚街镇厚大路大迳段109号之一  ', '113.74534', '23.05173', '6', '万江街道', '8', '1');
INSERT INTO `igj` VALUES ('362', '\"居岐', '东莞市厚街镇寮厦社区寮厦广场', '114.04169', '22.98957', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1471', '楼仔公厕\"', '长安镇长安公园', '113.69256', '22.81353', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1145', '凤岗镇14号公厕', '永盛桥头驿站公厕', '113.67168', '22.89726', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('460', '望牛墩洲涡村喜庆堂公共厕所', '万江街道万江公园内', '114.10381', '23.02882', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('843', '望牛墩洲涡村停车场公共厕所', '东莞市常平镇元江元上树吓路', '113.942966', '22.969956', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('214', '颜屋村', '东莞市虎门镇金洲南坊村前路十五巷后面', '114.051695', '22.801536', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('983', '沙田中心广场公共厕所', '东莞市厚街镇溪头社区二环路工业区公园内', '114.166778', '22.701039', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1059', '厚街镇古坑公厕   ', '文明市场侧', '113.67459', '22.95316', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('322', '\"龙眼', '竹山社区球场厕所', '113.9738', '22.98346', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('954', '十五路公厕\"', '东莞市塘厦镇田心社区田心路1号', '114.159341', '22.751107', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('212', '市民花园28号公厕', '镇田中路', '114.095492', '22.76164', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('469', '上江城村', '东莞市厚街镇体育公园白玉兰旁', '114.08037', '23.00615', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('148', '茶岭公园公厕', '东莞市常平镇袁山贝步行街', '113.751796', '23.020704', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('335', '常平镇田尾广场公厕', '黄洞岭南村球场边', '114.02205', '22.95922', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1496', '厚街镇龙阁山运动公园03公厕    ', '东莞市塘厦镇石鼓聚龙路与龙安路路口', '113.71698', '22.77749', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1082', '香博园旅游公厕', '西片大街1号饭堂侧', '113.67712', '22.95792', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('850', '横沥镇石涌公共厕所', '东莞市鸿福东路1号民盈国贸中心', '113.963858', '22.942875', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('974', '寒溪水村红色主题公园外公厕', '东莞市常平镇新城大道常新公园内', '114.183251', '22.727453', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('824', '凌屋村', '东莞市虎门镇路东新安大道仁爱医院旁公厕', '113.5431', '22.554', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('885', '镇口市场二楼东门公厕', '东莞市厚街镇宝屯宝塘厦友谊路球场', '113.84752', '22.91147', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('1325', '体育公园游泳池公厕', '荔枝公园', '113.58372', '23.0772', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('1071', '花园新村市场公厕', '同富路', '113.65514', '22.94552', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1083', '虎英公园警务室公厕', '永安园', '113.6763', '22.96394', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('197', '水蛇涌公厕', '大岭山镇农场二队内', '114.08141', '22.766865', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('312', '大埔公厕', '东莞市麻涌镇华阳村南坊前街十二巷2号对面河边', '113.9817', '22.98268', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('202003270012', '世博广场D区一楼公厕', '东莞市厚街镇厚街社区厚涌路142号', '114.17948', '22.85034', '6', '清溪镇', '8', '1');
INSERT INTO `igj` VALUES ('1374', '拔蛟窝社区市场公厕', '东莞市厚街镇三屯沙岗厦村鱼塘边', '114.105766', '22.927738', '6', '樟木头镇', '8', '1');
INSERT INTO `igj` VALUES ('759', '长安广场公厕2', '东莞市塘厦镇平山致源路', '113.878593', '22.975869', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('1078', '涌头01号公厕', '东莞市常平镇桥梓村委会旁', '113.675493', '22.947802', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('700', '望牛墩下漕村公共厕所', '东莞市清溪镇重河公园', '113.78875', '22.80495', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('464', '富竹山村委会公厕', '东莞市樟木头镇金河社区沿河路', '113.673424', '22.948529', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('60', '厚街镇文化公园03公厕         ', '东莞市寮步镇滨江公园驿站公厕', '113.787689', '23.010014', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1001', '银山湿地公园D区公厕', '东莞市厚街镇陈家坊中心街55号之一（陈家坊公园内）', '113.759701', '23.124584', '6', '高埗镇', '8', '1');
INSERT INTO `igj` VALUES ('1008', '凤岗镇50号公厕', '长安镇新安社区上近市场内新安一路45号对面', '113.740236', '23.07113', '6', '高埗镇', '8', '1');
INSERT INTO `igj` VALUES ('511', '上元一社综合楼公厕', '松山公园山顶', '113.8826', '23.12133', '6', '石龙镇', '8', '1');
INSERT INTO `igj` VALUES ('1377', '厚街镇大迳村公厕      ', '东莞虎英公园', '114.085026', '229.916125', '6', '樟木头镇', '8', '1');
INSERT INTO `igj` VALUES ('760', '厚街镇寮厦广场公厕    ', '草墩村公园', '113.882793', '22.972348', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('674', '长安公园07号公厕', '下江城球场', '113.82979', '22.80609', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('23', '凤岗镇13号公厕', '东莞市石龙镇新城区民生路垃圾转运站旁', '113.751784', '23.057655', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('908', '万江公园公厕', '东莞市樟木头镇新城市广场C区', '113.85433', '22.9435', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('386', '常平镇元江元上树吓路公厕', '东莞市寮步镇城市公园公厕', '114.00257', '22.99241', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1162', '\"金洲', '长安汽车客运北站', '113.6883', '22.93421', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('893', '不夜天公厕\"', '梨川市地路2号侧', '13.85636', '22.93597', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('722', '厚街镇溪头工业区公园公厕         ', '鸡翅岭村委会旁', '113.76903', '22.78589', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('132', '文明市场B01', '东莞市常平镇口岸大道常平公园内', '113.751796', '23.020704', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('989', '大朗62', '东莞市厚街镇河田角元大道都塘公园内', '114.161746', '22.700076', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1434', '塘厦镇田心路公厕', '大岭山镇新塘村篮球场旁', '113.72374', '22.8391', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1055', '凤岗镇58号公厕', '长安镇沙头靖海西路67号', '113.70386', '22.91404', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1305', '厚街镇体育公园01公厕 ', '东莞市鸿福东路1号民盈国贸中心', '113.61152', '23.079', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('582', '常平镇袁山贝步行街公厕', '雁田新市场', '113.3621', '23.156', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('1150', '凤岗镇29号公厕', '东莞市虎门镇北栅社区凤岗路北栅广场内', '113.65768', '22.8888', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1468', '塘厦镇石鼓聚龙路公厕', '东莞市厚街镇神仙水公园后门（创业路）', '113.67834', '22.86679', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1407', '西片大街B15-2', '东莞市麻涌镇川槎村甘涌文化广场', '113.75303', '22.84052', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('681', '国贸城公厕', '朱平沙村十九巷球场旁', '113.8215', '22.80718', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('746', '常平镇常新公园02公厕', '东莞市厚街镇沙塘天后庙公园旁', '113.72219', '22.80287', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('158', '路东新安大道公厕', '东莞市虎门镇白沙社区高铁站内', '113.788918', '23.020941', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1344', '厚街镇宝屯04公厕', '东莞市虎门镇怀德下庙大围田十九巷13号', '113.69608', '23.06787', '6', '万江街道', '8', '1');
INSERT INTO `igj` VALUES ('410', '大朗69', '长安镇霄边社区广场内', '113.96136', '23.03472', '6', '横沥镇', '8', '1');
INSERT INTO `igj` VALUES ('884', '凤岗镇49号公厕', '长安镇上角社区青龙中路综合市场对面', '113.84112', '22.91093', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('1219', '大朗41', '东莞市东昇路星河城', '113.97396', '23.06962', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('82', '大岭山农场公厕', '万江街道小享社区文化广场旁', '113.886108', '23.107212', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('961', '华阳南坊公厕', '东莞市横沥镇张坑村桂湖路', '114.12466', '22.762834', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('616', '厚街镇厚涌路公厕 ', '黄沙河公园', '114.17888', '22.83651', '6', '清溪镇', '8', '1');
INSERT INTO `igj` VALUES ('930', '厚街镇沙岗厦公厕      ', '东莞市石排镇下沙刘屋元吓路4号', '114.130742', '22.741551', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('51', '平山致源路公厕', '东江大堤', '113.794319', '22.987312', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1093', '常平镇桥梓爱莲广场公厕', '环村路市场边', '113.68092', '22.96514', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('737', '重河公厕', '东莞市清溪镇银湖医院侧', '113.74942', '22.79829', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('457', '樟木头金河公厕', '昌盛南路体育广场旁', '114.11454', '23.02926', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('418', '滨江公园驿站公厕', '光明社区老人活动中心旁', '113.98095', '23.01357', '6', '横沥镇', '8', '1');
INSERT INTO `igj` VALUES ('122', '厚街镇珊美04公厕', '东莞市厚街镇三屯公园旁', '113.823906', '23.076934', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('489', '新安6号公厕', '长安镇厦岗社区沿江北街25号旁', '114.0866', '23.00863', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('728', '', '新城加油站侧', '113.76414', '22.79079', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('171', '虎英公园（钓鱼场）公厕', '横沥镇新城工业区裕宁北路压缩站旁', '114.058413', '22.845421', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('1027', '草墩村', '东莞市东纵路208万达广场万达广场', '113.75953', '23.04917', '6', '莞城街道', '8', '1');
INSERT INTO `igj` VALUES ('388', '下江城村', '环村路荷花池旁', '113.94202', '22.9998', '6', '东坑镇', '8', '1');
INSERT INTO `igj` VALUES ('1129', '石龙镇民生路公共厕所', '长安镇上沙社区中山北路43号（体育公园内）', '113.64786', '22.93159', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('776', '樟木头樟罗公厕', '沿河路公安分局旁', '113.850365', '22.991365', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('280', '城市公园公厕', '东莞市莞城区西正路兴贤里', '113.8869', '23.079966', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('1031', '长安汽车客运北站1楼09', '世纪广场', '113.76739', '23.04032', '6', '莞城街道', '8', '1');
INSERT INTO `igj` VALUES ('1447', '梨川股份合作门口、居委会公厕', '东莞市厚街镇涌口社区红花林公园侧', '113.30873', '22.8501', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('114', '鸡翅岭村', '东莞市寮步镇小坑松沙路', '113.823906', '23.076934', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1489', '常平镇常平公园02公厕', '塘角兴辉市场', '113.69615', '22.78613', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('703', '厚街镇河田01公厕', '东莞市莞城区东正路花园巷29号侧', '113.79498', '22.79484', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('1367', '新塘幼儿园球场公厕', '东莞市虎门镇赤岗社区翠湖路南社酒厅旁', '114.08198', '22.91407', '6', '樟木头镇', '8', '1');
INSERT INTO `igj` VALUES ('1258', '12沙头新市场公厕', '东莞市东纵路208万达广场万达广场', '113.62085', '22.93012', '6', '沙田镇', '8', '1');
INSERT INTO `igj` VALUES ('1339', '国贸城公厕', '东莞市虎门镇南栅社区南冲口村小组办公楼内', '113.7392', '23.03296', '6', '万江街道', '8', '1');
INSERT INTO `igj` VALUES ('783', '凤岗镇64号公厕', '长安镇乌沙社区江河街十一巷4号对面陈屋新村公园', '113.859275', '23.026265', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('1100', '\"北栅', '东莞市樟木头镇镇标公园旁', '113.69775', '22.96931', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('14', '广场公厕\"', '沙田镇先锋村创业北路一巷（113.62085；22.93012）', '113.77573', '23.06827', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('300', '厚街镇神仙水公园02公厕       ', '万江街道坝头社区下坝公园', '114.00091', '22.98022', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1360', '川槎甘涌公厕', '东莞市寮步镇塘唇公园内', '113.69748', '23.04698', '6', '万江街道', '8', '1');
INSERT INTO `igj` VALUES ('1379', '望牛墩朱平沙村十九巷公共厕所', '东莞市厚街镇陈屋村小公园内', '113.74942', '23.12953', '6', '中堂镇', '8', '1');
INSERT INTO `igj` VALUES ('1183', '厚街镇天后庙公厕       ', '樟村文华路195号（樟村老人活动中心）', '113.75377', '22.90646', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('41', '\"白沙', '东莞市常平镇市场路', '113.759221', '23.039389', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1032', '高铁站公厕\"', '万江街道大汾社区文化广场', '113.76224', '23.04222', '6', '莞城街道', '8', '1');
INSERT INTO `igj` VALUES ('1429', '\"怀德', '东莞市中堂镇潢涌村湿地公园内', '113.71095', '22.83557', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('34', '下庙公厕\"', '东莞市厚街镇大迳古村十巷15号', '113.809441', '23.054737', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1350', '霄边广场公厕02号', '东莞柏洲边松岭公园', '113.71576', '23.07897', '6', '万江街道', '8', '1');
INSERT INTO `igj` VALUES ('1485', '上角03号公厕', '东莞市莞城区金牛路草塘转运站侧', '113.70412', '22.79463', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('202003270002', '星河城广场公厕', '东莞市虎门镇北栅社区西坊工业区西兴一街12号附近', '114.18518', '22.82097', '6', '清溪镇', '8', '1');
INSERT INTO `igj` VALUES ('1531', '小享广场公厕', '东莞市东城区桑园广场', '113.67165', '22.83032', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('256', '横沥镇张坑公共厕所', '东莞万江街道黄粘洲文化广场旁', '113.904435', '23.067505', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('1326', '黄沙河公厕', '东莞市虎门镇南栅社区富民路象山公园(足球场旁)', '113.56739', '23.07983', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('822', '下沙刘屋公厕0204', '东莞市清溪镇厦坭路厦坭桥附近', '113.562', '22.5557', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('447', '东江大堤1公厕', '东莞市虎门镇东方社区西上三巷6号对面', '114.01648', '23.041736', '6', '企石镇', '8', '1');
INSERT INTO `igj` VALUES ('915', '凤岗镇36号公厕', '南社村新民宿；', '113.82263', '22.93749', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('477', '银湖公厕', '东莞市麻涌镇南洲村向南路口公厕', '114.05119', '23.0098', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('329', '凤岗镇04号公厕', '横塘街11队新区垃圾转运站二楼', '113.99859', '22.95954', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('550', '光明老人活动中心公厕', '企石镇莫屋村停车场', '113.3932', '23.38', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('841', '厚街镇三屯公园公厕    ', '连平村上高田', '113.5443', '22.5251', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('142', '南湖公园07公厕', '田头角棠堤东街', '113.751796', '23.020704', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1354', '新城加油站B02', '东莞市常平镇还珠沥广场侧', '113.73244', '23.06255', '6', '万江街道', '8', '1');
INSERT INTO `igj` VALUES ('325', '横沥镇新城工业区公厕', '望牛墩镇南昌路13号', '113.98348', '22.95653', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1453', '万达广场公厕', '松水路', '113.7155', '22.84831', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('592', '环村路公厕', '东莞市鸿福东路1号民盈国贸中心', '114.14779', '22.963', '6', '谢岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1046', '上沙04公厕', '东莞市万江石美老人活动中心', '113.67085', '22.94197', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1216', '沿河路公厕', '东莞市常平镇袁山贝金龙路', '113.95548', '29.09161', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('610', '莞城区兴贤里公厕15号', '东莞市虎门镇赤岗社区南坊一路南坊酒厅内', '114.22548', '22.97191', '6', '谢岗镇', '8', '1');
INSERT INTO `igj` VALUES ('39', '世纪广场公厕', '谢岗镇振兴工业区路口', '113.852396', '23.105016', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('466', '厚街镇涌口07公厕', '东莞市厚街镇中心小学对面', '114.08545', '23.00209', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('112', '小坑松沙路公厕', '石排镇太和圩路1号（即石排中心小学对面）', '113.823906', '23.076934', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('505', '塘角兴辉市场公厕', '东莞市谢岗镇窑山文化广场旁', '114.125481', '23.033247', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('202003270007', '莞城区花园巷公厕19号', '东莞市鳌峙塘基西路', '114.17888', '22.83651', '6', '清溪镇', '8', '1');
INSERT INTO `igj` VALUES ('1312', '\"赤岗', '石水口公园大门侧边', '113.60862', '23.09', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('953', '翠湖路公厕\"', '东莞市东纵路208万达广场万达广场', '114.112941', '22.738514', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('299', '万达广场公厕', '桥东路北三街旧水磨厂附近', '114.0008', '22.9835', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('944', '\"南栅南冲', '清厦五金城旁2号公厕', '114.137104', '22.737623', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1513', '口村公厕\"', '东莞市麻涌镇黎滘村荷花池侧', '113.67314', '22.80924', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('175', '乌沙3号公厕', '天堂围大树下', '114.058413', '22.845421', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('275', '樟木头镇标公园公厕', '东莞市常平镇西兴街与商业大街交界', '113.897944', '23.038903', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('250', '沙田先锋村公共厕所', '碧湖森林公园公厕', '113.914836', '23.050736', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('877', '下坝公共厕所', '东莞市虎门镇九门寨综合市场一楼', '113.968749', '22.900533', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('1319', '塘唇公园', '科苑城古寮三路', '113.5467', '23.05129', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('648', '厚街镇陈屋03公厕', '刘黄文化公园；', '113.83756', '22.83218', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('526', '樟村公园公厕', '超朗上围市场；', '113.85518', '23.11722', '6', '石龙镇', '8', '1');
INSERT INTO `igj` VALUES ('811', '常平镇市场路公厕', '凤山农业园', '113.5416', '22.5546', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('1250', '大汾社区公园公厕', '东莞市麻涌镇大盛村对面海新公园', '113.9293', '23.10311', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('455', '潢涌湿地公园公厕', '长安镇霄边第四工业园G107绿道驿站', '114.09634', '23.0156', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('1225', '厚街镇大迳古村公厕  ', '东莞市石龙镇中山西社区新春街1号之一', '113.99446', '23.09678', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('1375', '松岭体育公园公厕', '富通路', '114.111714', '22.932231', '6', '樟木头镇', '8', '1');
INSERT INTO `igj` VALUES ('614', '莞城区草塘公厕21号', '东莞市石排镇石排潇湴湖北', '114.452', '22.594', '6', '谢岗镇', '8', '1');
INSERT INTO `igj` VALUES ('740', '\"北栅', '珠岭公园', '113.73936', '22.80437', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('919', '西坊公厕\"', '东莞市石排镇赤坎广场路2号', '113.81875', '22.90593', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('571', '桑园广场2公厕', '东莞市樟木头镇丰门下围路一巷8号原农贸市场后', '113.63535', '23.05841', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('209', '黄粘洲社区文化广场公厕', '东莞市谢岗镇银山湿地公园B区驿站', '114.117087', '22.805337', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('599', '南栅象山公厕(2)', '长安镇厦边社区厦边大道厦边广场竹园', '114.1531', '22.95965', '6', '谢岗镇', '8', '1');
INSERT INTO `igj` VALUES ('263', '厦坭公厕', ' 大片美村美前路', '113.893912', '23.045534', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('609', '\"东方西上', '望牛墩镇杜屋村振华路杜屋休闲公园内', '114.2113', '22.94752', '6', '谢岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1014', '街公厕\"', '东莞市塘厦镇石潭埔社区创兴路，鲤鱼塘水库隔壁', '113.75898', '23.05311', '6', '莞城街道', '8', '1');
INSERT INTO `igj` VALUES ('803', '南社村新民宿公厕', '谢岗镇五星上湖新村', '113.5451', '22.5718', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('381', '南洲向南公厕', '上元上周塘；', '114.01372', '22.99292', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1175', '大朗39', '东莞市谢岗镇南面谢禾山村', '113.70082', '22.94106', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('859', '莫屋村公厕', '东莞市莞城区运河西一路163号', '113.957646', '22.934405', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('1000', '连平村', '巷头富康北区', '113.763865', '23.114087', '6', '高埗镇', '8', '1');
INSERT INTO `igj` VALUES ('346', '棠堤东街B17-2', '东莞市常平镇上坑路文化广场旁', '114.02304', '22.97855', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('946', '常平镇还珠沥广场公厕', '东莞市厚街镇汀山文化广场', '114.144792', '2.742111', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('103', '望牛墩赤滘村南昌路公共厕所', '盘古庙', '113.774541', '23.032937', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1408', '大朗59', '宝莲村委会篮球场', '113.75624', '22.84045', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1398', '国贸城公厕', '东莞市常平镇公园路铁路公园内', '113.65976', '23.10068', '6', '中堂镇', '8', '1');
INSERT INTO `igj` VALUES ('1188', '石美社区3A旅游景区公厕', '园龙山公园公厕', '113.744102', '22.904461', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1094', '常平镇袁山贝金龙路公厕', '华润万家一楼', '113.67894', '22.96115', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1334', '\"赤岗', '东莞市虎门镇怀德水巷十八巷7号', '113.74493', '23.03384', '6', '万江街道', '8', '1');
INSERT INTO `igj` VALUES ('343', '南坊公厕\"', '东莞市中堂镇乐阳街与振兴路交汇处', '114.03103', '22.96741', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1054', '振兴工业区公厕', '东莞市厚街镇新围社区文博幼儿园停车场', '113.7025', '22.91859', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1168', '厚街镇八一站公厕 ', '东莞市厚街镇三屯企山头篮球场旁', '113.68477', '22.936991', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('400', '石排中心小学对面0101', '东江大道万江街道坝头绿道旁', '113.96389', '23.01566', '6', '横沥镇', '8', '1');
INSERT INTO `igj` VALUES ('1252', '窑山新村公厕', '东莞市常平镇土塘村公园', '113.910888', '23.107557', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('1009', '鳌峙塘工业区公厕', '东莞市厚街镇神仙水公园正门（东业路）', '113.767376', '23.125957', '6', '高埗镇', '8', '1');
INSERT INTO `igj` VALUES ('234', '石水口公园B15-6', '东莞市厚街镇河田石厦球场边', '113.842833', '23.075255', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('364', '万达广场公厕', '东莞市横沥镇沿江路', '114.03097', '22.98902', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('987', '屋厦旧村公厕2', '东莞市石排镇石排红石山公园', '114.155051', '22.702688', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('752', '清厦公厕', '塘厦村工业大道社区卫生站对面', '113.894795', '22.998165', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('4', '黎滘公园公厕', '绿道驿站旁；', '113.77492', '23.016285', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('339', '凤岗镇27号公厕', '东莞市常平镇横江厦农贸市场内', '114.011711', '22.93988', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1125', '常平镇西兴街公厕', '雁田新公园公厕', '113.6481', '22.92845', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1492', '凤岗镇18号公厕', '东莞市寮步镇寮步社区神前街', '113.413979', '22.481103', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('593', '九门寨市场公厕（1）', '东莞市东城中路2号旗峰公园', '114.752', '22.5821', '6', '谢岗镇', '8', '1');
INSERT INTO `igj` VALUES ('879', '科苑城公厕', '东莞市常平镇桥沥市场内', '113.8376', '22.91711', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('1302', '刘黄球场旁公厕', '东莞市厚街镇涌口社区庆升广场侧', '113.56772', '23.00248', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('429', '超朗上围市场公厕', '东莞市虎门镇东风社区东安路公园内', '113.95976', '23.0434', '6', '横沥镇', '8', '1');
INSERT INTO `igj` VALUES ('981', '大朗93', '谢岗镇岭背宴会大楼旁', '114.1628', '22.703473', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('355', '大盛公园公厕', '大岭山体育公园', '114.06526', '22.96742', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('810', '107国道驿站公厕', '东莞市麻涌镇漳澎市场商铺旁边', '113.5348', '22.5521', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('894', '石龙镇新春公共厕所', '横沥镇山厦村上东路64号旁边', '113.7878', '22.91794', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('1534', '大朗26', '新园路', '113.67126', '22.8274', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1230', '潇湴湖北公厕2002', '东莞市常平镇陈屋贝市场', '113.96737', '23.11157', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('83', '珠玲公园B01-5', '松柏朗富通路旁', '113.886108', '23.107212', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('937', '石排0701', '大岭山镇大环村文体公园', '114.143956', '22.760683', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('31', '樟木头裕丰公厕', '东莞市虎门镇东方新村四巷20号对面', '113.816483', '23.073105', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('497', '银山湿地公园B区驿站公厕', '东莞市石排镇田寮教育路东一巷4号', '114.0979', '23.02949', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('371', '厦边02公共厕所', '东江大堤', '114.03161', '22.98238', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1402', '大片美村', '永盛北卧龙小区', '113.44555', '22.48528', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('577', '望牛墩杜屋村公共厕所', '禾塘垃圾转运站二楼', '113.3641', '23.146', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('666', '塘厦镇石潭埔鲤鱼塘工业区购物中心公共厕所', '邓屋村南门路', '113.473676', '22.492275', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('826', '五星村公厕', '东莞市常平镇隐贤山庄景区内', '113.5713', '22.5338', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('912', '上元上周塘公厕', '东莞市虎门镇树田社区树田大地19巷', '113.8258', '22.93634', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('367', '南面村谢禾山公厕', '官洲村振南路15号', '114.03307', '22.97796', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1035', '莞城区北门公厕01号', '长安镇体育公园', '113.774', '23.03159', '6', '莞城街道', '8', '1');
INSERT INTO `igj` VALUES ('146', '大朗15', '杨涌球场公园旁', '113.751796', '23.020704', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1053', '常平镇上坑文化广场公厕', '连平上高田村篮球场旁', '113.67338', '22.94909', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('139', '厚街镇汀山文化广场公厕        ', '东莞市常平镇隐贤山庄景区内', '113.751796', '23.020704', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('468', '大朗78', '东莞市莞城区美峰路', '114.08382', '23.00472', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('562', '宝莲村', '东莞市鸿福东路1号民盈国贸中心', '113.372573', '23.23445', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('973', '常平镇铁路公园02公厕', '东莞市厚街镇松山公园西边公厕', '114.189412', '22.729014', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1300', '凤岗镇20号公厕', '东莞市鸿福东路1号民盈国贸中心', '113.559', '23.00607', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('897', '华润万家一楼公厕', '沙田大街3号饭堂侧', '113.81896', '22.92121', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('19', '\"怀德', '望牛墩镇洲涡边海新村后面', '113.79258', '23.01941', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('204', '水巷公厕\"', '滨河路上片', '114.091162', '22.775724', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('243', '凯荣街公厕', '东莞市麻涌镇漳澎村新蕉站', '113.878261', '23.07297', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('278', '厚街镇新围01公厕', '太公岭盛基小学旁', '113.887792', '23.078683', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('1160', '厚街镇三屯企山头篮球场公厕    ', '公务员宿舍休闲公园', '113.66601', '22.87371', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('539', '坝头绿道驿站公厕', '东莞市塘厦镇清湖头广场', '113.67553', '23.05437', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('862', '常平镇土塘公园公厕', '茶山圩公园内；', '113.943295', '22.912737', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('870', '厚街镇神仙水公园01公厕       ', '塘角广场；', '113.982061', '22.931521', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('1007', '厚街镇河田07公厕', '东莞市厚街镇白濠中心街老人院旁', '113.735062', '23.097096', '6', '高埗镇', '8', '1');
INSERT INTO `igj` VALUES ('845', '横沥镇金牛公园公共厕所', '望牛墩镇滨江公园北区', '113.939033', '22.957028', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('1368', '红石山2号2006', '校椅围花园', '114.08328', '22.897', '6', '樟木头镇', '8', '1');
INSERT INTO `igj` VALUES ('595', '塘厦村', '沙步市场', '114.12693', '22.98272', '6', '谢岗镇', '8', '1');
INSERT INTO `igj` VALUES ('883', '东江绿道公厕', '低涌娱乐文化中心对面', '113.84528', '22.90527', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('1545', '常平镇横江厦市场公厕', '巷尾球场', '113.67761', '22.82756', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('182', '凤岗镇62号公厕', '东莞市樟木头镇南城绿道驿站旁', '114.08058', '22.78133', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('1410', '神前街公厕', '谢岗镇赵林村小公园内', '113.77793', '22.82938', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('106', '旗峰公园办公楼下公厕', '大岭山公园内', '113.777962', '23.032017', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1016', '常平镇桥沥市场公厕', '东莞市虎门镇虎门寨东下四巷55号对面', '113.75158', '23.05624', '6', '莞城街道', '8', '1');
INSERT INTO `igj` VALUES ('73', '厚街镇涌口03公厕', '\"东莞市塘厦镇', '113.802315', '22.965139', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('855', '\"东风', '蛟乙塘银渠街\"', '113.944174', '22.940901', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('567', '公园公厕\"', '东莞市虎门镇怀德雅瑶新区十巷10号', '113.3847', '23.0356', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('813', '谢岗村岭背公厕', '世博广场', '113.5431', '22.554', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('1033', '体育公园办公楼旁公厕', '东莞市莞城区细村市场内', '113.75471', '23.04596', '6', '莞城街道', '8', '1');
INSERT INTO `igj` VALUES ('305', '漳澎市场公厕', '东莞市同沙生态公园', '114.00739', '22.97393', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1364', '横沥镇山厦村公厕', '大朗市场', '114.07345', '22.90707', '6', '樟木头镇', '8', '1');
INSERT INTO `igj` VALUES ('546', '凤岗镇56号公厕', '望牛墩镇寮厦村村尾', '113.3937', '23.347', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('781', '常平镇陈屋贝市场公厕', '黄草朗广场旁', '113.87255', '22.972625', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('432', '大朗25', '东莞市莞城区向阳路文化广场内', '114.008295', '23.071416', '6', '企石镇', '8', '1');
INSERT INTO `igj` VALUES ('1421', '大环村公厕', '常平镇东莞东火车站广场内', '113.73004', '22.85375', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('499', '\"东方', '东莞市樟木头镇南城公园旁', '114.11642', '23.04399', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('732', '新村公厕 \"', '望牛墩镇望东石尾村', '113.75031', '22.80152', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('1361', '石排镇田寮村公共厕所石排1001', '东莞市寮步镇上底福田新村', '113.74734', '23.05595', '6', '万江街道', '8', '1');
INSERT INTO `igj` VALUES ('1194', '东江大堤2公厕', '企石镇购物中心', '113.61729', '22.99746', '6', '洪梅镇', '8', '1');
INSERT INTO `igj` VALUES ('827', '凤岗镇11号公厕', '东莞市虎门镇陈村社区广场公园内', '113.586', '22.5536', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('1227', '禾塘公厕', '邵岗头球场旁', '113.98291', '23.0981', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('1478', '南门公厕', '长安镇厦岗社区盘福东街19号旁', '113.69549', '22.79091', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1406', '常平镇隐贤山庄景区晚翠居公厕', '万江街道东江西岸油九段渔歌广场旁', '113.75707', '22.84394', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('512', '\"树田', '镇中心市场西门入口旁', '113.88863', '23.11227', '6', '石龙镇', '8', '1');
INSERT INTO `igj` VALUES ('1386', '西方公厕\"', '东湖二街147号  ', '113.68773', '23.10944', '6', '中堂镇', '8', '1');
INSERT INTO `igj` VALUES ('270', '望牛墩官洲村公共厕所', '东莞市石排镇向西村石金塘', '113.850554', '23.042661', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('124', '体育公园北管理楼公厕', '东莞市虎门镇南栅社区运动场内', '113.751796', '23.020704', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('260', '大朗43', '\"东莞市虎门镇怀德泰丰楼上庙路14东南', '113.876146', '23.067711', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('819', '连平村', '方向125米\"', '113.574', '22.5615', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('1392', '常平镇隐贤山庄景区动物园公厕', '东莞市石龙镇新城区青林路垃圾转运站旁', '113.65389', '23.08987', '6', '中堂镇', '8', '1');
INSERT INTO `igj` VALUES ('196', '莞城区旗峰广场二25号', '东莞市中堂镇吴家涌村市场内', '114.069785', '22.764074', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('956', '国贸城公厕', '增埗卢屋市场;', '114.157031', '22.759507', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1515', '厚街镇松山公园02公厕       ', '东莞市鸿福东路1号民盈国贸中心', '113.67346', '22.81715', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1301', '国贸城公厕', '上元大塘工业区；', '113.56831', '22.99893', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('586', '沙田大街B15', '水口村广场旁', '114.21264', '22.94987', '6', '谢岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1062', '望牛墩洲涡村公共厕所', '东莞市中堂镇东向村东向市场旁', '113.69913', '22.953871', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1457', '凤岗镇48号公厕', '东莞市塘厦镇平山林场路', '113.678436', '22.834228', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1347', '漳澎蕉站公厕', '黄洞玉泉路指甲岭路口', '113.70505', '23.06297', '6', '万江街道', '8', '1');
INSERT INTO `igj` VALUES ('1172', '太公岭盛基小学旁公厕', '东莞市虎门镇九门寨新环岛路镇远桥底', '113.68211', '22.94291', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('712', '市民广场公厕', '东莞市麻涌镇漳澎村十坊同和堂隔壁', '113.78992', '22.76237', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('839', '塘厦镇清湖头广场公厕', '谢岗镇南面村银瓶红公园内', '113.5422', '22.543', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('419', '茶山圩公园公厕', '东莞市厚街镇福神岗公园内', '113.97786', '22.99955', '6', '横沥镇', '8', '1');
INSERT INTO `igj` VALUES ('219', '塘角广场公厕', '东莞市虎门镇博涌社区大卢向西工业区', '114.10384', '22.802', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('205', '厚街镇白濠04公厕', '万江街道严屋社区创新路垃圾中转站二楼', '114.099293', '22.780776', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('1042', '望牛墩滨江公园北区公共厕所', '东莞市厚街镇寮厦社区寮厦村前路9号对面', '113.76178', '23.03399', '6', '莞城街道', '8', '1');
INSERT INTO `igj` VALUES ('486', '大朗81', '长安镇新民社区兴民路新民市场旁', '114.10517', '23.01274', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('439', '大朗87', '松木山灯光球场旁', '114.0485', '23.06924', '6', '企石镇', '8', '1');
INSERT INTO `igj` VALUES ('1284', '低涌村', '横沥镇田头村荔枝公园', '113.57426', '23.04794', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('1487', '大朗64', '东莞市塘厦镇振兴围安南路', '113.69893', '22.79658', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1416', '樟木头南城绿道公厕', '东莞市塘厦镇清湖头社区清湖路', '113.733055', '22.825', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('413', '赵林村公厕', '东莞市莞城区和兴街50号对面', '114.00737', '23.02667', '6', '横沥镇', '8', '1');
INSERT INTO `igj` VALUES ('650', '大岭山公园公厕', '迳联市场', '113.48851', '22.495581', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('1466', '\"虎门寨', '企石镇旧围村转运站', '113.67624', '22.86103', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1141', '雅洁公厕\"', '东莞市麻涌镇麻三村古梅南路美食街', '113.66104', '22.89877', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('266', '蛟乙塘52号银渠街厕所', '东莞市虎门镇南栅社区冲元村小组办公楼内', '113.855177', '23.055818', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('517', '\"怀德', '东莞市虎门镇居岐公园内', '113.87485', '23.09881', '6', '石龙镇', '8', '1');
INSERT INTO `igj` VALUES ('573', '雅瑶公厕\"', '东莞市横沥镇村头村委会', '113.64034', '23.06043', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('1076', '世博广场公厕', '长安镇郊野公园', '113.668037', '22.936769', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('186', '莞城区细村公厕03号', '东莞市虎门镇白沙社区休闲公园内', '114.080371', '22.840927', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('1051', '同沙生态公园黄公山公厕', '东莞市厚街镇溪头社区长塘北街7号旁边', '113.66561', '22.94649', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('90', '大朗74', '增埗村沙墩文化广场；', '113.817469', '23.081885', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('717', '望牛墩寮厦村村尾公共厕所', '东莞市石龙镇西湖城市公园龙中体育场后', '113.76939', '22.78289', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('857', '大朗28', '望牛墩镇杜屋村广电路', '113.953569', '22.94039', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('8', '莞城区西城公厕23号', '东莞市厚街镇珊美大道方家庄门楼对面', '113.77492', '23.016285', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('494', '常平镇东莞东火车站公厕', '东莞市塘厦镇林村西湖区广场北侧', '114.1004', '23.03016', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('353', '樟木头南城公园公', '东莞市厚街镇新房路中段', '114.06663', '22.96591', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1324', '望牛墩望东村公共厕所', '东莞榴花公园', '113.57941', '23.08085', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('189', '上底福田新村公厕', '长安镇沙头靖海中路猫山公园内', '114.087055', '22.833376', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('1072', '购物中心公厕', '西坊区', '113.65201', '22.94525', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('356', '\"陈村', '东莞市东城中路2号旗峰公园', '114.07431', '22.98063', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1167', '公园公厕\"', '邓屋村东门路', '113.682011', '22.933431', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('10', '', '东莞市常平镇陈屋贝银行侧', '113.759249', '23.054054', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('394', '盘福东街02公厕', '东莞市麻涌镇华阳村中坊新村北市场南门口', '113.96144', '22.99938', '6', '东坑镇', '8', '1');
INSERT INTO `igj` VALUES ('932', '渔歌广场星级公厕', '东莞市塘厦林村西强街2号', '114.143629', '22.749195', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('167', '中心市场公共厕所', '东莞市厚街镇厚街社区禾仓路', '114.058413', '22.845421', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('518', '大朗44', '东莞市常平镇司马公园', '113.862712', '23.117941', '6', '石龙镇', '8', '1');
INSERT INTO `igj` VALUES ('1131', '石金塘0801', '东莞市厚街镇河田村敬老中心旁', '113.65033', '22.923141', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('98', '南栅运动场公厕', '东城街道堑头围面街', '113.777962', '23.032017', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1280', '\"怀德', '塔岗村委会', '113.57131', '23.04866', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('1028', '上庙公厕\"', '永和街', '113.76048', '23.04892', '6', '莞城街道', '8', '1');
INSERT INTO `igj` VALUES ('461', '石龙镇青林路公共厕所', '花园街广场', '114.10832', '23.024124', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('201', '吴家涌公厕', '东莞市石龙镇中山东竹园街九巷4号', '114.113917', '22.763062', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('427', '增埗卢屋市场公厕', '东莞市厚街镇涌口社区海月公园瀑布旁', '113.97358', '23.04949', '6', '横沥镇', '8', '1');
INSERT INTO `igj` VALUES ('699', '国贸城公厕', '世博广场G区二楼', '113.79389', '22.81499', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('1195', '上元大塘工业区公厕', '东莞市麻涌镇麻一村三坊大街（麻一市场旁边）', '113.6188', '23.00282', '6', '洪梅镇', '8', '1');
INSERT INTO `igj` VALUES ('671', '大朗36', '东莞市莞城区市桥路1号', '113.80058', '22.80571', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('969', '东向公厕', '体育馆游泳池侧', '114.162033', '22.728483', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('295', '平山林场路公厕', '东莞市塘厦镇桥陇社区庙下公厕', '113.877513', '23.086735', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('670', '凤岗镇31号公厕', '横沥镇新四村油榨村三江市', '113.80051', '22.80587', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('815', '\"镇远桥底', '长安镇新安社区横岗街一巷19号东', '113.566', '22.5619', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('1214', '公厕\"', '洪梅镇黎洲角村绿园路1号', '113.62422', '22.98531', '6', '洪梅镇', '8', '1');
INSERT INTO `igj` VALUES ('588', '漳澎陈祠堂公厕', '长安汽车客运总站', '114.18125', '22.96923', '6', '谢岗镇', '8', '1');
INSERT INTO `igj` VALUES ('719', '南面村公厕', '油甘埔油溪路篮球场旁', '113.77478', '22.78544', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('1469', '厚街镇福神岗公园02公厕       ', '冲美文化广场；', '113.68903', '22.8147', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1282', '\"博涌大卢', '长安汽车客运总站', '113.57287', '23.04159', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('1542', '向西公厕\"', '美景路美景酒店后面', '113.68258', '22.82474', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('649', '严屋垃圾转站公厕', '洪梅镇洪梅西站旁', '113.473954', '22.50145', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('1281', '厚街镇寮厦村前路9号对面公厕    ', '谢岗镇大厚村公园内', '113.57884', '23.05007', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('1030', '新民3号公厕', '长安镇沙头振安中路276号', '113.76142', '23.04639', '6', '莞城街道', '8', '1');
INSERT INTO `igj` VALUES ('1099', '大朗56', '东莞市虎门镇金洲南坊村前路', '113.69733', '22.97129', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1109', '横沥镇田头村荔枝公园公厕（1）', '东莞市麻涌镇麻二社区沿河东街42号旁', '113.6748', '22.92635', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('708', '安南路公厕', '东莞市虎门镇虎门寨永安路126号对面', '113.78877', '22.79654', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('846', '塘厦镇清湖路公厕', '长安镇郊野公园', '113.93368', '22.956189', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('1448', '莞城区东豪公厕32号', '东莞市麻涌镇麻二社区北坊街4号旁（社区卫生中心旁）', '113.71266', '22.85018', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('6', '', '东莞市莞城区新芬路迈豪街八巷', '113.77492', '23.016285', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('503', '旧围村公厕', '东莞市厚街镇陈屋村太平西路', '114.122509', '23.032259', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('1224', '古梅路公厕', '东莞市厚街镇桥头新屋 ', '113.97893', '23.09512', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('496', '\"南栅', '长安镇乌沙社区李屋西坊街一巷象岗山公园内', '114.0979', '23.02949', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('778', '冲元村公厕\"', '旺富市场', '113.859275', '23.026265', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('238', '居岐公园公厕', '东莞市虎门镇赤岗社区赤马路24号对面', '113.903049', '23.048624', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('959', '横沥镇村头公园公共厕所', '东莞市东城中路2号旗峰公园', '114.134293', '22.757026', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('202003270001', '郊野公园18号公厕', '桥东路北二街村篮球场附近', '114.17535', '22.80114', '6', '清溪镇', '8', '1');
INSERT INTO `igj` VALUES ('1548', '白沙休闲公园公厕', '东莞市石排镇黄家坣工业北路15号对面', '113.67587', '22.8294', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('395', '厚街镇溪头长塘街公厕      ', '邓屋村南门路', '113.97516', '22.99807', '6', '东坑镇', '8', '1');
INSERT INTO `igj` VALUES ('304', '增埗村沙墩文化广场公厕', '东莞市寮步镇塘边公园', '114.01342', '22.98817', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('513', '石龙镇西湖城市公园公共厕所', '伟建工业园内（文化广场）；', '113.8896', '23.13031', '6', '石龙镇', '8', '1');
INSERT INTO `igj` VALUES ('1322', '望牛墩杜屋村广电路公共厕所', '下围村小组公园内', '113.54801', '23.05518', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('247', '厚街镇珊美02公厕', '东莞市清溪镇青篁南路80附近', '113.918842', '23.06263', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('456', '塘厦林村广场公厕', '东莞市虎门镇虎门寨东上七巷旁', '114.09426', '23.01689', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('249', '厚街镇新房路公厕 ', '坑美文化广场', '113.918959', '23.049518', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('448', '榴花塔顶公厕', '东莞市常平镇常平口岸大道', '114.016', '23.0417', '6', '企石镇', '8', '1');
INSERT INTO `igj` VALUES ('450', '05沙头商贸城西站公厕', '东莞市石龙镇新城区环岛路', '113.59302', '23.3398', '6', '企石镇', '8', '1');
INSERT INTO `igj` VALUES ('1020', '大朗76', '东莞市麻涌镇大盛村新村前街河边', '113.75596', '23.05641', '6', '莞城街道', '8', '1');
INSERT INTO `igj` VALUES ('764', '旗峰公园次入口厕所', '牛过蓢古树公园；', '113.867727', '22.99874', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('487', '北门公厕', '桥头文化广场', '113.923459', '23.081838', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('498', '常平镇陈屋贝银行侧公厕', '超朗村下围；', '114.09026', '23.04306', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('45', '华阳市场公厕', '企石镇杨屋文化中心', '113.791215', '23.059419', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1018', '塘厦林村西强东街公厕', '企石镇南坑村旗峰路', '113.75509', '23.04952', '6', '莞城街道', '8', '1');
INSERT INTO `igj` VALUES ('1389', '厚街镇禾仓公厕   ', '东莞市莞城区史园街2号', '113.67325', '23.10316', '6', '中堂镇', '8', '1');
INSERT INTO `igj` VALUES ('584', '常平镇司马公园公厕', '东莞市寮步镇香市公园', '114.21194', '22.98628', '6', '谢岗镇', '8', '1');
INSERT INTO `igj` VALUES ('645', '厚街镇河田06公厕', '迳联大围旧路古村落前', '113.81761', '22.81615', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('1039', '堑头大围路公厕', '朗厦村新兴街356号', '113.76203', '23.03159', '6', '莞城街道', '8', '1');
INSERT INTO `igj` VALUES ('529', '塔岗公厕', '东莞下桥银竹路', '113.86435', '23.11589', '6', '石龙镇', '8', '1');
INSERT INTO `igj` VALUES ('1318', '凤岗镇06号公厕', '东莞市莞城区莞太路163号侧', '113.60475', '23.0901', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('639', '花园街广场公厕', '东莞市中堂镇东泊社区原东泊小学门口', '114.1011', '22.5052', '6', '清溪镇', '8', '1');
INSERT INTO `igj` VALUES ('1104', '石龙镇人民广场公共厕所', '谢岗镇黎村草湖公园', '113.67129', '22.92831', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1427', '厚街镇涌口09公厕', '长安镇东门路青少年宫旁', '113.724806', '22.810171', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1462', '世博广场G区二楼公厕', '东莞市莞城区八达路华利五金批发市场内', '113.694123', '22.865226', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('796', '麻一市场公厕', '东莞市石龙镇中山东社区绿化东路41号', '113.5533', '22.5611', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('13', '莞城区木巷公厕16号', '东莞市麻涌镇鸥涌村蒲基小公园内', '113.77477', '23.06773', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1061', '', '东莞市清溪镇公园中路', '113.69898', '22.95096', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1261', '塘厦镇桥陇庙下公厕', '东莞市厚街镇桥头祠边九牙石球场旁 ', '113.61355', '22.90177', '6', '沙田镇', '8', '1');
INSERT INTO `igj` VALUES ('782', '横沥镇新四村油榨村三江市场', '东莞市虎门镇大宁社区民安路106号', '113.845055', '22.994315', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('1480', '新安5号公厕', '东莞市虎门镇新联新安路段(即新联将军山公园旁)', '113.69377', '22.7856', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1482', '黎洲角公共厕所', '大朗体育馆后面', '113.70917', '22.79135', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1535', '长安汽车客运总站1楼女厕', '樟村大道北4号(樟村球场舞台后面）', '113.67062', '22.82965', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('258', '凤岗镇44号公厕', '东莞市厚街镇福神岗公园内', '113.905669', '23.066174', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('1321', '冲美文化广场公厕', '沙田镇阇西山公园（113.61355；22.90177）', '113.5494', '23.05304', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('1003', '长安汽车客运总站1楼男厕', '东莞市寮步镇井巷公园侧', '113.721354', '23.09442', '6', '高埗镇', '8', '1');
INSERT INTO `igj` VALUES ('467', '大朗30', '东莞市虎门镇南栅社区三蒋村小组办公楼内', '114.08297', '23.00773', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('754', '站前公园公厕', '东莞市虎门镇南栅社区平岗村小组球场旁', '113.895565', '22.999955', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('735', '大厚村公厕', '东莞市虎门镇东方西下五巷5号对面', '113.74588', '22.78422', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('1426', '08金沙广场公厕', '南社村关帝庙后面；', '113.717241', '22.807208', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1277', '\"金洲', '东莞市麻涌镇大盛村旧村坊沿河路', '113.6543', '22.83662', '6', '沙田镇', '8', '1');
INSERT INTO `igj` VALUES ('838', '南坊公厕\"', '第一市场街心公园旁', '113.552', '22.5516', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('1120', '麻二沿河东街公厕', '石水口广场旁', '113.65928', '22.92587', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('473', '虎门寨旅游大厦公厕', '东莞市寮步镇寮步社区三眼塘', '114.05614', '23.01393', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('1378', '郊野公园西经办公室公厕', '长安镇厦岗社区福海路135号旁', '113.74171', '23.13053', '6', '中堂镇', '8', '1');
INSERT INTO `igj` VALUES ('777', '麻二北坊公厕', '东莞市虎门镇大宁社区宁江路24号', '113.844187', '22.970003', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('1303', '莞城区新芬路公厕18号', '沙田镇稔洲村广场旁（113.6543；22.83662）', '113.61515', '23.0783', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('354', '厚街镇陈屋02公厕', '洋坑塘村围面前196号', '114.06329', '22.96457', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('320', '厚街镇桥头社区08公厕', '东莞市厚街镇园新三路凤山公园西门公厕', '113.97732', '22.97622', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('187', '乌沙8号公厕', '大洲社区新兴街', '114.095998', '22.841915', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('1500', '大朗65', '东莞市中堂镇潢涌村体育馆旁', '113.71826', '22.77723', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('594', '\"赤岗', '东莞市寮步镇佛灵湖2号停车场', '114.14802', '22.97941', '6', '谢岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1260', '广场公厕\"', '东莞市麻涌镇川槎村川槎大街鱼塘边', '113.596692', '22.871515', '6', '沙田镇', '8', '1');
INSERT INTO `igj` VALUES ('710', '旗峰公园古庙厕所', '东莞市常平镇陈屋贝饭堂侧', '113.79377', '22.76773', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('993', '中心岗公厕', '东莞市常平镇振兴西路河西公园内', '113.733525', '23.110903', '6', '高埗镇', '8', '1');
INSERT INTO `igj` VALUES ('1010', '黄家坣0601', '东莞市塘厦镇林村新阳路', '113.764595', '23.102951', '6', '高埗镇', '8', '1');
INSERT INTO `igj` VALUES ('502', '沙井公厕', '东莞市虎门镇路东新安大道中步行街公厕', '114.12294', '23.03227', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('1399', '塘边公园公厕', '谢岗镇谢岗村公园内', '113.64823', '23.09316', '6', '中堂镇', '8', '1');
INSERT INTO `igj` VALUES ('1057', '伟建工业园内公厕（文化广场）', '沙田镇沙田港区环湖公园（113.5966916125；22.8715154417）', '113.69208', '22.88595', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('864', '凤岗镇34号公厕', '长安镇新民社区兴盛路人民涌旁', '113.923854', '22.884022', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('935', '青皇公厕', '三联村旧小学旁', '114.134856', '22.750225', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1306', '\"虎门寨', '冼沙村二上坊公园', '113.59914', '23.0753', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('59', '绿化队公厕\"', '桥东路北二街屋厦广场', '113.787689', '23.010014', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1146', '坑美公厕', '东莞市中堂镇中堂敬老院旁', '113.68068', '22.89114', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('365', '常平镇火车站公厕', '东莞市厚街镇沙溪湖公园2号驿站', '114.03145', '22.98286', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('113', '石龙镇环岛路公共厕所', '犀牛陂村综合市场边', '113.823906', '23.076934', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('606', '大盛新村公厕', '昌盛北路农贸市场旁', '114.22095', '22.9875', '6', '谢岗镇', '8', '1');
INSERT INTO `igj` VALUES ('288', '牛过蓢古村落旅游公厕', '东莞市麻涌镇川槎村螺村市场旁', '113.850132', '23.084028', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('296', '文化广场B01-6', '东莞市东城中路2号旗峰公园', '113.900761', '23.039005', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('1208', '超朗村下围公厕', '东莞市厚街镇溪头社区东二环路油蛇公园内', '113.62468', '23.01731', '6', '洪梅镇', '8', '1');
INSERT INTO `igj` VALUES ('1181', '杨屋村公厕', '东莞市常平镇隐贤山庄景区内', '113.724552', '22.931378', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('558', '南坑村公厕', '东莞市东纵路208万达广场万达广场', '113.397', '23.346', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('749', '莞城区史园公厕08号', '东莞市谢岗镇黎村头圩榕树头对面', '113.72142', '22.80272', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('1285', '青少年活动中心公厕', '京山新市场;', '113.56704', '23.05142', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('1240', '', '孙屋广场旁；', '113.931', '23.08401', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('543', '朗厦公厕', '洪梅镇梅沙村东三区一巷10号', '113.3849', '23.32', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('706', '下桥垃圾中转站公厕', '东莞市厚街镇环冈社区荔园路小公园', '113.7928', '22.79937', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('390', '莞城区莞太路公厕06号', '聚龙江村横江南路6号', '113.93243', '23.00877', '6', '东坑镇', '8', '1');
INSERT INTO `igj` VALUES ('1451', '东泊公厕', '长安镇上角社区雅园西街雅园公园二楼', '113.71153', '22.85226', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('366', '黎村草湖公园公厕', '东莞市麻涌镇麻三村古梅乡韵麻小公园侧', '114.03474', '22.98346', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('236', '长安镇东城站公厕', '东莞市石排镇古村一路前广场', '113.900766', '23.048405', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('547', '莞城区八达路公厕29号', '望牛墩河西八坊三巷', '133.668922', '23.055238', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('713', '石龙镇绿化东路公共厕所', '长安镇乌沙社区蔡屋裕兴路77号对面', '113.77642', '22.79212', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('62', '蒲基公园公厕', '亭岗绿道', '113.787689', '23.010014', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1165', '清溪文化公园中路星级公厕', '东莞市虎门镇赤岗社区东北酒厅旁', '113.68794', '22.93659', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('721', '厚街镇桥头社区03公厕', '东莞市常平镇隐贤山庄景区内', '113.77305', '22.79824', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('1373', '\"大宁', '伟建工业园内（观光阁）；', '114.108831', '22.923581', '6', '樟木头镇', '8', '1');
INSERT INTO `igj` VALUES ('1081', '治保会公厕\"', '望牛墩镇扶涌路6号', '113.66729', '22.95894', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('349', '\"新联', '长安镇沙头东坊北街东引巷1号对面', '114.05633', '22.94835', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1079', '新安路公厕\"', '东莞虎英公园', '113.67252', '22.95959', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('773', '大朗33', '东莞市厚街镇河田角元始基公园内', '113.82032', '23.0296', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('1289', '樟村球场公厕', '长安镇沙头沙头市场东门', '113.59236', '23.05371', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('1501', '厚街镇福神岗公园01公厕       ', '东莞市樟木头镇振昌路87号', '113.6907', '22.76414', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('208', '沙田阇西山公园公共厕所', '东莞市厚街镇宝屯体育路（市政办公室旁）', '114.102435', '22.810895', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('253', '井巷公园公厕', '东莞市常平镇九江水公园内', '113.904159', '23.050171', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('829', '南栅三蒋村公厕', '东莞市厚街镇宝屯宝塘厦宝民路北', '113.584', '22.568', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('535', '南栅平岗村球场公厕', '东莞市寮步镇汽车东站', '113.66607', '23.05717', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('1477', '\"东方', '东莞市麻涌镇东太村太和', '113.68576', '22.79555', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1244', '西头公厕\"', '东莞市虎门镇沙角社区路中路沙角广场旁', '113.92023', '23.09803', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('433', '南社村关帝庙后面公厕', '东莞市塘厦镇石潭埔社区江源路10号，居民会门口旁', '114.007829', '23.067934', '6', '企石镇', '8', '1');
INSERT INTO `igj` VALUES ('1433', '大盛旧村公厕', '南社古民居内古戏台旁；', '113.71781', '22.83455', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('414', '欧邓村', '土地坑市场公园旁', '114.0117', '23.03833', '6', '横沥镇', '8', '1');
INSERT INTO `igj` VALUES ('986', '石水口广场B15-5', '望牛墩镇文化广场', '114.164704', '22.69807', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1063', '三眼塘公厕', '东莞市虎门镇南栅社区元头村小组办公楼内', '113.69952', '22.952881', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('36', '福海路05公厕', '东莞市石排镇中坑农贸市场', '113.756271', '23.042866', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('840', '\"大宁', '企石镇振华工业区', '113.5226', '22.5215', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('333', '江门公厕\"', '东莞市虎门镇北栅社区车站路胜腾龙汽车容中心对面附近', '114.01478', '22.96912', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('441', '沙田稔洲广场公共厕所', '东莞市横沥镇长巷村活动中心', '114.08327', '23.08499', '6', '企石镇', '8', '1');
INSERT INTO `igj` VALUES ('1419', '大朗55', '财岭头', '113.43576', '22.491568', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1440', '厚街镇新塘05公厕', '东莞市厚街镇福神岗公园内', '113.71107', '22.84112', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('608', '新兴街公厕', '东莞市东城区桑园狮长路22号', '114.21371', '22.99036', '6', '谢岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1148', '潢涌体育馆公厕', '元岗路边', '113.6628', '22.89325', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1017', '佛灵湖2号停车场公厕', '东莞市常平镇农业科普园内', '113.75265', '23.05308', '6', '莞城街道', '8', '1');
INSERT INTO `igj` VALUES ('1263', '川槎大街公厕', '企石镇湖美村广场', '113.60541', '22.88377', '6', '沙田镇', '8', '1');
INSERT INTO `igj` VALUES ('1022', '常平镇陈屋贝饭堂公厕', '东莞市虎门镇村头社区果利来市场内', '113.75343', '23.05088', '6', '莞城街道', '8', '1');
INSERT INTO `igj` VALUES ('274', '常平镇河西公园02公厕', '东莞市虎门镇龙眼社区龙眼路37号', '113.90164', '23.03741', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('1171', '塘厦林村新阳路公厕', '东莞市谢岗镇黎村二片球', '113.68884', '22.94714', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('118', '\"路东', '东莞市厚街镇沙塘下低园公园旁', '113.823906', '23.076934', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1247', '步行街公厕\"', '东莞市莞城区和平路42号侧', '113.9248', '23.1059', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('310', '谢岗村公厕', '穗丰年湿地公园西面福禄沙旁（113.60541；22.88377）', '113.97965', '22.97945', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('504', '沙田环湖公园公共厕所', '东莞市莞城区阮涌尾路16号', '114.122079', '23.033438', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('1525', '新民1号公厕', '粟边圆何街旁；', '113.68169', '22.79153', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('227', '三联村', '东莞市厚街镇寮厦社区寮厦市场', '114.08392', '22.81017', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('729', '冼沙二上坊', '东莞市东纵路208万达广场万达广场', '113.75976', '22.79192', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('530', '屋厦广场公厕', '东莞市石排镇石排海仔湖北停车场', '113.86825', '23.11403', '6', '石龙镇', '8', '1');
INSERT INTO `igj` VALUES ('828', '中麻路公厕', '东莞市常平镇桥梓桥城工业区', '113.5812', '22.5551', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('541', '厚街镇沙溪湖公园2号公厕     ', '桥东路北二街南园幼儿园附近', '113.66681', '23.05099', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('1512', '大朗83', '东莞市虎门镇新湾社区海景路文德街2号对面', '113.67385', '22.8103', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1067', '凤岗镇09号公厕', '东莞市塘厦镇四村龙环路33号一楼', '113.68936', '22.94195', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('524', '螺村市场公厕', '长安镇上沙社区新城路10号', '113.85814', '23.11802', '6', '石龙镇', '8', '1');
INSERT INTO `igj` VALUES ('1309', '迎宾绿道公厕', '东莞市石龙镇旧城东桥C辅道旁', '113.6082', '23.08715', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('156', '厚街镇溪头油蛇公园公厕', '沙步公园旁（仙龙街）', '113.788918', '23.020941', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('484', '常平镇隐贤山庄景区东门广场公厕', '望牛墩镇水乡公园', '114.11717', '23.02235', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('825', '万达广场公厕', '东莞市虎门镇九门寨社区九咀小组球场旁', '113.5713', '22.5338', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('1265', '黎村头圩公厕', '东莞市厚街镇龙阁山体育休闲公园（富康路旁）', '113.60638', '22.87355', '6', '沙田镇', '8', '1');
INSERT INTO `igj` VALUES ('1025', '京山新市场公厕', '东莞市石龙镇中山西社区线香街', '113.75705', '23.05228', '6', '莞城街道', '8', '1');
INSERT INTO `igj` VALUES ('293', '孙屋广场公厕', '东莞市麻涌镇黎滘村一街河边', '113.880799', '23.089398', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('1295', '梅沙村上坊电房旁公厕', '东莞市东昇路星河城', '113.59745', '23.0686', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('895', '厚街镇环冈02公厕', '湴湖村公园', '13.83934', '22.90227', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('1215', '望牛墩聚龙江村横江南路公共厕所', '新马莲广场旁', '113.61943', '22.98395', '6', '洪梅镇', '8', '1');
INSERT INTO `igj` VALUES ('537', '上角06号公厕', '沙田镇进港中路二号桥北面（西边）（113.60638；22.87355）', '113.66719', '23.04904', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('1091', '古梅乡韵公厕', '东莞市莞城区光明路3巷', '113.68771', '22.96715', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1418', '塘尾公园二期1402', '冲美村三源路1号；', '133.431292', '22.491948', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('607', '望牛墩河西路公共厕所', '东莞市麻涌镇新基村文化广场内', '114.21226', '22.98827', '6', '谢岗镇', '8', '1');
INSERT INTO `igj` VALUES ('784', '乌沙6号公厕', '大岭山镇矮岭冚塘边路', '113.867727', '22.999645', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('724', '彭屋公厕', '疏港大道骏恩厂对面', '113.78261', '22.79761', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('794', '\"赤岗', '望牛墩镇滨江公园南区', '113.5548', '22.5541', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('397', '榨房公厕\"', '东莞市厚街镇三屯伦品涌大道西1号旁', '113.928', '22.98991', '6', '东坑镇', '8', '1');
INSERT INTO `igj` VALUES ('480', '常平镇隐贤山庄景区停车场公厕', '东莞市虎门镇村头社区供电所后面', '114.092301', '23.020846', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('741', '伟建工业园内（观光阁）', '东莞市谢岗镇黎村村委会右侧100米', '113.73923', '22.79998', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('1096', '望牛墩扶涌村公共厕所', '东莞市寮步镇香市公园山上', '113.70469', '22.97291', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1422', '01东坊大塘公厕', '长安镇沙头东引河北路25号', '113.725836', '22.852015', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1393', '虎英环湖路竞芳园公厕', '友善公园', '113.64695', '23.10384', '6', '中堂镇', '8', '1');
INSERT INTO `igj` VALUES ('817', '厚街镇河田04公厕', '初坑村龙坑', '113.9441', '22.9516', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('1437', '樟木头官仓公厕', '长安镇厦边社区旧村银城公园', '113.72041', '22.83567', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('696', '厚街镇宝屯03公厕', '东莞市厚街镇赤岭社区东明路农业银行附近', '113.78914', '22.81103', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('162', '常平镇九江水公园公厕', '东莞市虎门镇黄村社区工业路15号', '113.788918', '23.020941', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('369', '厚街镇宝屯01公厕', '东莞市中堂镇斗朗社区烈士碑公园内', '114.03158', '22.98242', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('545', '汽车东站（站外）公厕', '水秀北路122号塘边', '113.3954', '113.345', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('1221', '东太太和公厕', '牛山社区牛山文化中心内一楼', '113.98559', '23.07905', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('531', '\"沙角', '东莞市虎门镇北栅社区省道综合市场二楼', '113.8538', '23.11224', '6', '石龙镇', '8', '1');
INSERT INTO `igj` VALUES ('560', '广场公厕\"', '长安镇新安社区尚横路6号旁', '113.64503', '23.05118', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('1075', '塘厦镇石潭埔崖山公园广场公共厕所', '东莞市东昇路星河城', '113.662665', '22.936765', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1461', '南社古民居内古戏台旁公厕', '东莞市常平镇隐贤山庄景区内', '113.696706', '22.862774', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('651', '大朗46', '望牛墩镇李屋村李屋公园', '113.481608', '22.50176', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('872', '望牛墩文化广场公共厕所', '东莞市石排镇石排大道福隆杨屋路段', '113.922242', '22.942982', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('766', '南栅元头村公厕', '东莞市石龙镇兴龙社区崇文街第三中学对面', '113.839051', '22.969118', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('331', '中坑农贸市场公共厕所1701', '望牛墩镇洲湾新村球场旁', '114.00074', '22.95531', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('337', '清泉路公厕', '东莞市厚街镇新庄新村七巷26号（新庄公园内）', '114.01726', '22.97555', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('852', '\"北栅西坊', '东莞市虎门镇新联分公园内(即新联新禧路中转站旁)', '113.902517', '22.938707', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('100', '商业区公厕\"', '长安镇郊野公园', '113.774541', '23.032937', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('181', '横沥镇长巷公共厕所', '佛新市场', '114.635', '22.4645', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('392', '凤岗镇61号公厕', '东莞市寮步镇佛灵湖驿站', '113.94574', '22.98669', '6', '东坑镇', '8', '1');
INSERT INTO `igj` VALUES ('373', '厚街镇福神岗公园02公厕       ', '东莞市常平镇教育路太和山广场山顶', '114.03077', '22.97931', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1396', '桑园公交首末站公厕', '东莞市常平镇常平镇翠珠路', '113.66203', '23.08834', '6', '中堂镇', '8', '1');
INSERT INTO `igj` VALUES ('1537', '大朗57', '佛子凹市场', '113.67979', '22.81771', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('202003270004', '常平镇农业科普园公厕', '世纪广场一楼', '114.11812', '22.88467', '6', '清溪镇', '8', '1');
INSERT INTO `igj` VALUES ('733', '湖美村公园公厕', '塘厦镇凤凰岗广场', '113.7438', '22.7989', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('1288', '村头果利来市场公厕', '骏达工业园', '113.58634', '23.05091', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('316', '\"龙眼', '东莞市常平镇隐贤山庄景区内', '113.9506', '22.96931', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('350', '五路公厕\"', '东莞市中堂镇红锋社区小公园旁', '114.06493', '22.95827', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1098', '黎村二片球场公厕', '东莞市虎门镇虎门广场维稳中心后', '113.696591', '22.96883', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('401', '厚街镇下低园公厕      ', '东莞市清溪镇诚信百货附近', '113.97057', '23.01764', '6', '横沥镇', '8', '1');
INSERT INTO `igj` VALUES ('1474', '莞城区纸扎街公厕05号', '长安镇厦岗社区先兴南街17号对面', '113.68198', '22.81929', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('47', '沙田穗丰年水道公共厕所01', '东莞市麻涌镇东太村东浦公园内', '113.806084', '22.990927', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('672', '莞城区阮涌公厕10号', '常平镇苏坑苏东路', '113.82958', '22.80589', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('1097', '粟边圆何街旁公厕', '东莞市常平镇九江水水畔公园内', '113.70103', '22.97372', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1455', '厚街镇寮厦市场公厕    ', '东莞市厚街镇陈屋广场', '113.677882', '22.833223', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('967', '万达广场公厕', '东莞市横沥镇沿江南路', '114.170735', '22.722663', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1089', '海仔湖北公厕2003', '东莞市虎门镇金洲西坊永康街南一巷', '113.681081', '22.96899', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('207', '常平镇桥梓工业区公厕', '同沙社区元河一街附近', '114.102171', '22.808219', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('669', '屋厦中心塘公厕', '长安汽车客运总站', '113.473808', '22.493441', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('393', '\"新湾', '东莞市厚街镇赤岭社区农贸市场后面', '113.95148', '23.00416', '6', '东坑镇', '8', '1');
INSERT INTO `igj` VALUES ('1143', '东兴公厕\"', '东莞市虎门镇博涌社区细卢村前路', '113.67316', '22.89859', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1113', '四村龙环路公厕', '校塘路路口', '113.67542', '22.90238', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1255', '上沙05公厕', '东莞市厚街镇三屯上屯联达厂后门', '113.62688', '22.91856', '6', '沙田镇', '8', '1');
INSERT INTO `igj` VALUES ('1209', '石龙镇东桥下旧城公共厕所', '东莞市塘厦镇石潭埔社区江源路10号，崖山公园内', '113.62375', '23.01589', '6', '洪梅镇', '8', '1');
INSERT INTO `igj` VALUES ('490', '大朗45', '长安镇体育公园', '114.08986', '23.00955', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('202003270003', '望牛墩水乡公园公共厕所', '新门楼连塘巷', '114.15119', '22.85516', '6', '清溪镇', '8', '1');
INSERT INTO `igj` VALUES ('589', '\"九门寨', '东莞市厚街镇溪头社区溪中路迈司垃圾中转站二楼', '114.16906', '22.96565', '6', '谢岗镇', '8', '1');
INSERT INTO `igj` VALUES ('548', '球场公厕\"', '东莞市厚街镇南五山丽街棋龙厂旁', '113.3955', '23.259', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('842', '厚街镇龙阁山运动公园01公厕    ', '沙田龙舟公园（113.62688；22.91856）', '113.959777', '22.929352', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('916', '石龙镇线香街公共厕所', '洪梅镇梅沙村东三区一巷20号', '113.82135', '22.88662', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('202003270014', '黎滘一街公厕', '丰兴路11号旁', '114.16413', '22.8615', '6', '清溪镇', '8', '1');
INSERT INTO `igj` VALUES ('1413', '星河城广场公厕', '东莞市清溪镇香芒西路722西南70米', '113.76407', '22.8361', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1333', '\"湴湖公园', '谢岗镇谢山新村', '113.71562', '23.03103', '6', '万江街道', '8', '1');
INSERT INTO `igj` VALUES ('711', '公厕\"', '望牛墩镇扶涌村19号之三', '113.79072', '22.7579', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('127', '大朗42', '湿地公园正门', '113.751796', '23.020704', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1047', '沙田穗丰年水道公共厕所03', '文化活动中心', '113.67265', '22.94745', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('683', '莞城区世科里公厕13号', '东莞市清溪镇松岗公园附近', '113.81738', '22.80071', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('1547', '冲美横展厂房旁', '东莞市虎门镇怀德新村东坊二巷1号之一', '113.67761', '22.82877', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('203', '新基广场公厕', '万江街道滨江西路共联绿道旁', '114.110423', '22.788016', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('412', '矮岭冚村委会对面公厕', '长安镇新民社区新民路和顺和路交界处', '113.97533', '23.00749', '6', '横沥镇', '8', '1');
INSERT INTO `igj` VALUES ('342', '龙泉中转站公厕', '东莞市鸿福东路1号民盈国贸中心', '114.03468', '22.97239', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1445', '望牛墩滨江公园南区公共厕所', '东莞市厚街镇松山公园对面', '113.70337', '22.84323', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('444', '厚街镇伦品涌小组公园公厕      ', '长安镇霄边社区鸿明街3号', '114.08', '23.35', '6', '企石镇', '8', '1');
INSERT INTO `igj` VALUES ('446', '\"村头', '东莞市虎门镇虎门寨东下5巷14号对面', '114.2586', '23.022412', '6', '企石镇', '8', '1');
INSERT INTO `igj` VALUES ('654', '贝丘公厕\"', '东莞市塘厦镇清湖头社区环市南路', '113.481093', '22.481938', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('1356', '黎村南门公厕', '东莞市横沥镇彩霞路', '113.70718', '23.07014', '6', '万江街道', '8', '1');
INSERT INTO `igj` VALUES ('15', '香市公园山上公厕', '东莞市常平镇霞坑村元霞路', '113.76527', '23.061', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1005', '东大路公厕', '东莞市虎门镇龙眼社区工业区公园内（工业路）', '113.742893', '23.12098', '6', '高埗镇', '8', '1');
INSERT INTO `igj` VALUES ('215', '暂无', '企石镇霞朗村娱乐中心', '114.051357', '22.796559', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('1331', '初坑龙坑公厕', '企石镇东山村飞鹅南路', '113.73658', '23.03917', '6', '万江街道', '8', '1');
INSERT INTO `igj` VALUES ('820', '田新社区垃圾处理站', '长安镇如园公园', '113.5725', '22.562', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('1189', '银城公园04公厕', '东莞万江街道蚬涌小公园旁', '113.74745', '22.90167', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('890', '厚街镇赤岭01公厕', '樟村罗塘路7号（樟村市场）', '113.85634', '22.93629', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('807', '黄村长寿公园公厕', '村委会大楼北面江滨公园内', '113.5614', '22.572', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('597', '斗朗滨江路公厕', '东莞市塘厦镇田心社区田心路47号', '114.09622', '22.97893', '6', '谢岗镇', '8', '1');
INSERT INTO `igj` VALUES ('430', '大朗34', '万江街道金曲路垃圾中转站二楼', '114.017679', '23.063215', '6', '企石镇', '8', '1');
INSERT INTO `igj` VALUES ('345', '牛山文化中心公厕', '沥圳转运站二楼', '114.02326', '22.97767', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('22', '北栅综合市场公厕', '东莞市厚街镇新围社区河东路', '113.751784', '23.020674', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('268', '新安2号公厕', '新塘村小公园内', '113.853192', '23.049455', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('663', '星河城广场公厕', '新文路球场边', '113.48404', '22.491066', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('664', '常平镇隐贤山庄景区出口处公厕', '谢岗镇曹乐其乐新村公园内', '113.48504', '22.491066', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('202', '望牛墩李屋村公共厕所', '企石镇铁炉坑村彭城路', '114.111707', '22.769008', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('868', '福隆杨屋公厕0402', '东莞市常平镇公园路铁路公园内', '113.967048', '22.937458', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('61', '石龙镇三中公园公共厕所', '梨川家和市场内', '113.787689', '23.010014', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1313', '望牛墩洲湾村公共厕所', '增埗卢屋荷花池；', '113.61604', '23.09235', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('926', '厚街镇珊美01公厕', '长安镇长安公园', '113.84425', '22.85982', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('1328', '\"新联', '长安镇长安公园', '113.57287', '23.04159', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('833', '球场公厕\"', '东莞市塘厦镇桥陇社区中心广场公厕', '113.9873', '22.9271', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('1138', '郊野公园19号公厕', '水口市场', '113.66499', '22.89756', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1186', '大朗89', '东莞虎英公园', '113.751301', '22.91462', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('141', '佛灵湖驿站公厕', '东莞市麻涌镇鸥涌村鸥涌市场内', '113.751796', '23.020704', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('962', '常平镇还珠沥太和山02公厕', '颜屋村球场边', '114.121683', '22.764036', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1117', '常平镇板石翠珠路公厕', '东莞市麻涌镇麻二社区村委会', '113.66326', '22.9164', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('990', '大朗71', '石厦市场', '114.174428', '22.702708', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('898', '世纪广场一楼公厕', '东莞市厚街镇溪头社区溪头大道东溪公园侧', '113.841148', '22.90229', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('1048', '塘厦镇凤凰岗广场', '东莞市厚街镇大迳江头村十巷9号', '113.66279', '22.94837', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('556', '骏达社区公厕', '东莞市鸿福东路1号民盈国贸中心', '113.3922', '23.352', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('1506', '常平镇隐贤山庄海盗船01公厕', '竹尾田美田路', '113.70349', '22.7595', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('768', '红锋公厕', '东莞市厚街镇新塘社区丽新路上塘公园旁', '113.5052', '22.5959', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('264', '\"则徐', '南山市场', '113.894033', '23.045518', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('154', '维稳公厕\"', '东莞市大岭山镇矮岭冚市场内', '113.788918', '23.020941', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1237', '罗马公厕', '东莞市厚街镇虹桥市场旁', '113.93549', '23.08637', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('540', '先兴南街03公厕', '聚龙江村综合市场旁', '113.66492', '23.05245', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('1401', '东浦公园公厕', '东莞市虎门镇沙角社区凤凰二路31号之一', '113.44559', '22.48599', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1293', '常平镇苏坑南向工业区公厕', '东莞市寮步镇动物园公厕2号（内1）', '113.59246', '23.05155', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('1538', '常平镇九江水水畔公园公厕', '上元上周塘村民小组；', '113.67648', '22.82307', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('758', '厚街镇陈屋01公厕', '东莞市东昇路星河城', '113.892415', '22.999455', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('580', '横沥镇体育公园公共厕所', '东莞市石排镇太和中路上市墓园侧', '113.61478', '23.03335', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('58', '\"金洲', '望牛墩镇水乡公园', '113.769485', '23.002232', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('952', '永康街公厕\"', '东莞市虎门镇树田洪圣8巷', '114.158243', '22.738152', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('723', '同沙社区元河一街公厕', '东莞市麻涌镇大步村赵坊振兴路口', '113.78116', '22.8013', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('892', '长安汽车客运总站2楼男厕', '东莞市虎门镇则徐社区光辉街37号', '113.84794', '22.89557', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('1397', '厚街镇赤岭02公厕', '东莞市寮步镇寮步社区镇环城路', '113.66603', '23.09859', '6', '中堂镇', '8', '1');
INSERT INTO `igj` VALUES ('302', '\"博涌', '望牛墩镇朱平沙村文化活动中心旁', '113.99417', '22.97383', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('417', '细卢公厕\"', '东城立新洋田沥村洋田沥路', '114.02664', '23.02433', '6', '横沥镇', '8', '1');
INSERT INTO `igj` VALUES ('585', '凤岗镇42号公厕', '塘沥村小组对面', '114.22513', '22.97106', '6', '谢岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1320', '厚街镇上屯联达厂后门公厕      ', '长安镇沙头瑾前街三巷2号', '113.55221', '23.05207', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('995', '塘厦镇石潭埔崖山公园公共厕所', '东莞市大岭山振华路416号', '113.740106', '23.113775', '6', '高埗镇', '8', '1');
INSERT INTO `igj` VALUES ('1161', '体育公园休闲中心二层公厕', '东莞市中堂镇中堂镇文化广场', '113.659631', '22.87647', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('483', '草塘社区公厕', '东莞市常平镇沿河东二路', '114.1002', '23.02591', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('290', '厚街镇溪头迈司公厕   ', '东莞市横沥镇六甲综合市场', '113.866943', '23.050286', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('147', '厚街镇南五03公厕', '谢岗镇窑山村农贸市场旁', '113.751796', '23.020704', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1191', '沙田龙舟公园公共厕所', '东莞市麻涌镇大盛村大盛市场内', '113.61944', '22.9993', '6', '洪梅镇', '8', '1');
INSERT INTO `igj` VALUES ('902', '梅沙村东三区公厕', '村委会前饭堂南边', '113.84632', '22.93365', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('1102', '丰兴路公厕', '东莞市厚街镇白濠环村西路沙地路口', '113.67799', '22.9204', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1273', '浮岗公厕', '杨公朗新村一路9号', '113.61921', '22.8573', '6', '沙田镇', '8', '1');
INSERT INTO `igj` VALUES ('506', '谢山村公厕', '卢边市场，', '114.126326', '23.032886', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('282', '望牛墩扶涌村黄屋公共厕所', '东莞市鸿福东路1号民盈国贸中心', '113.87663', '23.043886', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('972', '大朗61', '黎洲角村塘尾十六巷17号旁', '114.185627', '22.72632', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1176', '大岭村', '大沙村旧围公园', '113.71067', '22.93776', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('411', '松岗公厕', '东莞市厚街镇桥头小学路', '113.9509', '23.0335', '6', '横沥镇', '8', '1');
INSERT INTO `igj` VALUES ('24', '\"怀德', '沙田镇进港南路沿江高速旁（113.61921；22.8573）', '113.756447', '23.056067', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('48', '新村公厕\"', '桥东路北三街屋厦市场内', '113.807785', '22.986673', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('117', '共联绿道公厕', '寒溪水村健祥街一巷1号；', '113.823906', '23.076934', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('202003270021', '新民2号公厕', '中兴路', '114.936', '22.519', '6', '清溪镇', '8', '1');
INSERT INTO `igj` VALUES ('679', '国贸城公厕', '东莞市厚街镇汀山广场', '113.82621', '22.80398', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('211', '厚街镇松山公园公厕', '东莞市横沥镇张坑村公园', '114.091581', '22.766391', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('1090', '霄边市场公厕04号', '梨川大泉新邨路', '113.68447', '22.96527', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('647', '\"虎门寨', '同沙公交首末站', '113.80083', '22.80373', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('178', '红洋楼公厕\"', '东莞市东纵路208万达广场万达广场', '114.114355', '22.834393', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('160', '塘厦镇环市南路公厕', '东莞市清溪镇易富东街52号', '113.788918', '23.020941', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('183', '横沥镇田头彩霞公园公共厕所', '长安镇涌头社区宏丰路星堂公园内', '114.08547', '22.78599', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('358', '常平镇霞坑元霞路公厕', '东莞市塘厦镇石鼓田厦路132号', '114.06459', '22.97894', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('520', '\"龙眼', '东莞市厚街镇三屯中心大道', '113.86404', '23.11842', '6', '石龙镇', '8', '1');
INSERT INTO `igj` VALUES ('799', '七路公厕\"', 'S358省道长安段广深高速桥底（汽车北站对面）', '113.5752', '22.5543', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('151', '霞朗村娱乐中心公厕', '东莞市塘厦镇莲湖石水路', '113.751796', '23.020704', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('692', '东山村四面岗公厕', '东莞市东昇路星河城', '113.79951', '22.77614', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('88', '如园公园公厕1', '\"东莞市塘厦镇', '113.817469', '23.081885', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1499', '蚬涌社区蚬一蚬二公厕', '蛟乙塘荔枝公园\"', '113.70884', '22.7674', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('92', '樟村大园公厕', '东莞市常平镇司马村委会对面', '113.817469', '23.081885', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('812', '护安围村', '东莞市石龙镇中山东社区水巷7号之一', '113.5346', '22.5617', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('79', '塘厦镇田心河边公厕', '高英农贸市场后面', '113.802315', '22.965139', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('437', '曲海中转站公厕', '东莞市鸿福东路1号民盈国贸中心', '114.06898', '23.09232', '6', '企石镇', '8', '1');
INSERT INTO `igj` VALUES ('765', '大朗37', '长安镇锦厦社区锦平路2号旁边', '113.844322', '22.967354', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('1130', '厚街镇新围02公厕', '东莞榴花公园', '113.64498', '22.93785', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('891', '新塘村公厕', '东莞市虎门镇路东教育路广场公厕', '113.86006', '22.9068', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('324', '大朗20', '东莞榴花公园', '113.97898', '22.95503', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('587', '曹乐村公厕', '佛子凹文化广场', '114.19185', '22.96132', '6', '谢岗镇', '8', '1');
INSERT INTO `igj` VALUES ('326', '彭城路公厕', '东莞市同沙生态公园', '113.98548', '22.97054', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('231', '常平镇铁路公园01公厕', '企石镇博夏村中转站', '114.103807', '22.745346', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('43', '梨川市场公厕', '东莞市寮步镇佛灵湖正门', '113.790169', '23.070311', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('119', '增埗卢屋荷花池公厕', '东莞市厚街镇涌口社区石角公园侧', '113.823906', '23.076934', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('600', '长安公园12号公厕', '元岭村综合市场后面', '114.62', '22.5852', '6', '谢岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1527', '长安公园13号公厕', '东莞市常平镇袁山贝东阳公园', '113.68048', '22.80527', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('150', '塘厦镇桥陇中心广场公厕', '谢岗镇大龙新村公园旁', '113.751796', '23.020704', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('431', '大朗86', '东莞市常平镇金美公园', '114.014842', '23.06876', '6', '企石镇', '8', '1');
INSERT INTO `igj` VALUES ('544', '虎英公园翠峰路公厕', '东莞市塘厦镇石马建设路26号', '113.3849', '23.32', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('1132', '鸥涌市场公厕', '东城区上桥桥石路上桥驾校旁', '113.648761', '22.920681', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('470', '颜屋村', '东莞市东纵路208万达广场万达广场', '114.08304', '23.00311', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('685', '麻二社区公厕', '谢岗镇银山湿地公园C区', '113.80914', '22.8035', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('271', '大朗50', '东莞市虎门镇新湾社区新兴路二巷15号', '113.908241', '23.035752', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('409', '厚街镇溪头东溪公园侧公厕         ', '东莞市鸿福东路1号民盈国贸中心', '113.9512', '23.03467', '6', '横沥镇', '8', '1');
INSERT INTO `igj` VALUES ('76', '厚街镇大迳江头村公厕  ', '企石镇铁炉坑村春城路', '113.802315', '22.965139', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('105', '国贸城公厕', '望牛墩河东四坊三巷', '113.774541', '23.032937', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1037', '凤岗镇37号公厕', '东莞市厚街镇涌口社区海月公园湖边', '113.77282', '23.03052', '6', '莞城街道', '8', '1');
INSERT INTO `igj` VALUES ('451', '厚街镇新塘02公厕', '莲塘路2号饭堂侧', '114.23', '23.329', '6', '企石镇', '8', '1');
INSERT INTO `igj` VALUES ('1444', '凤岗镇65号公厕', '长安镇咸西社区常荣南街咸西市场', '113.71005', '22.83987', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1248', '矮岭冚53号公厕', '粟边文化公园；', '113.92253', '23.10193', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('202003270017', '厚街镇虹桥市场公厕', '东莞市横沥镇山厦公园公厕', '114.14907', '22.80589', '6', '清溪镇', '8', '1');
INSERT INTO `igj` VALUES ('667', '望牛墩聚龙江村综合市场公共厕所', '东莞市同沙生态公园', '113.473676', '22.492275', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('1246', '沙角凤凰山公厕', '华润万家三楼', '113.94957', '23.09452', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('1299', '动物园公厕2号（内1）', '东莞市莞城区丽峰路', '113.57681', '22.9916', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('835', '上元上周塘村民小组公厕', '企石镇上截村广场旁', '113.555', '22.5518', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('440', '星河城广场公厕', '东莞市虎门镇龙眼社区广场内', '114.06317', '23.03777', '6', '企石镇', '8', '1');
INSERT INTO `igj` VALUES ('1056', '埔心村石岗路公厕1305', '东莞市石排镇石排海仔湖', '113.70048', '22.9186', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1156', '望牛墩水乡公园公共厕所', '谢坑村谢坑活动中心附近', '113.6687', '22.8854', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('521', '\"树田', '长安镇体育公园', '113.864472', '23.120292', '6', '石龙镇', '8', '1');
INSERT INTO `igj` VALUES ('1370', '南方公厕\"', '东莞市石排镇石排公园停车场', '114.086311', '22.879467', '6', '樟木头镇', '8', '1');
INSERT INTO `igj` VALUES ('1136', '大步赵坊公厕', '东莞市麻涌镇漳澎村水闸旁', '113.66042', '22.896801', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1435', '\"则徐', '奔康路旁', '113.71633', '22.83368', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1385', '光辉街公厕\"', '企石镇东平村大帽岭篮球场', '113.70527', '23.10318', '6', '中堂镇', '8', '1');
INSERT INTO `igj` VALUES ('123', '向北坊公厕', '东莞市厚街镇神仙水庙宇公厕', '113.823906', '23.076934', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1483', '望牛墩朱平沙村公共厕所', '东莞市厚街镇下汴社区新村一区一巷50号旁', '113.70168', '22.79352', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1064', '洋田沥公厕', '东莞市石龙镇中山东社区沿江东路一巷', '113.69482', '22.94712', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1154', '凤岗镇26号公厕', '东莞市樟木头镇樟洋一区', '113.67066', '22.88457', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('143', '墐头旧村公厕', '东莞市厚街镇溪头社区水埗头一巷桥边', '113.751796', '23.020704', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1486', '大岭山振华路公共公厕', '东莞市虎门镇北栅社区西安路农批市场内', '113.69893', '22.79658', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('661', '文化广场公厕', '东莞市中堂镇凤冲村村前鱼塘边', '113.475314', '22.491072', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('698', '常平镇河滨公园01公厕', '东莞市东纵路208万达广场万达广场', '113.78665', '22.81059', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('1519', '横沥镇六甲市场公共厕所', '东莞市虎门镇南栅社区富民路象山公园(幼儿园旁)', '113.66348', '22.8146', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('611', '窑山村公厕', '东莞市厚街镇飞翔路竹园路文化公园内', '114.131', '22.585', '6', '谢岗镇', '8', '1');
INSERT INTO `igj` VALUES ('576', '大盛市场公厕', '东莞市厚街镇下汴社区汴康路21号', '113.3649', '23.226', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('301', '横滘头村', '东莞市鸿福东路1号民盈国贸中心', '114.00226', '22.98151', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1044', '厚街镇白濠05公厕', '\"东莞市虎门镇南栅社区富民路象山公园', '113.74668', '23.04745', '6', '莞城街道', '8', '1');
INSERT INTO `igj` VALUES ('190', '\"杨公朗公园', '(游泳馆旁)\"', '114.08613', '22.846707', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('1144', '公厕\"', '长安镇长安公园', '113.66914', '22.89863', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1441', '卢边市场公厕', '长安镇新安社区新农村新园路东三巷3号对面新农村蓝球场', '113.70404', '22.83857', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('920', '国贸城公厕', '东莞市虎门镇南面虎门大道西余庆小筑公厕', '113.82395', '22.88785', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('1164', '洪梅建设路公共厕所', '东莞市谢岗镇窑山公园内', '113.68277', '22.93464', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('336', '17号大沙村公园公厕', '福安村福北街9号（福安酒棚旁）', '114.02144', '22.95652', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1425', '厚街镇桥头社区01公厕', '东莞市常平镇新市二街', '113.71266', '22.809925', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('426', '沙田穗丰年村公共厕所', '东莞市莞城区东江大道往厚街水道桥旁', '113.97622', '23.04228', '6', '横沥镇', '8', '1');
INSERT INTO `igj` VALUES ('1235', '屋厦市场公厕', '东莞市塘厦林村里牙塘博建街', '113.93881', '23.08867', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('391', '寒溪水公园公厕', '东莞市厚街镇溪头社区一环路玛氏垃圾中转站二楼', '113.93752', '23.00486', '6', '东坑镇', '8', '1');
INSERT INTO `igj` VALUES ('1070', '凤岗镇47号公厕', '东莞市虎门镇龙眼社区四路92号', '113.66122', '22.94082', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1533', '厚街镇汀山广场公厕   ', '大岭村纵队路村委会旁', '113.6725', '22.82941', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1124', '横沥镇张坑公园公共厕所', '东莞市厚街镇河田南边公园旁', '113.64756', '22.92419', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('332', '榄树下、居委会公厕', '东莞市常平镇新城大道常新公园内', '114.00346', '22.97087', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1517', '同沙公交首末站公厕', '东莞市虎门镇大宁社区建设路百福公园内', '113.64093', '22.80051', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('202003270023', '万达广场公厕', '横沥镇新四小田头村公园', '114.943', '22.5053', '6', '清溪镇', '8', '1');
INSERT INTO `igj` VALUES ('1259', '易富市场公厕', '东莞市石排镇埔心三路会豪私房菜侧', '113.59896', '22.88983', '6', '沙田镇', '8', '1');
INSERT INTO `igj` VALUES ('1158', '星堂公园公厕', '鹰岭公园', '113.66173', '22.88145', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('798', '塘厦镇石鼓田厦路公厕', '东莞市厚街镇厚街社区菊塘路麒麟尾', '113.5539', '22.5827', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('163', '厚街镇三屯中心大道迷城公厕    ', '东莞市虎门镇东方西下二巷19号对面', '113.788918', '23.020941', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('217', '桥底公园公厕', '东莞市厚街镇涌口社区南社组委会侧', '114.1059', '22.8015', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('1279', '塘厦莲湖石头岭公厕', '东莞市常平镇朗贝公园内', '113.5865', '23.05815', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('1264', '星河城广场公厕', '东莞市虎门镇南面海战路公交站旁', '113.60553', '22.8765', '6', '沙田镇', '8', '1');
INSERT INTO `igj` VALUES ('1520', '蛟乙塘53号荔枝公园厕所', '东莞市清溪镇香芒西路公园旁', '113.65307', '22.82092', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('771', '常平镇司马旧东深河公厕', '沙田镇石塘路（福禄沙综合市场旁）（113.59896；22.88983）', '113.5043', '22.5948', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('1217', '石龙镇水巷公共厕所', '东莞市厚街镇白濠康乐南路1号', '113.96949', '23.06025', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('1353', '大朗11', '高英路381号', '113.7032', '23.03446', '6', '万江街道', '8', '1');
INSERT INTO `igj` VALUES ('905', '国贸城公厕', '东莞市东昇路星河城', '113.81034', '22.91647', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('753', '河南聚美07号公厕', '东莞市塘厦镇振兴围广场', '113.893865', '22.997595', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('507', '荔枝园公厕', '东莞市麻涌镇文化广场内', '114.122509', '23.032259', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('89', '\"路东', '穗丰年路穗丰年湿地公园驿站(113.60553；22.8765)', '113.817469', '23.081885', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('218', '广场公厕\"', '东莞市虎门镇北面邓屋新路', '114.10529', '22.80262', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('1019', '钓鱼场公厕', '东莞市寮步镇动物园公厕5号（内4）', '113.75517', '23.05483', '6', '莞城街道', '8', '1');
INSERT INTO `igj` VALUES ('35', '大朗27', '东莞市石排镇下沙东风一路路段', '113.759042', '23.050514', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1404', '同沙生态公园打石场环保公厕', '万江街道新谷涌社区祥和路下村篮球场旁', '113.75653', '22.84071', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('677', '博夏村公厕', '大岭山镇百花洞村广场旁', '113.83205', '22.8048', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('463', '佛灵湖正门公厕', '东莞市寮步镇寮步社区环城路', '114.0986', '23.01473', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('707', '厚街镇涌口08公厕', '桥东路北二街旧村委会附近', '113.79012', '22.78892', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('11', '元岭村市场公厕', '东莞榴花公园', '113.764922', '23.042427', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('697', '常平镇袁山贝东阳公园公厕', '东莞市塘厦镇振兴围安南路', '113.78513', '22.80977', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('856', '大龙村公厕', '东莞市莞城区床街49号侧', '113.953569', '22.94039', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('1043', '常平镇金美公园公厕', '东莞市东城区桑园果园路1号', '113.7512', '23.05853', '6', '莞城街道', '8', '1');
INSERT INTO `igj` VALUES ('938', '石马建设路90号公厕', '东莞市虎门镇怀德大坑路北浩海旺汽车维修店东南(大新路2号）', '114.172434', '22.772003', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('71', '上桥公交首末站公厕', '长安镇涌头社区沿山路公墓内', '113.802315', '22.965139', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('966', '万达广场公厕', '宏达中路', '114.16708', '22.723934', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('462', '银山湿地公园C区公厕', '长安镇乌沙社区新乐路25号乌沙第二市场内', '114.10955', '23.02329', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('904', '\"新湾', '东城岗贝市场旁', '113.82039', '22.93218', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('1522', '新兴公厕\"', '长安镇新安社区新园路4巷2号对面新农村公园内', '113.65516', '22.81794', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('188', '国贸城公厕', '南坊区', '114.074927', '22.843801', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('1335', '春城路公厕', '东莞市莞城区东江大道细村口红绿灯旁', '113.73546', '23.03698', '6', '万江街道', '8', '1');
INSERT INTO `igj` VALUES ('705', '望牛墩河东路公共厕所', '南门山公园驿站公厕', '113.78934', '22.79933', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('202003270009', '厚街镇涌口10公厕', '东莞市同沙生态公园', '114.19078', '22.82574', '6', '清溪镇', '8', '1');
INSERT INTO `igj` VALUES ('176', '莲塘路2号B15-3', '同兴路公园', '114.101119', '22.827072', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('596', '咸西市场02号公厕', '莲湖小广场', '114.1143', '22.97368', '6', '谢岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1021', '粟边文化公园公厕', '大岭山镇连平圩村', '113.75506', '23.05373', '6', '莞城街道', '8', '1');
INSERT INTO `igj` VALUES ('1068', '横沥镇山厦公共厕所', '东莞市虎门镇武山沙新区1路3号', '113.68957', '22.93969', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('836', '同沙生态公园映翠湖2公厕', '东莞市塘厦镇林村西荣路北', '113.5549', '22.5425', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('816', '华润万家三楼公厕', '万江街道金曲路万江龙舟竞渡广场旁', '113.5559', '22.5631', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('382', '莞城区旗峰广场三27号', '长安镇乌沙社区李屋西坊街13号第一市场娥媚月商场旁边', '114.01593', '22.99365', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('281', '上截村广场公厕', '东莞市清溪镇大利香元埔球场附近', '113.878107', '23.041939', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('1179', '\"龙眼', '东莞市塘厦镇莲湖中路莲湖广场', '113.71876', '22.93974', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('330', '广场公厕\"', '谢岗镇稔子园村公园内', '114.00039', '22.9558', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1327', '海仔湖南公厕2004', '东莞市莞城区皮鞋巷74号', '113.56549', '23.08231', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('1436', '谢坑50号公厕', '东莞市厚街镇龙阁山体育休闲公园（厚街大道河田路段旁）', '113.72667', '22.83078', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1450', '体育公园西门公交站公厕', '校椅围新村金骐厂对面', '113.71266', '22.85018', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('896', '石排公园停车场公厕1902', '新村停车场内', '113.81465', '22.91831', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('853', '漳澎水闸公厕', '东莞市常平镇上坑二横路', '113.923384', '22.939358', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('1142', '大朗52', '寒溪水文娱场内', '113.66393', '22.89882', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('172', '东平村大帽岭公厕', '东莞市厚街镇汀山坑口小组', '114.058413', '22.845421', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('656', '厚街镇神仙水公园03公厕        ', '东莞市常平镇教育路太和山广场', '113.474675', '22.485891', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('303', '厚街镇下汴03公厕', '东莞市麻涌镇南洲村南环东路南洲村委会内', '113.99403', '22.9666', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('640', '石龙镇新街口公共厕所', '东莞市虎门镇北栅社区团结二路斌斌厂对面', '114.1016', '22.5026', '6', '清溪镇', '8', '1');
INSERT INTO `igj` VALUES ('701', '樟木头樟洋公厕', '东莞市虎门镇赤岗社区白马路与富马五路交口', '113.79062', '22.8002', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('1', '厚街镇溪头水埗头公厕       ', '大岭山镇百花洞村民活动中心旁', '113.780723', '23.030167', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1304', '北栅农批市场公厕', '求富路花园', '113.60573', '23.07895', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('655', '凤冲公厕', '东莞市厚街镇溪头社区祠堂巷东街33号旁', '113.48721', '22.481855', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('583', '万达广场公厕', '塘厦社区文明街', '113.613548', '23.026863', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('1204', '南栅象山公厕(1)', '长安镇长安广场', '113.6229', '23.01391', '6', '洪梅镇', '8', '1');
INSERT INTO `igj` VALUES ('224', '厚街镇文化公园01公厕         ', '东莞市常平镇沿河东二路', '114.025048', '22.781901', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('287', '厚街镇下汴01公厕', '文化广场电影院对面', '113.850366', '23.0859', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('49', '国贸城公厕', '长安镇乌沙社区李屋西坊街8号乌沙市场对面', '113.816879', '22.987551', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1383', '南栅象山公厕(3)', '东莞市东城南路32号东城01公厕', '113.716', '23.12245', '6', '中堂镇', '8', '1');
INSERT INTO `igj` VALUES ('202003270016', '长安公园10号公厕', '东莞市麻涌镇川槎村第一工业区兴达市场', '114.18418', '22.82221', '6', '清溪镇', '8', '1');
INSERT INTO `igj` VALUES ('1050', '新安4号公厕', '长安镇如园公园', '113.66886', '22.932901', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('308', '南面余庆小筑公厕', '望牛墩镇疏港路锦涡村公园旁', '113.98203', '22.98563', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('951', '窑山村公园公厕', '洪梅镇梅新路戏曲文化区内', '114.126217', '22.729735', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1439', '望牛墩福安村公共厕所', '广东省东莞市大屏嶂森林公园管理处附近', '113.70829', '22.84577', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('806', '常平镇新市街公厕', '京山文化广场；', '113.548', '22.5653', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('1494', '莞城区东江大道03公厕', '同沙工业区', '113.70512', '22.77978', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('860', '塘厦林村里牙塘博建街公厕', '东莞市中堂镇三涌村中心公园旁', '113.974644', '22.928328', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('1084', '厚街镇溪头玛氏公厕', '东莞市清溪镇渔梁围市场里面', '113.678101', '22.962611', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1242', '\"龙眼', '东莞市厚街镇明丰广场左后方', '113.92253', '23.11132', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('389', '四路西公厕\"', '东莞市常平镇岗梓大道', '113.95273', '22.99654', '6', '东坑镇', '8', '1');
INSERT INTO `igj` VALUES ('328', '大岭村', '碧湖大道西新兴段20号侧', '113.97833', '22.96674', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('383', '厚街镇河田03公厕', '东莞市虎门镇龙眼社区新村东三路三十一巷16号', '114.00511', '22.9873', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1155', '常平镇常新公园03公厕', '巷尾文化广场一楼', '113.67004', '22.88453', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1376', '大宁百福公园公厕', '东莞市虎门镇宴岗二巷14号', '114.09244', '22.92367', '6', '樟木头镇', '8', '1');
INSERT INTO `igj` VALUES ('1490', '横沥镇新四小田头村公园公厕', '杨涌杨和街公园旁', '113.414618', '22.482318', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1077', '埔心村村委会旁1303', '东莞市厚街镇三屯企山头市场旁边', '113.679584', '22.941462', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('873', '鹰岭公厕', '东莞市石排镇田边方盈路44号', '113.968749', '22.900529', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('601', '厚街镇麒麟尾公厕 ', '文阁路', '114.532', '22.5832', '6', '谢岗镇', '8', '1');
INSERT INTO `igj` VALUES ('605', '\"东方', '东莞市常平镇振兴西路市场对面', '114.14469', '22.98061', '6', '谢岗镇', '8', '1');
INSERT INTO `igj` VALUES ('17', '方家祠公厕\"', '东莞市常平镇木棆大道公园后门', '113.744949', '23.040684', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('273', '厚街镇涌口02公厕', '东莞市厚街镇下汴社区文化广场', '113.904628', '23.036903', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('257', '常平镇朗贝公园公厕', '东莞市樟木头镇柏地社区原农贸市场侧边', '113.906909', '23.066238', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('46', '\"南面', '东莞市虎门镇东风社区东北村前路40号', '113.81058', '22.991888', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1381', '放生台公厕\"', '东莞市厚街镇岳范山公园内', '113.741', '23.1246', '6', '中堂镇', '8', '1');
INSERT INTO `igj` VALUES ('865', '香芒西路公园公厕', '凤山农业园', '113.886254', '22.874421', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('488', '沙田福禄沙村公共厕所', '谢岗镇银山湿地公园C区驿站', '114.08269', '23.01616', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('821', '厚街镇白濠02公厕', '东莞市谢岗镇谢岗村体育公园内', '113.5633', '22.5554', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('1384', '大朗10', '主山公交首末站', '113.70734', '23.11177', '6', '中堂镇', '8', '1');
INSERT INTO `igj` VALUES ('101', '星河城广场公厕', '粟边游屋公园；', '113.774541', '23.032937', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1029', '文化广场公厕', '南社村关帝庙旁；', '113.76507', '23.05209', '6', '莞城街道', '8', '1');
INSERT INTO `igj` VALUES ('957', '文化广场公厕', '东莞东城同沙广场', '114.127226', '22.766828', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1400', '沙田穗丰年水道公共厕所02', '东莞市中堂镇潢涌村村委对面', '113.44511', '22.4857', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('232', '\"北面', '犀牛陂村警务区旁', '113.852865', '23.092514', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('738', '邓屋公厕\"', '岭头广场', '113.74874', '22.78878', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('747', '动物园公厕5号（内4）', '政通路佳豪对面二楼', '113.72866', '22.80369', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('128', '下沙第三工业区公厕0202', '东莞市中堂镇湛翠村东隅一路', '113.751796', '23.020704', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1200', '新谷涌垃圾中转站公厕', '世纪广场二楼', '113.60839', '22.98808', '6', '洪梅镇', '8', '1');
INSERT INTO `igj` VALUES ('1202', '35百花洞村公厕', '东莞市莞城区解元坊巷7号', '113.63095', '23.01135', '6', '洪梅镇', '8', '1');
INSERT INTO `igj` VALUES ('26', '牙香街公厕', '浸校塘村小组公园内', '113.796648', '23.024134', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('248', '屋厦旧村公厕1', '东莞市虎门镇树田社区树田综合市场中', '113.917206', '23.062683', '6', '茶山镇', '8', '1');
INSERT INTO `igj` VALUES ('559', '南门钟楼公厕', '帝相庙公园', '113.394', '23.342', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('1086', '安南路公厕', '长安镇厦岗社区祥隆路篮球场旁', '113.67678', '22.966191', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('424', '莞城区床街公厕07号', '长安镇上角社区荧光路7号', '113.99786', '23.03577', '6', '横沥镇', '8', '1');
INSERT INTO `igj` VALUES ('858', '桑园旧村公厕', '东莞市鸿福东路1号民盈国贸中心', '113.950022', '22.940757', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('1080', '\"怀德', '洪梅镇新庄村洪新路3号', '113.67094', '22.95966', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1106', '大坑公厕\"', '洪梅镇氹涌村渔家村酒店后面', '113.67262', '22.92002', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('170', '涌头02号公厕', '东城石井路160号石井社区居委会旁', '114.058413', '22.845421', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('800', '宏达中路B01-3', '牛过蓢古树公园池塘旁；', '113.555', '22.581', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('785', '乌沙7号公厕', '聚龙江村得云路3号', '113.899707', '22.99592', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('1438', '东城岗贝市场公厕', '东莞市厚街镇西环路三屯小学边', '113.72322', '22.84042', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1345', '新安3号公厕', '横沥镇村尾村压缩站', '113.71557', '23.01296', '6', '万江街道', '8', '1');
INSERT INTO `igj` VALUES ('849', '大朗75', '关岭头', '113.950162', '22.952263', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('863', '莞城区东江大道02号公厕', '东莞市厚街镇宝屯北环路（压缩站）', '113.918115', '22.904903', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('769', '凤岗镇12号公厕', '东莞市厚街镇桥头塘面球场2旁 ', '113.5046', '23.0641', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('1341', '同沙生态公园荷花塘公厕', '塘厦大道中天和百货旁', '113.72233', '23.04629', '6', '万江街道', '8', '1');
INSERT INTO `igj` VALUES ('1002', '凤岗镇41号公厕', '竹山大宝路旧园路入口', '113.770195', '23.110235', '6', '高埗镇', '8', '1');
INSERT INTO `igj` VALUES ('1430', '莲湖小广场B01-2', '东莞市寮步镇西溪古村', '113.73183', '22.83774', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1036', '30连平圩球场公厕', '东莞市虎门镇北栅社区南坊路南坊新区球场旁电房二楼', '113.77707', '23.0515', '6', '莞城街道', '8', '1');
INSERT INTO `igj` VALUES ('1460', '\"武山沙', '万江街道简沙洲社区公交首末站旁', '113.676715', '22.834262', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('871', '公厕\"', '大朗镇大井头综合市场侧', '113.933476', '22.927423', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('428', '塘厦林村上塘二桥公厕', '松木山村新市场公厕', '113.95962', '23.02435', '6', '横沥镇', '8', '1');
INSERT INTO `igj` VALUES ('658', '万江龙船竞渡主题公园星级公厕', '东莞市寮步镇动物园公厕3号（内2）', '113.47571', '22.49217', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('298', '乌沙5号公厕', '万江街道大莲塘教育路一巷22号', '114.00414', '22.97738', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1118', '大利公厕', '卢溪村饭堂旁', '113.66293', '22.91834', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1476', '塘厦莲湖中路广场内公厕', '东莞市虎门镇北栅社区长堤路35号对面', '113.70395', '22.81762', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('598', '稔子园村公厕', '东莞市莞城区东兴路2号', '114.823', '22.5741', '6', '谢岗镇', '8', '1');
INSERT INTO `igj` VALUES ('750', '莞城区二市场公厕09号', '东莞市虎门镇博涌社区社岗市场二楼', '113.848726', '22.962583', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('184', '厚街镇龙阁山运动公园02公厕    ', '洋坑塘新围路', '114.08578', '22.79015', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('126', '大朗53', '横沥镇隔坑村围面前', '113.751796', '23.020704', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1211', '大朗31', '长安镇长安公园', '113.61272', '22.97575', '6', '洪梅镇', '8', '1');
INSERT INTO `igj` VALUES ('763', '常平镇上坑二横路公厕', '东莞市常平镇中元街', '113.865566', '23.001166', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('1163', '寒溪水文娱场公厕', '东莞市厚街镇新塘园新二路新塘文体广场旁', '113.68494', '22.93979', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('84', '厚街镇汀山坑口小组公厕       ', '东莞市虎门镇小捷滘社区捷南路公园内', '113.886108', '23.107212', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1544', '常平镇还珠沥太和山01公厕', '谢岗镇公园街泰园社区办公楼一楼', '113.68073', '22.82884', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1203', '南洲村委会公厕', '东莞市寮步镇佛灵湖大草坪', '113.62546', '22.97172', '6', '洪梅镇', '8', '1');
INSERT INTO `igj` VALUES ('1497', '北栅河潭岗公厕', '\"东莞市塘厦镇', '113.7117', '22.77343', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1151', '\"赤岗', '蛟乙塘宜居公园\"', '113.66501', '22.89273', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1431', '岗厦公厕\"', '东莞市鸿福东路1号民盈国贸中心', '113.72142', '22.84419', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('2', '百花洞村民活动中心公厕', '金鳌沙村市场内', '113.787509', '23.032525', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('18', '大朗72', '东莞市寮步镇香市公园', '113.783539', '23.047359', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('54', '厚街镇溪头铺前街公厕', '东莞市厚街镇河田六桂路河田小学旁', '113.773175', '22.961726', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('947', '文明街公厕', '东江大堤', '114.142231', '22.743401', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('867', '长安广场公厕1', '东莞市虎门镇虎门寨人民中路173号', '113.923813', '22.884681', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('734', '常平镇河滨公园02公厕', '洪梅镇乌沙村新南新路1号', '113.7476', '22.80312', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('823', '清溪镇文化广场星级公厕', '\"东莞市虎门镇路东长元路兴和酒店', '113.5635', '22.5612', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('924', '乌沙1号公厕', '后面公厕\"', '113.85072', '22.86451', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('421', '东城市场公厕', '东莞市厚街镇沙塘市场旁', '114.01252', '23.03405', '6', '横沥镇', '8', '1');
INSERT INTO `igj` VALUES ('399', '川槎兴达街公厕', '东莞市虎门镇北栅区西坊崩岗工业区二街2号四季农庄对面', '113.96555', '23.00769', '6', '东坑镇', '8', '1');
INSERT INTO `igj` VALUES ('309', '如园公园公厕2', '东城文化广场', '113.97896', '22.98876', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1126', '望牛墩锦涡村公共厕所', '东莞市东城主山大塘头垃圾中转站楼上', '113.64863', '22.92747', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1140', '戏曲公园公厕', '牛山社区牛山市场路口', '113.66422', '22.89973', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1159', '大屏嶂公厕', '园龙山公园公厕', '113.66599', '22.87625', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('501', '京山文化广场公厕', '水平市场', '114.12515', '23.0269', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('500', '同沙工业区公厕', '长安镇厦岗社区开源路八巷13号对面', '114.13169', '23.04114', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('901', '三涌公厕', '永安园', '113.851', '22.92829', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('725', '渔梁围20号公厕', '杨屋村第五小学对面', '113.76787', '22.79575', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('914', '厚街镇明丰广场公厕', '横沥镇田饶步村和田公园', '113.81122', '22.93333', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('1412', '常平镇岗梓大道公厕', '农业园南门', '113.74701', '22.84766', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('921', '凤岗镇25号公厕', '东莞市常平镇岗梓大埔工业区公园', '113.83345', '22.8779', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('20', '\"龙眼', '东莞市厚街镇涌口社区北社公园侧', '113.79258', '23.01941', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('686', '新村公厕\"', '东莞市厚街镇溪头社区斗楼桥旁', '113.79917', '22.83229', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('745', '大朗19', '东莞市厚街镇白濠中心路梁屋段', '113.71844', '22.80562', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('1011', '宴岗篮球场公厕', '山和村桥东路南二街一巷', '113.726893', '23.090378', '6', '高埗镇', '8', '1');
INSERT INTO `igj` VALUES ('1292', '大朗79', '东江村桥东路北五街东江舞台旁边', '113.58549', '23.04221', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('1266', '厚街镇企山头市场公厕         ', '金桔村文化广场', '113.6021', '22.86939', '6', '沙田镇', '8', '1');
INSERT INTO `igj` VALUES ('772', '石排田边村吉安二路1601', '长安镇上沙社区湖景路边', '113.82081', '23.0298', '6', '寮步镇', '8', '1');
INSERT INTO `igj` VALUES ('1442', '文阁路公厕', '连平村畔山村民小组', '113.70058', '22.84341', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1283', '常平镇金美振兴西路公厕', '东莞市虎门镇怀德矮岗环村西路11号', '113.5765', '23.0478', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('787', '常平镇木棆公园公厕', '大岭山大塘市场后面', '113.5518', '22.561', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('847', '厚街镇下汴02公厕', '公务员宿舍休闲公园', '113.911611', '22.94932', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('75', '樟木头柏地市场公厕', '长安镇锦厦社区龙坑尾公墓场下面', '113.802315', '22.965139', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('348', '\"东风', '长安镇上角社区铜古上路封闭小区后门', '114.0528', '22.97347', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('1498', '东北公厕\"', '文化广场', '113.42718', '22.46265', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1546', '厚街镇珊美03公厕', '东莞市麻涌镇大步村王坊凉亭旁绿道', '113.68017', '22.82691', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1123', '大朗18', '沙田镇保税区旁驿站（113.6021；22.86939）', '113.65041', '22.92466', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1038', '银山湿地公园C区驿站公厕', '东莞市寮步镇汽车东站', '113.76839', '23.04878', '6', '莞城街道', '8', '1');
INSERT INTO `igj` VALUES ('1428', '谢岗村体育公园公厕', '东莞市虎门镇龙眼社区亿民星光夜市旁', '113.71366', '22.819751', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('854', '主山公交首末站公厕', '东莞市麻涌镇麻二社区公园足球场旁', '113.947788', '22.950413', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('102', '粟边游屋公园公厕', '长盛公园10公厕', '113.774541', '23.032937', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('478', '南社村关帝庙旁公厕', '黎贝岭村委侧', '114.09024', '23.02199', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('1481', '同沙社区广场公厕', '东莞市同沙生态公园', '113.69723', '22.79182', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('200', '潢涌车站公厕', '东莞市常平镇常平镇麦元村篮球场旁', '114.074242', '22.799045', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('875', '大朗84', '东莞市虎门镇路东长元路篮球场旁', '113.968749', '22.900531', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('978', '岭头广场公厕', '东莞市虎门镇虎门寨仁贵街51号', '114.160293', '22.700284', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1231', '大朗38', '东莞市厚街镇涌口社区海月街海月舞台侧', '113.9311', '23.10216', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('991', '湛翠公厕', '东莞市莞城区东门广场和阳路', '114.15479', '22.699155', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('851', '世纪广场二楼公厕', '东莞市虎门镇大宁社区大塘路2号', '113.97023', '22.944051', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('1085', '莞城区解元坊公厕17号', '大朗圣堂荔湾市场公厕', '113.680771', '22.961491', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('95', '凤岗镇32号公厕', '世纪广场三楼', '113.777962', '23.032017', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1178', '\"树田', '田新社区广场街1号旁', '113.71075', '22.94467', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('25', '市场公厕\"', '东莞市虎门镇南栅社区西头村小组鱼塘旁', '113.754791', '23.054075', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('228', '帝相庙公园公厕', '塘厦镇莆心湖篮球场旁', '114.136348', '22.819635', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('934', '福海路08公厕', '凤山农业园', '114.130551', '22.744161', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('748', '上角04号公厕', '雁田公园', '113.71252', '22.80032', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('575', '国贸城公厕', '东莞市石排镇横山上宝潭村', '113.376', '23.226', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('731', '洪梅新庄公共厕所', '雁田公园公厕', '113.74846', '22.80234', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('472', '氹涌公共厕所', '体育公园', '114.08297', '23.00773', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('1254', '石井居委会公厕', '东莞市厚街镇三屯企山头环村路', '113.917418', '23.093297', '6', '石排镇', '8', '1');
INSERT INTO `igj` VALUES ('1294', '牛过蓢古树公园池塘旁公厕', '世博广场E区二楼', '113.58131', '23.04321', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('42', '望牛墩聚龙江村得云路公共厕所', '东莞市厚街镇汀山东埔小组', '113.817459', '23.081261', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('525', '厚街镇三屯小学边公厕           ', '梨川梨川路（光明眼科侧）', '113.85506', '23.11833', '6', '石龙镇', '8', '1');
INSERT INTO `igj` VALUES ('909', '横沥镇村尾村压缩站旁边', '东莞市塘厦镇横塘社区塘园路31号旁', '113.85094', '22.92831', '6', '大岭山镇', '8', '1');
INSERT INTO `igj` VALUES ('405', '大朗77', '凤平路体育馆广场旁', '113.97047', '23.03689', '6', '横沥镇', '8', '1');
INSERT INTO `igj` VALUES ('929', '厚街镇宝屯02公厕', '长安镇上角社区沙浦街9号', '113.984605', '22.929794', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1366', '厚街镇桥头社区05公厕', '望牛墩镇横沥村十四巷252号之四', '114.14003', '22.93552', '6', '樟木头镇', '8', '1');
INSERT INTO `igj` VALUES ('1524', '塘厦大道中环保公厕', '长安镇厦岗社区盘福北街16号', '113.68161', '22.80686', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('1298', '大朗12', '石水口公园内', '113.58982', '23.06239', '6', '麻涌镇', '8', '1');
INSERT INTO `igj` VALUES ('963', '西溪古村公厕', '东莞市石排镇中坑村康乐礼堂旁', '114.160617', '22.734511', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('971', '北栅南坊电房公厕', '东莞市麻涌镇大步村大步公园内', '114.169872', '22.717067', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('791', '简沙洲公厕', '东莞柏洲边松岭公园', '113.5647', '0', '6', '大朗镇', '8', '1');
INSERT INTO `igj` VALUES ('493', '大朗68', '东莞市石龙镇中山西社区长兴街94街', '114.545', '23.176', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('958', '大朗82', '金桔村横镇东路', '114.134472', '22.774717', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('1111', '动物园公厕3号（内2）', '东莞市横沥镇新四小坑尾公园', '113.670343', '22.913975', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('1452', '大莲塘休闲公厕', '凤园路休闲长廊', '113.70576', '22.85286', '6', '虎门镇', '8', '1');
INSERT INTO `igj` VALUES ('161', '卢溪村', '东莞市樟木头镇金河社区竹排村（金河第三工业区）', '113.788918', '23.020941', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1149', '\"北栅东坊', '东莞市虎门镇新湾社区朝阳路41号', '113.66215', '22.89052', '6', '厚街镇', '8', '1');
INSERT INTO `igj` VALUES ('213', '沙坑公厕\"', '东莞市麻涌镇新基村委会球场后面', '114.1007', '22.768314', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('1013', '莞城区步步高公厕26号', '凤翔路', '113.753155', '23.094317', '6', '高埗镇', '8', '1');
INSERT INTO `igj` VALUES ('340', '\"博涌', '油甘埔沙岭金泰新村', '114.014282', '22.940821', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('177', '社岗公厕\"', '湿地公园河边', '114.103099', '22.831673', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('557', '大朗88', '邓屋村邓屋广场', '113.395', '23.351', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('202003270010', '横沥镇隔坑村围面前公厕', '浸校塘工业区创业路', '114.19997', '22.83657', '6', '清溪镇', '8', '1');
INSERT INTO `igj` VALUES ('474', '长安公园06号公厕', '东莞市厚街镇南五雀岭街西', '114.057683', '23.0211', '6', '桥头镇', '8', '1');
INSERT INTO `igj` VALUES ('744', '常平镇中元街公厕', '东莞市虎门镇赤岗社区新村路10号附近', '113.71284', '22.80297', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('185', '厚街镇新塘03公厕', '东莞市东昇路星河城', '114.08214', '22.840797', '6', '塘厦镇', '8', '1');
INSERT INTO `igj` VALUES ('21', '小捷滘捷锋公园公厕', '东莞市厚街镇沙塘广场公园旁', '113.767136', '23.042435', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('1380', '泰园社区办公楼公厕', '东莞市塘厦镇石鼓旧会堂旁', '113.75226', '23.12706', '6', '中堂镇', '8', '1');
INSERT INTO `igj` VALUES ('695', '佛灵湖大草坪公厕', '高埗广场西', '113.7919', '22.82092', '6', '长安镇', '8', '1');
INSERT INTO `igj` VALUES ('104', '蛟乙塘54号宜居公园厕所', '东莞市常平镇桥沥公园内', '113.774541', '23.032937', '6', '东城街道', '8', '1');
INSERT INTO `igj` VALUES ('359', '国贸城公厕', '东莞市塘厦镇塘联综合市场', '114.06074', '22.98267', '6', '常平镇', '8', '1');
INSERT INTO `igj` VALUES ('942', '金鳌沙村市场内', '聚龙江村横江北路8号', '114.141135', '22.731439', '6', '凤岗镇', '8', '1');
INSERT INTO `igj` VALUES ('565', '香市公园（集散中心）公厕', '东莞市清溪镇铁松市场里面', '113.3855', '23.357', '6', '望牛墩镇', '8', '1');
INSERT INTO `igj` VALUES ('1307', '厚街镇河田02公厕', '大洲社区大新路95号', '113.59789', '23.07428', '6', '麻涌镇', '8', '1');

-- ----------------------------
-- Table structure for pl_datasource
-- ----------------------------
DROP TABLE IF EXISTS `pl_datasource`;
CREATE TABLE `pl_datasource` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `name` varchar(100) DEFAULT NULL COMMENT '名称',
  `connection_type` int(11) DEFAULT '0' COMMENT '连接类型 0:主机连接,1:URl连接',
  `db_type` varchar(20) DEFAULT 'mysql' COMMENT '数据库类型',
  `host` varchar(30) DEFAULT NULL COMMENT '主机',
  `port` varchar(10) DEFAULT NULL COMMENT '端口',
  `instance` varchar(100) DEFAULT NULL COMMENT '实例名',
  `db_name` varchar(150) DEFAULT NULL COMMENT '数据库名称',
  `url` text COMMENT '地址',
  `username` varchar(150) DEFAULT NULL COMMENT '用户名',
  `password` varchar(255) DEFAULT NULL COMMENT '密码',
  `tenant_id` varchar(64) DEFAULT NULL COMMENT '租户id',
  `create_user_id` varchar(64) DEFAULT NULL COMMENT '创建人id',
  `create_time` datetime DEFAULT NULL COMMENT '创建时间',
  `update_user_id` varchar(0) DEFAULT NULL COMMENT '更新人id',
  `update_time` datetime DEFAULT NULL COMMENT '更新时间',
  `delete_flag` int(11) DEFAULT '0' COMMENT '逻辑删除 0:正常，1:删除',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8mb4 ROW_FORMAT=DYNAMIC COMMENT='数据源';

-- ----------------------------
-- Records of pl_datasource
-- ----------------------------
INSERT INTO `pl_datasource` VALUES ('15', 'cc_dum2', '0', 'mysql', '10.12.107.80', '3306', null, 'cc_dum2', 'jdbc:mysql://10.12.107.80:3306/cc_dum2?useUnicode=true&characterEncoding=utf8&autoReconnect=true&rewriteBatchedStatements=true&useSSL=false&serverTimezone=UTC&serverTimezone=GMT%2b8', 'root', 'Cci@2020', null, null, null, null, null, '0');

-- ----------------------------
-- Table structure for pl_generate_config
-- ----------------------------
DROP TABLE IF EXISTS `pl_generate_config`;
CREATE TABLE `pl_generate_config` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `name` varchar(150) DEFAULT NULL COMMENT '配置名称',
  `config_content` longtext COMMENT '配置内容',
  `create_time` datetime DEFAULT NULL COMMENT '创建时间',
  `update_user_id` varchar(64) DEFAULT NULL COMMENT '更新者id',
  `update_time` datetime DEFAULT NULL COMMENT '更新时间',
  `delete_flag` int(11) DEFAULT '0' COMMENT '逻辑删除 0:正常，1:删除',
  `tenant_id` varchar(64) DEFAULT NULL COMMENT '租户id',
  `create_user_id` varchar(64) DEFAULT NULL COMMENT '创建者id',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 ROW_FORMAT=DYNAMIC COMMENT='代码生成配置';

-- ----------------------------
-- Records of pl_generate_config
-- ----------------------------
INSERT INTO `pl_generate_config` VALUES ('1', '默认配置-copy', '{\"author\":\"plserver\",\"columnConfig\":{\"commonColumns\":[\"create_time\",\"update_time\",\"create_user_id，update_user_id\",\"delete_flag\"],\"insertFillColumns\":[\"create_time\",\"create_user_id\"],\"insertOrUpdateFillColumns\":[\"update_time\",\"update_user_id\"],\"logicDeleteColumns\":[\"delete_flag\"]},\"controllerConfig\":{\"basicApi\":true,\"responseEntity\":{\"errorMethod\":\"fail\",\"packageName\":\"com.pl.core.response.Result\",\"successMethod\":\"ok\"}},\"entityConfig\":{\"extendsSuper\":false,\"lombokConfig\":{\"accessors\":{\"enable\":false,\"mode\":\"\",\"prefixModeValue\":\"\"},\"allArgsConstructor\":false,\"builder\":false,\"data\":true,\"enable\":true,\"enableAccessors\":false,\"equalsAndHashCode\":false,\"getter\":false,\"noAllArgsConstructor\":false,\"setter\":false,\"toStr\":false},\"superClassPackage\":\"\"},\"mapperConfig\":{\"buildXml\":true,\"idType\":\"assign_id\",\"mapperAnnotation\":true},\"packageName\":\"com.pl\",\"style\":\"pl-web\",\"swagger\":true,\"tablePrefix\":\"pl_\",\"typeMapperConfig\":[{\"columnType\":\"decimal\",\"importPackage\":true,\"javaType\":\"BigDecimal\",\"packageName\":\"java.math.BigDecimal\"},{\"columnType\":\"float\",\"importPackage\":false,\"javaType\":\"Float\",\"packageName\":\"java.lang.Float\"},{\"columnType\":\"integer\",\"importPackage\":false,\"javaType\":\"Integer\",\"packageName\":\"java.lang.Integer\"},{\"columnType\":\"timestamp\",\"importPackage\":true,\"javaType\":\"LocalDateTime\",\"packageName\":\"java.time.LocalDateTime\"},{\"columnType\":\"bigint\",\"importPackage\":false,\"javaType\":\"Long\",\"packageName\":\"java.lang.Long\"},{\"columnType\":\"datetime\",\"importPackage\":true,\"javaType\":\"LocalDateTime\",\"packageName\":\"java.time.LocalDateTime\"},{\"columnType\":\"mediumint\",\"importPackage\":false,\"javaType\":\"Integer\",\"packageName\":\"java.lang.Integer\"},{\"columnType\":\"tinyint\",\"importPackage\":false,\"javaType\":\"Integer\",\"packageName\":\"java.lang.Integer\"},{\"columnType\":\"varchar\",\"importPackage\":false,\"javaType\":\"String\",\"packageName\":\"java.lang.String\"},{\"columnType\":\"mediumtext\",\"importPackage\":false,\"javaType\":\"String\",\"packageName\":\"java.lang.String\"},{\"columnType\":\"date\",\"importPackage\":true,\"javaType\":\"LocalDate\",\"packageName\":\"java.time.LocalDate\"},{\"columnType\":\"smallint\",\"importPackage\":false,\"javaType\":\"Integer\",\"packageName\":\"java.lang.Integer\"},{\"columnType\":\"int\",\"importPackage\":false,\"javaType\":\"Integer\",\"packageName\":\"java.lang.Integer\"},{\"columnType\":\"bit\",\"importPackage\":false,\"javaType\":\"Boolean\",\"packageName\":\"java.lang.Boolean\"},{\"columnType\":\"tinytext\",\"importPackage\":false,\"javaType\":\"String\",\"packageName\":\"java.lang.String\"},{\"columnType\":\"double\",\"importPackage\":false,\"javaType\":\"Double\",\"packageName\":\"java.lang.Double\"},{\"columnType\":\"text\",\"importPackage\":false,\"javaType\":\"String\",\"packageName\":\"java.lang.String\"},{\"columnType\":\"char\",\"importPackage\":false,\"javaType\":\"String\",\"packageName\":\"java.lang.String\"},{\"columnType\":\"longtext\",\"importPackage\":false,\"javaType\":\"String\",\"packageName\":\"java.lang.String\"}],\"wired\":true,\"wiredType\":\"autoWired\"}', '2021-06-18 15:28:21', null, '2021-06-18 15:28:21', '0', null, null);
INSERT INTO `pl_generate_config` VALUES ('3', 'liuds', '{\"author\":\"liuds\",\"columnConfig\":{\"commonColumns\":[\"create_time\",\"update_time\",\"create_user_id，update_user_id\",\"delete_flag\"],\"hiddenColumns\":[],\"insertFillColumns\":[\"create_time\",\"create_user_id\"],\"insertOrUpdateFillColumns\":[\"update_time\",\"update_user_id\"],\"logicDeleteColumns\":[\"delete_flag\"],\"updateFillColumns\":[]},\"controllerConfig\":{\"basicApi\":true,\"responseEntity\":{\"errorMethod\":\"error\",\"packageName\":\"com.liuds.springbootchus.config.Result\",\"successMethod\":\"success\"}},\"entityConfig\":{\"extendsSuper\":false,\"lombokConfig\":{\"accessors\":{\"enable\":false},\"allArgsConstructor\":false,\"builder\":false,\"data\":true,\"enable\":true,\"enableAccessors\":false,\"equalsAndHashCode\":false,\"getter\":false,\"noAllArgsConstructor\":false,\"setter\":false,\"toStr\":false},\"superClassGenericPackage\":[]},\"mapperConfig\":{\"buildXml\":true,\"idType\":\"assign_id\",\"mapperAnnotation\":true,\"method\":[]},\"packageName\":\"com.liuds.springbootchus.modular.demo\",\"style\":\"mybatis-plus\",\"swagger\":true,\"tablePrefix\":\"\",\"typeMapperConfig\":[{\"importPackage\":false}],\"wired\":true,\"wiredType\":\"autoWired\"}', null, null, null, '0', null, null);
INSERT INTO `pl_generate_config` VALUES ('4', 'test', '{\"author\":\"liuds\",\"columnConfig\":{\"commonColumns\":[\"creator\",\"create_date\",\"update_date\",\"updater\"],\"hiddenColumns\":[],\"insertFillColumns\":[\"creator\",\"create_date\"],\"insertOrUpdateFillColumns\":[\"update_date\",\"updater\"],\"logicDeleteColumns\":[],\"updateFillColumns\":[]},\"controllerConfig\":{\"basicApi\":true,\"responseEntity\":{\"errorMethod\":\"error\",\"packageName\":\"com.liuds.springbootchus.config.Result\",\"successMethod\":\"success\"}},\"entityConfig\":{\"extendsSuper\":false,\"lombokConfig\":{\"accessors\":{\"enable\":false,\"mode\":\"\",\"prefixModeValue\":\"\"},\"allArgsConstructor\":false,\"builder\":false,\"data\":true,\"enable\":true,\"enableAccessors\":false,\"equalsAndHashCode\":false,\"getter\":false,\"noAllArgsConstructor\":false,\"setter\":false,\"toStr\":false},\"superClassGenericPackage\":[],\"superClassPackage\":\"\"},\"mapperConfig\":{\"buildXml\":true,\"idType\":\"assign_id\",\"mapperAnnotation\":true,\"method\":[]},\"packageName\":\"com.liuds.springbootchus.modular\",\"style\":\"mybatis-plus\",\"swagger\":true,\"tablePrefix\":\"\",\"typeMapperConfig\":[{\"columnType\":\"decimal\",\"importPackage\":true,\"javaType\":\"BigDecimal\",\"packageName\":\"java.math.BigDecimal\"},{\"columnType\":\"float\",\"importPackage\":false,\"javaType\":\"Float\",\"packageName\":\"java.lang.Float\"},{\"columnType\":\"integer\",\"importPackage\":false,\"javaType\":\"Integer\",\"packageName\":\"java.lang.Integer\"},{\"columnType\":\"timestamp\",\"importPackage\":true,\"javaType\":\"LocalDateTime\",\"packageName\":\"java.time.LocalDateTime\"},{\"columnType\":\"bigint\",\"importPackage\":false,\"javaType\":\"Long\",\"packageName\":\"java.lang.Long\"},{\"columnType\":\"datetime\",\"importPackage\":true,\"javaType\":\"LocalDateTime\",\"packageName\":\"java.time.LocalDateTime\"},{\"columnType\":\"mediumint\",\"importPackage\":false,\"javaType\":\"Integer\",\"packageName\":\"java.lang.Integer\"},{\"columnType\":\"tinyint\",\"importPackage\":false,\"javaType\":\"Integer\",\"packageName\":\"java.lang.Integer\"},{\"columnType\":\"varchar\",\"importPackage\":false,\"javaType\":\"String\",\"packageName\":\"java.lang.String\"},{\"columnType\":\"mediumtext\",\"importPackage\":false,\"javaType\":\"String\",\"packageName\":\"java.lang.String\"},{\"columnType\":\"date\",\"importPackage\":true,\"javaType\":\"LocalDate\",\"packageName\":\"java.time.LocalDate\"},{\"columnType\":\"smallint\",\"importPackage\":false,\"javaType\":\"Integer\",\"packageName\":\"java.lang.Integer\"},{\"columnType\":\"int\",\"importPackage\":false,\"javaType\":\"Integer\",\"packageName\":\"java.lang.Integer\"},{\"columnType\":\"bit\",\"importPackage\":false,\"javaType\":\"Boolean\",\"packageName\":\"java.lang.Boolean\"},{\"columnType\":\"tinytext\",\"importPackage\":false,\"javaType\":\"String\",\"packageName\":\"java.lang.String\"},{\"columnType\":\"double\",\"importPackage\":false,\"javaType\":\"Double\",\"packageName\":\"java.lang.Double\"},{\"columnType\":\"text\",\"importPackage\":false,\"javaType\":\"String\",\"packageName\":\"java.lang.String\"},{\"columnType\":\"char\",\"importPackage\":false,\"javaType\":\"String\",\"packageName\":\"java.lang.String\"},{\"columnType\":\"longtext\",\"importPackage\":false,\"javaType\":\"String\",\"packageName\":\"java.lang.String\"}],\"wired\":true,\"wiredType\":\"autoWired\"}', '2021-06-18 15:28:21', null, null, '0', '', '');

-- ----------------------------
-- Table structure for sys_dept
-- ----------------------------
DROP TABLE IF EXISTS `sys_dept`;
CREATE TABLE `sys_dept` (
  `id` bigint(20) NOT NULL COMMENT 'id',
  `pid` bigint(20) DEFAULT NULL COMMENT '上级ID，一级部门为0',
  `name` varchar(50) DEFAULT NULL COMMENT '部门名称',
  `remark` varchar(100) DEFAULT NULL COMMENT '备注',
  `sort` int(10) unsigned DEFAULT NULL COMMENT '排序',
  `status` tinyint(3) DEFAULT '1' COMMENT '状态(0:删除 1:正常)',
  `creator` bigint(20) DEFAULT NULL COMMENT '创建者',
  `create_date` datetime DEFAULT NULL COMMENT '创建时间',
  `updater` bigint(20) DEFAULT NULL COMMENT '更新者',
  `update_date` datetime DEFAULT NULL COMMENT '更新时间',
  PRIMARY KEY (`id`),
  KEY `idx_pid` (`pid`),
  KEY `idx_sort` (`sort`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='部门管理';

-- ----------------------------
-- Records of sys_dept
-- ----------------------------
INSERT INTO `sys_dept` VALUES ('1067246875800000062', '1067246875800000063', '技术部', null, '2', '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_dept` VALUES ('1067246875800000063', '1067246875800000066', '长沙分公司', null, '1', '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_dept` VALUES ('1067246875800000064', '1067246875800000066', '上海分公司', null, '0', '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_dept` VALUES ('1067246875800000065', '1067246875800000064', '市场部', null, '0', '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_dept` VALUES ('1067246875800000066', '0', '集团', null, '0', '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_dept` VALUES ('1067246875800000067', '1067246875800000064', '销售部', null, '0', '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_dept` VALUES ('1067246875800000068', '1067246875800000063', '产品部', null, '1', '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');

-- ----------------------------
-- Table structure for sys_dept_role_user_menu
-- ----------------------------
DROP TABLE IF EXISTS `sys_dept_role_user_menu`;
CREATE TABLE `sys_dept_role_user_menu` (
  `id` bigint(20) NOT NULL COMMENT 'id',
  `dept_id` bigint(20) DEFAULT NULL COMMENT '部门id',
  `user_id` bigint(20) DEFAULT NULL COMMENT '用户id',
  `role_id` bigint(20) DEFAULT NULL COMMENT '角色ID',
  `menu_id` bigint(20) NOT NULL COMMENT '菜单ID',
  `status` tinyint(3) DEFAULT '1' COMMENT '状态（0：删除 1：正常）',
  `creator` bigint(20) DEFAULT NULL COMMENT '创建者',
  `create_date` datetime DEFAULT NULL COMMENT '创建时间',
  `updater` bigint(20) DEFAULT NULL COMMENT '更新人',
  `update_date` datetime DEFAULT NULL COMMENT '更新时间',
  PRIMARY KEY (`id`),
  KEY `idx_role_id` (`role_id`),
  KEY `idx_menu_id` (`menu_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='部门角色用户-权限关系';

-- ----------------------------
-- Records of sys_dept_role_user_menu
-- ----------------------------

-- ----------------------------
-- Table structure for sys_dict_data
-- ----------------------------
DROP TABLE IF EXISTS `sys_dict_data`;
CREATE TABLE `sys_dict_data` (
  `id` bigint(20) NOT NULL COMMENT 'id',
  `dict_type_id` bigint(20) NOT NULL COMMENT '字典类型ID',
  `dict_label` varchar(255) NOT NULL COMMENT '字典标签',
  `dict_value` varchar(255) DEFAULT NULL COMMENT '字典值',
  `remark` varchar(255) DEFAULT NULL COMMENT '备注',
  `sort` int(10) unsigned DEFAULT NULL COMMENT '排序',
  `creator` bigint(20) DEFAULT NULL COMMENT '创建者',
  `create_date` datetime DEFAULT NULL COMMENT '创建时间',
  `updater` bigint(20) DEFAULT NULL COMMENT '更新者',
  `update_date` datetime DEFAULT NULL COMMENT '更新时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `uk_dict_type_value` (`dict_type_id`,`dict_value`),
  KEY `idx_sort` (`sort`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='字典数据';

-- ----------------------------
-- Records of sys_dict_data
-- ----------------------------
INSERT INTO `sys_dict_data` VALUES ('1160061112075464705', '1160061077912858625', '男', '0', '', '0', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_dict_data` VALUES ('1160061146967879681', '1160061077912858625', '女', '1', '', '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_dict_data` VALUES ('1160061190127267841', '1160061077912858625', '保密', '2', '', '2', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_dict_data` VALUES ('1225814069634195457', '1225813644059140097', '公告', '0', '', '0', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_dict_data` VALUES ('1225814107559092225', '1225813644059140097', '会议', '1', '', '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_dict_data` VALUES ('1225814271879340034', '1225813644059140097', '其他', '2', '', '2', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');

-- ----------------------------
-- Table structure for sys_log_operation
-- ----------------------------
DROP TABLE IF EXISTS `sys_log_operation`;
CREATE TABLE `sys_log_operation` (
  `id` bigint(20) NOT NULL COMMENT 'id',
  `type` varchar(1) DEFAULT '1' COMMENT '日志类型 1 操作日志 2异常日志 3 慢接口日志',
  `operation` varchar(50) DEFAULT NULL COMMENT '用户操作',
  `request_uri` varchar(200) DEFAULT NULL COMMENT '请求URI',
  `request_method` varchar(20) DEFAULT NULL COMMENT '请求方式',
  `request_params` text COMMENT '请求参数',
  `request_time` int(10) unsigned DEFAULT NULL COMMENT '请求时长(毫秒)',
  `user_agent` varchar(500) DEFAULT NULL COMMENT '用户代理',
  `ip` varchar(32) DEFAULT NULL COMMENT '操作IP',
  `remark` text COMMENT '状态说明',
  `code` int(8) unsigned NOT NULL COMMENT '状态 200为成功，非200 为失败',
  `creator_name` varchar(50) DEFAULT NULL COMMENT '用户名',
  `creator` bigint(20) DEFAULT NULL COMMENT '创建者',
  `create_date` datetime DEFAULT NULL COMMENT '创建时间',
  `updater` bigint(20) DEFAULT NULL COMMENT '更新人',
  `update_date` datetime DEFAULT NULL COMMENT '更新时间',
  PRIMARY KEY (`id`),
  KEY `idx_create_date` (`create_date`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='操作日志';

-- ----------------------------
-- Records of sys_log_operation
-- ----------------------------
INSERT INTO `sys_log_operation` VALUES ('1552831923594747905', '', '获取案件短信列表', '', '', '', '2', '', '', '', '0', '', '0', '2022-07-29 09:42:35', '0', '2022-08-02 14:31:51');
INSERT INTO `sys_log_operation` VALUES ('1552831924823678978', '', '短信列表', '', 'gggg', '', '13', '', '', '', '0', '', '0', '2022-07-29 09:42:36', '0', '2022-08-02 14:50:10');
INSERT INTO `sys_log_operation` VALUES ('1552848496476930049', '1', '获取案件短信列表', '/video-api/sms/dynamic', 'GET', '\"103\"', '1951', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-07-29 10:48:27', null, null);
INSERT INTO `sys_log_operation` VALUES ('1552848546871492610', '1', '获取案件短信列表', '/video-api/sms/dynamic', 'GET', '\"1030000\"', '151', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-07-29 10:48:39', null, null);
INSERT INTO `sys_log_operation` VALUES ('1552896904948387842', '1', '获取案件短信列表', '/video-api/sms/smsCaseList', 'POST', '{\"size\":2,\"current\":2,\"danwi\":\"2\",\"geren\":2}', '2', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '不等于2', '403', '用户名称', null, '2022-07-29 14:00:48', null, null);
INSERT INTO `sys_log_operation` VALUES ('1552905275114082306', '1', '获取案件短信列表', '/video-api/sms/smsCaseList', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'JSON parse error: Unexpected character (\',\' (code 44)): expected a value; nested exception is com.fasterxml.jackson.core.JsonParseException: Unexpected character (\',\' (code 44)): expected a value\n at [Source: (PushbackInputStream); line: 2, column: 14]', '403', null, null, '2022-07-29 14:34:04', null, null);
INSERT INTO `sys_log_operation` VALUES ('1552905535915905025', '1', '获取案件短信列表', '/video-api/sms/smsCaseList', 'POST', '{\"size\":2,\"current\":2,\"danwi\":\"2\",\"geren\":2}', '2', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '不等于2', '403', '用户名称', null, '2022-07-29 14:35:06', null, null);
INSERT INTO `sys_log_operation` VALUES ('1552905537081921537', '1', '获取案件短信列表', '/video-api/sms/smsCaseList', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '不等于2【错误类型】:业务异常403', '403', null, null, '2022-07-29 14:35:06', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554001162229796866', '1', '获取案件短信列表', '/video-api/sms/smsCaseList', 'POST', '{\"size\":2,\"current\":2,\"danwi\":\"2\",\"geren\":2}', '9', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '不等于2', '403', '用户名称', null, '2022-08-01 15:08:44', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554001163584557058', '2', '获取案件短信列表', '/video-api/sms/smsCaseList', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '不等于2【错误类型】:业务异常403', '403', null, null, '2022-08-01 15:08:44', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554022849973448705', '2', '获取案件短信列表', '/video-api/sysLog/page', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '单位错误', '400', null, null, '2022-08-01 16:34:54', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554022970408693762', '1', '获取案件短信列表', '/video-api/sysLog/page', 'POST', '{\"size\":0,\"current\":2,\"danwi\":\"1221\",\"geren\":0}', '9', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', null, '403', '用户名称', null, '2022-08-01 16:35:23', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554023433510064129', '1', '获取案件短信列表', '/video-api/sysLog/page', 'POST', '{\"size\":0,\"current\":2,\"danwi\":\"1221\",\"geren\":0}', '2', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '自定义异常=登录异常', '403', '用户名称', null, '2022-08-01 16:37:14', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554023435070345218', '2', '获取案件短信列表', '/video-api/sysLog/page', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '自定义异常=登录异常【错误类型】:自定义异常=登录异常402', '403', null, null, '2022-08-01 16:37:14', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554023544294215682', '1', '获取案件短信列表', '/video-api/sysLog/page', 'POST', '{\"size\":10,\"current\":2,\"danwi\":\"1221\",\"geren\":0}', '1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '自定义异常=登录异常', '403', '用户名称', null, '2022-08-01 16:37:40', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554023545468620801', '2', '获取案件短信列表', '/video-api/sysLog/page', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '自定义异常=登录异常【错误类型】:自定义异常=登录异常402', '403', null, null, '2022-08-01 16:37:40', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554023584010080258', '1', '获取案件短信列表', '/video-api/sysLog/page', 'POST', '{\"size\":10,\"current\":1,\"danwi\":\"1221\",\"geren\":0}', '3074', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-01 16:37:49', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554042714687897601', '1', '获取案件短信列表', '/video-api/sysLog/pageOne', 'POST', '{\"size\":5,\"current\":2,\"danwi\":\"22\",\"geren\":0}', '1343', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: Unknown column \'current\' in \'where clause\'\r\n### The error may exist in com/liuds/springbootchus/dao/SysLogOperationDao.java (best guess)\r\n### The error may involve defaultParameterMap\r\n### The error occurred while setting parameters\r\n### SQL: SELECT COUNT(*) AS total FROM sys_log_operation WHERE (current = ? AND size = ? AND geren = ? AND danwi = ?)\r\n### Cause: java.sql.SQLSyntaxErrorException: Unknown column \'current\' in \'where clause\'\n; bad SQL grammar []; nested exception is java.sql.SQLSyntaxErrorException: Unknown column \'current\' in \'where clause\'', '403', '用户名称', null, '2022-08-01 17:53:51', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554042716176875522', '2', '获取案件短信列表', '/video-api/sysLog/pageOne', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: Unknown column \'current\' in \'where clause\'\r\n### The error may exist in com/liuds/springbootchus/dao/SysLogOperationDao.java (best guess)\r\n### The error may involve defaultParameterMap\r\n### The error occurred while setting parameters\r\n### SQL: SELECT COUNT(*) AS total FROM sys_log_operation WHERE (current = ? AND size = ? AND geren = ? AND danwi = ?)\r\n### Cause: java.sql.SQLSyntaxErrorException: Unknown column \'current\' in \'where clause\'\n; bad SQL grammar []; nested exception is java.sql.SQLSyntaxErrorException: Unknown column \'current\' in \'where clause\'', '500', null, null, '2022-08-01 17:53:51', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554047975838314497', '2', '获取案件短信列表', '/video-api/sysLog/pageOne', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '用户操作错误', '400', null, null, '2022-08-01 18:14:45', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554048333436284930', '1', '单表分页', '/video-api/sysLog/pageOne', 'POST', '{\"size\":5,\"current\":0,\"operation\":\"获取案件短信列表\",\"requestMethod\":\"\"}', '1090', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-01 18:16:10', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554049078235496449', '1', '单表分页', '/video-api/sysLog/pageOne', 'POST', '{\"size\":5,\"current\":0,\"operation\":\"获取案件短信列表\",\"requestMethod\":\"\"}', '791', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-01 18:19:08', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554049216945324034', '1', '单表分页', '/video-api/sysLog/pageOne', 'POST', '{\"size\":5,\"current\":0,\"operation\":\"获取案件短信列表\",\"requestMethod\":\"GET\"}', '593', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: Unknown column \'requestMethod\' in \'where clause\'\r\n### The error may exist in com/liuds/springbootchus/dao/SysLogOperationDao.java (best guess)\r\n### The error may involve defaultParameterMap\r\n### The error occurred while setting parameters\r\n### SQL: SELECT COUNT(*) AS total FROM sys_log_operation WHERE (requestMethod = ? AND operation = ?)\r\n### Cause: java.sql.SQLSyntaxErrorException: Unknown column \'requestMethod\' in \'where clause\'\n; bad SQL grammar []; nested exception is java.sql.SQLSyntaxErrorException: Unknown column \'requestMethod\' in \'where clause\'', '403', '用户名称', null, '2022-08-01 18:19:41', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554049217922596865', '2', '更新', '/video-api/sysLog/pageOne', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: Unknown column \'requestMethod\' in \'where clause\'\r\n### The error may exist in com/liuds/springbootchus/dao/SysLogOperationDao.java (best guess)\r\n### The error may involve defaultParameterMap\r\n### The error occurred while setting parameters\r\n### SQL: SELECT COUNT(*) AS total FROM sys_log_operation WHERE (requestMethod = ? AND operation = ?)\r\n### Cause: java.sql.SQLSyntaxErrorException: Unknown column \'requestMethod\' in \'where clause\'\n; bad SQL grammar []; nested exception is java.sql.SQLSyntaxErrorException: Unknown column \'requestMethod\' in \'where clause\'', '500', null, null, '2022-08-01 18:19:41', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554053943204552705', '1', '更新', '/video-api/sysLog/updateById', 'POST', '{\"id\":1552576082094391298,\"creator\":0,\"createDate\":null,\"updater\":0,\"updateDate\":1659350306708,\"operation\":\"测试多数\",\"type\":\"\",\"requestUri\":\"\",\"requestMethod\":\"\",\"requestParams\":\"\",\"requestTime\":0,\"userAgent\":\"\",\"ip\":\"\",\"code\":0,\"remark\":\"\",\"creatorName\":\"\"}', '929', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-01 18:38:28', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554054488489238529', '1', '更新', '/video-api/sysLog/updateById', 'POST', '{\"id\":1552576082094391298,\"creator\":0,\"createDate\":null,\"updater\":0,\"updateDate\":1659350437057,\"operation\":\"测试多数\",\"type\":\"\",\"requestUri\":\"\",\"requestMethod\":\"\",\"requestParams\":\"\",\"requestTime\":0,\"userAgent\":\"\",\"ip\":\"\",\"code\":0,\"remark\":\"\",\"creatorName\":\"\"}', '549', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'nested exception is org.apache.ibatis.exceptions.PersistenceException: \r\n### Error updating database.  Cause: com.baomidou.mybatisplus.core.exceptions.MybatisPlusException: Prohibition of table update operation\r\n### The error may exist in com/liuds/springbootchus/dao/SysLogOperationDao.java (best guess)\r\n### The error may involve com.liuds.springbootchus.dao.SysLogOperationDao.update\r\n### The error occurred while executing an update\r\n### Cause: com.baomidou.mybatisplus.core.exceptions.MybatisPlusException: Prohibition of table update operation', '403', '用户名称', null, '2022-08-01 18:40:38', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554054489789472769', '2', '更新', '/video-api/sysLog/updateById', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'nested exception is org.apache.ibatis.exceptions.PersistenceException: \r\n### Error updating database.  Cause: com.baomidou.mybatisplus.core.exceptions.MybatisPlusException: Prohibition of table update operation\r\n### The error may exist in com/liuds/springbootchus/dao/SysLogOperationDao.java (best guess)\r\n### The error may involve com.liuds.springbootchus.dao.SysLogOperationDao.update\r\n### The error occurred while executing an update\r\n### Cause: com.baomidou.mybatisplus.core.exceptions.MybatisPlusException: Prohibition of table update operation', '500', null, null, '2022-08-01 18:40:38', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554055337579937793', '1', '更新', '/video-api/sysLog/updateById', 'POST', '{\"id\":1552576082094391298,\"creator\":0,\"createDate\":null,\"updater\":0,\"updateDate\":1659350639520,\"operation\":\"测试多数\",\"type\":\"\",\"requestUri\":\"\",\"requestMethod\":\"\",\"requestParams\":\"\",\"requestTime\":0,\"userAgent\":\"\",\"ip\":\"\",\"code\":0,\"remark\":\"\",\"creatorName\":\"\"}', '571', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'nested exception is org.apache.ibatis.exceptions.PersistenceException: \r\n### Error updating database.  Cause: com.baomidou.mybatisplus.core.exceptions.MybatisPlusException: Prohibition of table update operation\r\n### The error may exist in com/liuds/springbootchus/dao/SysLogOperationDao.java (best guess)\r\n### The error may involve com.liuds.springbootchus.dao.SysLogOperationDao.update\r\n### The error occurred while executing an update\r\n### Cause: com.baomidou.mybatisplus.core.exceptions.MybatisPlusException: Prohibition of table update operation', '403', '用户名称', null, '2022-08-01 18:44:00', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554055338808868865', '2', '更新', '/video-api/sysLog/updateById', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'nested exception is org.apache.ibatis.exceptions.PersistenceException: \r\n### Error updating database.  Cause: com.baomidou.mybatisplus.core.exceptions.MybatisPlusException: Prohibition of table update operation\r\n### The error may exist in com/liuds/springbootchus/dao/SysLogOperationDao.java (best guess)\r\n### The error may involve com.liuds.springbootchus.dao.SysLogOperationDao.update\r\n### The error occurred while executing an update\r\n### Cause: com.baomidou.mybatisplus.core.exceptions.MybatisPlusException: Prohibition of table update operation', '500', null, null, '2022-08-01 18:44:00', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554273342398148610', '1', '更新', '/video-api/sysLog/updateById', 'POST', '{\"id\":1552576082094391298,\"creator\":0,\"createDate\":null,\"updater\":0,\"updateDate\":null,\"operation\":\"测试多数\",\"type\":\"\",\"requestUri\":\"\",\"requestMethod\":\"\",\"requestParams\":\"\",\"requestTime\":0,\"userAgent\":\"\",\"ip\":\"\",\"code\":0,\"remark\":\"\",\"creatorName\":\"\"}', '1033', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'nested exception is org.apache.ibatis.exceptions.PersistenceException: \r\n### Error updating database.  Cause: com.baomidou.mybatisplus.core.exceptions.MybatisPlusException: Failed to process, Error SQL: UPDATE sys_log_operation    \n \n WHERE (creator = ? AND code = ? AND updater = ? AND requestTime = ? AND id = ? AND operation = ?)\r\n### The error may exist in com/liuds/springbootchus/dao/SysLogOperationDao.java (best guess)\r\n### The error may involve com.liuds.springbootchus.dao.SysLogOperationDao.update\r\n### The error occurred while executing an update\r\n### Cause: com.baomidou.mybatisplus.core.exceptions.MybatisPlusException: Failed to process, Error SQL: UPDATE sys_log_operation    \n \n WHERE (creator = ? AND code = ? AND updater = ? AND requestTime = ? AND id = ? AND operation = ?)', '403', '用户名称', null, '2022-08-02 09:10:16', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554273343408975874', '2', '更新', '/video-api/sysLog/updateById', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'nested exception is org.apache.ibatis.exceptions.PersistenceException: \r\n### Error updating database.  Cause: com.baomidou.mybatisplus.core.exceptions.MybatisPlusException: Failed to process, Error SQL: UPDATE sys_log_operation    \n \n WHERE (creator = ? AND code = ? AND updater = ? AND requestTime = ? AND id = ? AND operation = ?)\r\n### The error may exist in com/liuds/springbootchus/dao/SysLogOperationDao.java (best guess)\r\n### The error may involve com.liuds.springbootchus.dao.SysLogOperationDao.update\r\n### The error occurred while executing an update\r\n### Cause: com.baomidou.mybatisplus.core.exceptions.MybatisPlusException: Failed to process, Error SQL: UPDATE sys_log_operation    \n \n WHERE (creator = ? AND code = ? AND updater = ? AND requestTime = ? AND id = ? AND operation = ?)', '500', null, null, '2022-08-02 09:10:17', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554273668467535874', '2', '更新', '/video-api/sysLog/updateById', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'JSON parse error: Unexpected character (\',\' (code 44)): expected a value; nested exception is com.fasterxml.jackson.core.JsonParseException: Unexpected character (\',\' (code 44)): expected a value\n at [Source: (PushbackInputStream); line: 12, column: 18]', '500', null, null, '2022-08-02 09:11:34', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554273762017292289', '1', '更新', '/video-api/sysLog/updateById', 'POST', '{\"id\":1552576082094391298,\"creator\":0,\"createDate\":null,\"updater\":0,\"updateDate\":null,\"operation\":\"测试多数\",\"type\":\"\",\"requestUri\":\"\",\"requestMethod\":\"\",\"requestParams\":\"\",\"requestTime\":null,\"userAgent\":\"\",\"ip\":\"\",\"code\":0,\"remark\":\"\",\"creatorName\":\"\"}', '5', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'nested exception is org.apache.ibatis.exceptions.PersistenceException: \r\n### Error updating database.  Cause: com.baomidou.mybatisplus.core.exceptions.MybatisPlusException: Failed to process, Error SQL: UPDATE sys_log_operation    \n \n WHERE (creator = ? AND code = ? AND updater = ? AND id = ? AND operation = ?)\r\n### The error may exist in com/liuds/springbootchus/dao/SysLogOperationDao.java (best guess)\r\n### The error may involve com.liuds.springbootchus.dao.SysLogOperationDao.update\r\n### The error occurred while executing an update\r\n### Cause: com.baomidou.mybatisplus.core.exceptions.MybatisPlusException: Failed to process, Error SQL: UPDATE sys_log_operation    \n \n WHERE (creator = ? AND code = ? AND updater = ? AND id = ? AND operation = ?)', '403', '用户名称', null, '2022-08-02 09:11:57', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554273762994565122', '2', '更新', '/video-api/sysLog/updateById', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'nested exception is org.apache.ibatis.exceptions.PersistenceException: \r\n### Error updating database.  Cause: com.baomidou.mybatisplus.core.exceptions.MybatisPlusException: Failed to process, Error SQL: UPDATE sys_log_operation    \n \n WHERE (creator = ? AND code = ? AND updater = ? AND id = ? AND operation = ?)\r\n### The error may exist in com/liuds/springbootchus/dao/SysLogOperationDao.java (best guess)\r\n### The error may involve com.liuds.springbootchus.dao.SysLogOperationDao.update\r\n### The error occurred while executing an update\r\n### Cause: com.baomidou.mybatisplus.core.exceptions.MybatisPlusException: Failed to process, Error SQL: UPDATE sys_log_operation    \n \n WHERE (creator = ? AND code = ? AND updater = ? AND id = ? AND operation = ?)', '500', null, null, '2022-08-02 09:11:57', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554273930825445377', '1', '更新', '/video-api/sysLog/updateById', 'POST', '{\"id\":1552576082094391298,\"creator\":0,\"createDate\":null,\"updater\":0,\"updateDate\":null,\"operation\":\"测试多数\",\"type\":\"\",\"requestUri\":\"\",\"requestMethod\":\"\",\"requestParams\":\"\",\"requestTime\":null,\"userAgent\":\"\",\"ip\":\"\",\"code\":0,\"remark\":\"\",\"creatorName\":\"\"}', '7', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'nested exception is org.apache.ibatis.exceptions.PersistenceException: \r\n### Error updating database.  Cause: com.baomidou.mybatisplus.core.exceptions.MybatisPlusException: Failed to process, Error SQL: UPDATE sys_log_operation    \n \n WHERE (creator = ? AND code = ? AND updater = ? AND id = ? AND operation = ?)\r\n### The error may exist in com/liuds/springbootchus/dao/SysLogOperationDao.java (best guess)\r\n### The error may involve com.liuds.springbootchus.dao.SysLogOperationDao.update\r\n### The error occurred while executing an update\r\n### Cause: com.baomidou.mybatisplus.core.exceptions.MybatisPlusException: Failed to process, Error SQL: UPDATE sys_log_operation    \n \n WHERE (creator = ? AND code = ? AND updater = ? AND id = ? AND operation = ?)', '403', '用户名称', null, '2022-08-02 09:12:37', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554273931991461890', '2', '更新', '/video-api/sysLog/updateById', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'nested exception is org.apache.ibatis.exceptions.PersistenceException: \r\n### Error updating database.  Cause: com.baomidou.mybatisplus.core.exceptions.MybatisPlusException: Failed to process, Error SQL: UPDATE sys_log_operation    \n \n WHERE (creator = ? AND code = ? AND updater = ? AND id = ? AND operation = ?)\r\n### The error may exist in com/liuds/springbootchus/dao/SysLogOperationDao.java (best guess)\r\n### The error may involve com.liuds.springbootchus.dao.SysLogOperationDao.update\r\n### The error occurred while executing an update\r\n### Cause: com.baomidou.mybatisplus.core.exceptions.MybatisPlusException: Failed to process, Error SQL: UPDATE sys_log_operation    \n \n WHERE (creator = ? AND code = ? AND updater = ? AND id = ? AND operation = ?)', '500', null, null, '2022-08-02 09:12:37', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554274689684123650', '1', '更新', '/video-api/sysLog/updateById', 'POST', '{\"id\":1552576082094391298,\"creator\":0,\"createDate\":null,\"updater\":0,\"updateDate\":1659402936733,\"operation\":\"测试多数\",\"type\":\"\",\"requestUri\":\"\",\"requestMethod\":\"\",\"requestParams\":\"\",\"requestTime\":null,\"userAgent\":\"\",\"ip\":\"\",\"code\":0,\"remark\":\"\",\"creatorName\":\"\"}', '1102', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-02 09:15:38', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554274830176530434', '1', '更新', '/video-api/sysLog/updateById', 'POST', '{\"id\":1552577623677251586,\"creator\":0,\"createDate\":null,\"updater\":0,\"updateDate\":1659402971100,\"operation\":\"测试多数\",\"type\":\"\",\"requestUri\":\"\",\"requestMethod\":\"\",\"requestParams\":\"\",\"requestTime\":null,\"userAgent\":\"\",\"ip\":\"\",\"code\":0,\"remark\":\"\",\"creatorName\":\"\"}', '90', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-02 09:16:11', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554275141364523009', '1', '更新', '/video-api/sysLog/updateById', 'POST', '{\"id\":1552577623677251586,\"creator\":0,\"createDate\":null,\"updater\":0,\"updateDate\":1659403044395,\"operation\":\"测试多数\",\"type\":\"\",\"requestUri\":\"\",\"requestMethod\":\"\",\"requestParams\":\"\",\"requestTime\":null,\"userAgent\":\"\",\"ip\":\"\",\"code\":0,\"remark\":\"\",\"creatorName\":\"\"}', '951', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'nested exception is org.apache.ibatis.exceptions.PersistenceException: \r\n### Error updating database.  Cause: com.baomidou.mybatisplus.core.exceptions.MybatisPlusException: Prohibition of table update operation\r\n### The error may exist in com/liuds/springbootchus/dao/SysLogOperationDao.java (best guess)\r\n### The error may involve com.liuds.springbootchus.dao.SysLogOperationDao.update\r\n### The error occurred while executing an update\r\n### Cause: com.baomidou.mybatisplus.core.exceptions.MybatisPlusException: Prohibition of table update operation', '403', '用户名称', null, '2022-08-02 09:17:25', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554275142534733826', '2', '更新', '/video-api/sysLog/updateById', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'nested exception is org.apache.ibatis.exceptions.PersistenceException: \r\n### Error updating database.  Cause: com.baomidou.mybatisplus.core.exceptions.MybatisPlusException: Prohibition of table update operation\r\n### The error may exist in com/liuds/springbootchus/dao/SysLogOperationDao.java (best guess)\r\n### The error may involve com.liuds.springbootchus.dao.SysLogOperationDao.update\r\n### The error occurred while executing an update\r\n### Cause: com.baomidou.mybatisplus.core.exceptions.MybatisPlusException: Prohibition of table update operation', '500', null, null, '2022-08-02 09:17:26', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554276570829443074', '2', '更新', '/video-api/sysLog/updateById', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'JSON parse error: Unexpected character (\',\' (code 44)): expected a value; nested exception is com.fasterxml.jackson.core.JsonParseException: Unexpected character (\',\' (code 44)): expected a value\n at [Source: (PushbackInputStream); line: 6, column: 9]', '500', null, null, '2022-08-02 09:23:06', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554276696025223170', '1', '更新', '/video-api/sysLog/updateById', 'POST', '{\"id\":null,\"creator\":0,\"createDate\":null,\"updater\":0,\"updateDate\":1659403415900,\"operation\":\"测试多数\",\"type\":\"\",\"requestUri\":\"\",\"requestMethod\":\"\",\"requestParams\":\"\",\"requestTime\":null,\"userAgent\":\"\",\"ip\":\"\",\"code\":0,\"remark\":\"\",\"creatorName\":\"\"}', '187', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-02 09:23:36', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554279698366726146', '1', '更新', '/video-api/sysLog/updateById', 'POST', '{\"id\":1552577623677251586,\"creator\":0,\"createDate\":null,\"updater\":0,\"updateDate\":1659404131552,\"operation\":\"测试多数\",\"type\":\"\",\"requestUri\":\"\",\"requestMethod\":\"\",\"requestParams\":\"\",\"requestTime\":null,\"userAgent\":\"\",\"ip\":\"\",\"code\":0,\"remark\":\"\",\"creatorName\":\"\"}', '967', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-02 09:35:32', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554291443432984578', '1', '更新', '/video-api/sysLog/updateById', 'POST', '{\"id\":1552581814592225281,\"creator\":0,\"createDate\":null,\"updater\":0,\"updateDate\":1659406931782,\"operation\":\"测试多数\",\"type\":\"\",\"requestUri\":\"\",\"requestMethod\":\"\",\"requestParams\":\"\",\"requestTime\":null,\"userAgent\":\"\",\"ip\":\"\",\"code\":0,\"remark\":\"\",\"creatorName\":\"\"}', '1255', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-02 10:22:12', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554292445330542593', '1', '更新', '/video-api/sysLog/updateById', 'POST', '{\"id\":1552830265318035458,\"creator\":0,\"createDate\":null,\"updater\":0,\"updateDate\":1659407170674,\"operation\":\"测试多数\",\"type\":\"\",\"requestUri\":\"\",\"requestMethod\":\"\",\"requestParams\":\"\",\"requestTime\":null,\"userAgent\":\"\",\"ip\":\"\",\"code\":0,\"remark\":\"\",\"creatorName\":\"\"}', '947', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-02 10:26:11', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554292754878652417', '1', '更新', '/video-api/sysLog/updateById', 'POST', '{\"id\":1552830364270055426,\"creator\":0,\"createDate\":null,\"updater\":0,\"updateDate\":1659407244427,\"operation\":\"测试多数\",\"type\":\"\",\"requestUri\":\"\",\"requestMethod\":\"\",\"requestParams\":\"\",\"requestTime\":null,\"userAgent\":\"\",\"ip\":\"\",\"code\":0,\"remark\":\"\",\"creatorName\":\"\"}', '937', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-02 10:27:25', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554315267461353473', '1', '更新', '/video-api/sysLog/updateById', 'POST', '{\"id\":1552830532025438210,\"creator\":0,\"createDate\":null,\"updater\":0,\"updateDate\":1659412611812,\"operation\":\"测试多数\",\"type\":\"\",\"requestUri\":\"\",\"requestMethod\":\"\",\"requestParams\":\"\",\"requestTime\":null,\"userAgent\":\"\",\"ip\":\"\",\"code\":0,\"remark\":\"\",\"creatorName\":\"\"}', '1006', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-02 11:56:52', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554315531366961154', '1', '更新', '/video-api/sysLog/updateById', 'POST', '{\"id\":1552830532025438210,\"creator\":0,\"createDate\":null,\"updater\":0,\"updateDate\":1659412674965,\"operation\":\"\",\"type\":\"\",\"requestUri\":\"\",\"requestMethod\":\"\",\"requestParams\":\"\",\"requestTime\":null,\"userAgent\":\"\",\"ip\":\"\",\"code\":0,\"remark\":\"\",\"creatorName\":\"\"}', '663', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-02 11:57:55', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554344547075530754', '1', '更新', '/video-api/sysLog/updateById', 'POST', '{\"id\":1552830532025438210,\"creator\":0,\"createDate\":null,\"updater\":0,\"updateDate\":1659419592451,\"operation\":\"\",\"type\":\"\",\"requestUri\":\"\",\"requestMethod\":\"\",\"requestParams\":\"\",\"requestTime\":null,\"userAgent\":\"\",\"ip\":\"\",\"code\":0,\"remark\":\"\",\"creatorName\":\"\"}', '1416', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-02 13:53:13', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554354113343410177', '1', '更新', '/video-api/sysLog/updateById', 'POST', '{\"id\":1552831923594747905,\"creator\":0,\"createDate\":null,\"updater\":0,\"updateDate\":1659421873327,\"operation\":\"\",\"type\":\"\",\"requestUri\":\"\",\"requestMethod\":\"\",\"requestParams\":\"\",\"requestTime\":null,\"userAgent\":\"\",\"ip\":\"\",\"code\":0,\"remark\":\"\",\"creatorName\":\"\"}', '1045', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-02 14:31:14', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554354268411023361', '1', '更新', '/video-api/sysLog/updateById', 'POST', '{\"id\":1552831923594747905,\"creator\":0,\"createDate\":null,\"updater\":0,\"updateDate\":1659421910609,\"operation\":\"\",\"type\":\"\",\"requestUri\":\"\",\"requestMethod\":\"\",\"requestParams\":\"\",\"requestTime\":null,\"userAgent\":\"\",\"ip\":\"\",\"code\":0,\"remark\":\"\",\"creatorName\":\"\"}', '153', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-02 14:31:51', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554354303911612418', '2', '更新', '/video-api/sysLog/updateById', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'JSON parse error: Numeric value (15528319235947479051) out of range of long (-9223372036854775808 - 9223372036854775807); nested exception is com.fasterxml.jackson.databind.JsonMappingException: Numeric value (15528319235947479051) out of range of long (-9223372036854775808 - 9223372036854775807)\n at [Source: (PushbackInputStream); line: 6, column: 28] (through reference chain: com.liuds.springbootchus.entity.SysLogOperationEntity[\"id\"])', '500', null, null, '2022-08-02 14:31:59', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554354313864695809', '2', '更新', '/video-api/sysLog/updateById', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'JSON parse error: Numeric value (15528319235947479051) out of range of long (-9223372036854775808 - 9223372036854775807); nested exception is com.fasterxml.jackson.databind.JsonMappingException: Numeric value (15528319235947479051) out of range of long (-9223372036854775808 - 9223372036854775807)\n at [Source: (PushbackInputStream); line: 6, column: 28] (through reference chain: com.liuds.springbootchus.entity.SysLogOperationEntity[\"id\"])', '500', null, null, '2022-08-02 14:32:02', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554354366234775553', '2', '更新', '/video-api/sysLog/updateById', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'JSON parse error: Numeric value (15528319235947479051) out of range of long (-9223372036854775808 - 9223372036854775807); nested exception is com.fasterxml.jackson.databind.JsonMappingException: Numeric value (15528319235947479051) out of range of long (-9223372036854775808 - 9223372036854775807)\n at [Source: (PushbackInputStream); line: 6, column: 28] (through reference chain: com.liuds.springbootchus.entity.SysLogOperationEntity[\"id\"])', '500', null, null, '2022-08-02 14:32:14', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554354747027247106', '1', '更新', '/video-api/sysLog/updateById', 'POST', '{\"id\":1552831923594747906,\"creator\":0,\"createDate\":null,\"updater\":0,\"updateDate\":1659422024725,\"operation\":\"\",\"type\":\"\",\"requestUri\":\"\",\"requestMethod\":\"\",\"requestParams\":\"\",\"requestTime\":null,\"userAgent\":\"\",\"ip\":\"\",\"code\":0,\"remark\":\"\",\"creatorName\":\"\"}', '806', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-02 14:33:45', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554354817739018242', '1', '更新', '/video-api/sysLog/updateById', 'POST', '{\"id\":15528319,\"creator\":0,\"createDate\":null,\"updater\":0,\"updateDate\":1659422041590,\"operation\":\"\",\"type\":\"\",\"requestUri\":\"\",\"requestMethod\":\"\",\"requestParams\":\"\",\"requestTime\":null,\"userAgent\":\"\",\"ip\":\"\",\"code\":0,\"remark\":\"\",\"creatorName\":\"\"}', '140', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-02 14:34:02', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554355693404815361', '1', '更新', '/video-api/sysLog/updateById', 'POST', '{\"id\":1552831924823678978,\"creator\":0,\"createDate\":null,\"updater\":0,\"updateDate\":1659422250099,\"operation\":\"\",\"type\":\"\",\"requestUri\":\"\",\"requestMethod\":\"gggg\",\"requestParams\":\"\",\"requestTime\":null,\"userAgent\":\"\",\"ip\":\"\",\"code\":0,\"remark\":\"\",\"creatorName\":\"\"}', '1136', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-02 14:37:30', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554358779301191682', '2', '更新', '/video-api/sysLog/updateById', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'JSON parse error: Unexpected character (\',\' (code 44)): expected a value; nested exception is com.fasterxml.jackson.core.JsonParseException: Unexpected character (\',\' (code 44)): expected a value\n at [Source: (PushbackInputStream); line: 6, column: 9]', '500', null, null, '2022-08-02 14:49:46', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554358880081928194', '1', '更新', '/video-api/sysLog/updateById', 'POST', '{\"id\":null,\"creator\":0,\"createDate\":null,\"updater\":0,\"updateDate\":1659423009985,\"operation\":\"短信列表\",\"type\":\"\",\"requestUri\":\"\",\"requestMethod\":\"gggg\",\"requestParams\":\"\",\"requestTime\":null,\"userAgent\":\"\",\"ip\":\"\",\"code\":0,\"remark\":\"\",\"creatorName\":\"\"}', '329', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-02 14:50:10', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554657424701452289', '1', '单表分页', '/video-api/sysLog/pageOne', 'POST', '{\"size\":5,\"current\":0,\"operation\":\"获取案件短信列表\",\"requestMethod\":\"GET\"}', '373', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: Unknown column \'requestMethod\' in \'where clause\'\r\n### The error may exist in com/liuds/springbootchus/dao/SysLogOperationDao.java (best guess)\r\n### The error may involve defaultParameterMap\r\n### The error occurred while setting parameters\r\n### SQL: SELECT COUNT(*) AS total FROM sys_log_operation WHERE (requestMethod = ? AND operation = ?)\r\n### Cause: java.sql.SQLSyntaxErrorException: Unknown column \'requestMethod\' in \'where clause\'\n; bad SQL grammar []; nested exception is java.sql.SQLSyntaxErrorException: Unknown column \'requestMethod\' in \'where clause\'', '403', '用户名称', null, '2022-08-03 10:36:29', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554657768382722049', '1', '单表分页', '/video-api/sysLog/pageOne', 'POST', '{\"size\":5,\"current\":0,\"operation\":\"获取案件短信列表\",\"requestMethod\":null}', '848', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-03 10:37:51', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554670276468310018', '2', '更新', '/video-api/sysLog/excelTemplate', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'E:\\hh\\专项支出用款申请书_map.xls (另一个程序正在使用此文件，进程无法访问。)', '500', null, null, '2022-08-03 11:27:33', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554671937341390850', '2', null, '/video-api/sysLog/excelTemplate', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'E:\\hh\\专项支出用款申请书_map.xls (另一个程序正在使用此文件，进程无法访问。)', '500', null, null, '2022-08-03 11:34:09', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554714023621103618', '2', null, '/video-api/sysLog/exportExcel', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'E:\\hh\\333.xlsx (另一个程序正在使用此文件，进程无法访问。)【错误类型】:业务异常403', '403', null, null, '2022-08-03 14:21:23', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554775993628037122', '2', null, '/video-api/v1/file/normalUpload', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'com.citycloud.ccuap.seaweedfs.SeaweedFSHandle', '500', null, null, '2022-08-03 18:27:38', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554776289745899521', '2', null, '/video-api/v1/file/normalUpload', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'com.citycloud.ccuap.seaweedfs.SeaweedFSHandle', '500', null, null, '2022-08-03 18:28:48', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554777284022419457', '2', null, '/video-api/v1/file/normalUpload', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'com.citycloud.ccuap.seaweedfs.SeaweedFSHandle', '500', null, null, '2022-08-03 18:32:46', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554777689200635906', '2', null, '/video-api/v1/file/normalUpload', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'com.citycloud.ccuap.seaweedfs.SeaweedFSHandle', '500', null, null, '2022-08-03 18:34:22', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554778015135711233', '2', null, '/video-api/v1/file/normalUpload', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'com.citycloud.ccuap.seaweedfs.SeaweedFSHandle', '500', null, null, '2022-08-03 18:35:40', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554778823394893825', '2', null, '/video-api/v1/file/normalUpload', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'com.citycloud.ccuap.seaweedfs.SeaweedFSHandle', '500', null, null, '2022-08-03 18:38:53', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554779986508935170', '2', null, '/video-api/v1/file/normalUpload', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'com.citycloud.ccuap.seaweedfs.SeaweedFSHandle', '500', null, null, '2022-08-03 18:43:30', null, null);
INSERT INTO `sys_log_operation` VALUES ('1554782984727433218', '2', null, '/video-api/v1/file/normalUpload', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'com.citycloud.ccuap.seaweedfs.SeaweedFSHandle', '500', null, null, '2022-08-03 18:55:25', null, null);
INSERT INTO `sys_log_operation` VALUES ('1555080726704054273', '1', '数据导入', '/video-api/v1/sysLog/importExcelMidea', 'POST', null, '1463', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'There is no setter for property named \'PO\' in \'class com.liuds.springbootchus.entity.SysExEntity\'', '403', '用户名称', null, '2022-08-04 14:38:32', null, null);
INSERT INTO `sys_log_operation` VALUES ('1555080728193032193', '2', null, '/video-api/v1/sysLog/importExcelMidea', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'There is no setter for property named \'PO\' in \'class com.liuds.springbootchus.entity.SysExEntity\'【错误类型】:业务异常403', '403', null, null, '2022-08-04 14:38:32', null, null);
INSERT INTO `sys_log_operation` VALUES ('1555081393313177602', '1', '数据导入', '/video-api/v1/sysLog/importExcelMidea', 'POST', null, '25', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'There is no setter for property named \'PO\' in \'class com.liuds.springbootchus.entity.SysExEntity\'', '403', '用户名称', null, '2022-08-04 14:41:11', null, null);
INSERT INTO `sys_log_operation` VALUES ('1555081394026209281', '2', null, '/video-api/v1/sysLog/importExcelMidea', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'There is no setter for property named \'PO\' in \'class com.liuds.springbootchus.entity.SysExEntity\'【错误类型】:业务异常403', '403', null, null, '2022-08-04 14:41:11', null, null);
INSERT INTO `sys_log_operation` VALUES ('1555082260850470913', '1', '数据导入', '/video-api/v1/sysLog/importExcelMidea', 'POST', null, '366', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'There is no setter for property named \'PI\' in \'class com.liuds.springbootchus.entity.SysExEntity\'', '403', '用户名称', null, '2022-08-04 14:44:38', null, null);
INSERT INTO `sys_log_operation` VALUES ('1555082262184259586', '2', null, '/video-api/v1/sysLog/importExcelMidea', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'There is no setter for property named \'PI\' in \'class com.liuds.springbootchus.entity.SysExEntity\'【错误类型】:业务异常403', '403', null, null, '2022-08-04 14:44:38', null, null);
INSERT INTO `sys_log_operation` VALUES ('1555083402552598529', '1', '数据导入', '/video-api/v1/sysLog/importExcelMidea', 'POST', null, '11864', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-04 14:49:10', null, null);
INSERT INTO `sys_log_operation` VALUES ('1555091182269292545', '1', '数据导入', '/video-api/v1/sysLog/importExcel', 'POST', null, '2990', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '\r\n### Error updating database.  Cause: java.sql.SQLException: Field \'code\' doesn\'t have a default value\r\n### The error may exist in com/liuds/springbootchus/dao/SysLogOperationDao.java (best guess)\r\n### The error may involve com.liuds.springbootchus.dao.SysLogOperationDao.insert-Inline\r\n### The error occurred while setting parameters\r\n### SQL: INSERT INTO sys_log_operation  ( id, operation, type, request_uri, request_method,        creator, create_date )  VALUES  ( ?, ?, ?, ?, ?,        ?, ? )\r\n### Cause: java.sql.SQLException: Field \'code\' doesn\'t have a default value\n; Field \'code\' doesn\'t have a default value; nested exception is java.sql.SQLException: Field \'code\' doesn\'t have a default value', '403', '用户名称', null, '2022-08-04 15:20:05', null, null);
INSERT INTO `sys_log_operation` VALUES ('1555091183699550209', '2', null, '/video-api/v1/sysLog/importExcel', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '\r\n### Error updating database.  Cause: java.sql.SQLException: Field \'code\' doesn\'t have a default value\r\n### The error may exist in com/liuds/springbootchus/dao/SysLogOperationDao.java (best guess)\r\n### The error may involve com.liuds.springbootchus.dao.SysLogOperationDao.insert-Inline\r\n### The error occurred while setting parameters\r\n### SQL: INSERT INTO sys_log_operation  ( id, operation, type, request_uri, request_method,        creator, create_date )  VALUES  ( ?, ?, ?, ?, ?,        ?, ? )\r\n### Cause: java.sql.SQLException: Field \'code\' doesn\'t have a default value\n; Field \'code\' doesn\'t have a default value; nested exception is java.sql.SQLException: Field \'code\' doesn\'t have a default value', '500', null, null, '2022-08-04 15:20:05', null, null);
INSERT INTO `sys_log_operation` VALUES ('1555099619808088066', '2', null, '/video-api/v1/sysLog/excelTemplateExportMidea', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'com.liuds.springbootchus.entity.SysLogOperationEntity cannot be cast to com.liuds.springbootchus.entity.SysExEntity', '500', null, null, '2022-08-04 15:53:36', null, null);
INSERT INTO `sys_log_operation` VALUES ('1555099646739714050', '2', null, '/video-api/v1/sysLog/excelTemplateExportMidea', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'com.liuds.springbootchus.entity.SysLogOperationEntity cannot be cast to com.liuds.springbootchus.entity.SysExEntity', '500', null, null, '2022-08-04 15:53:43', null, null);
INSERT INTO `sys_log_operation` VALUES ('1555099933940391937', '2', null, '/video-api/v1/sysLog/excelTemplateExportMidea', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'E:\\hh\\midea\\PI 30003009-136 79T391.xls (系统找不到指定的路径。)【错误类型】:业务异常403', '403', null, null, '2022-08-04 15:54:51', null, null);
INSERT INTO `sys_log_operation` VALUES ('1555113936339124226', '2', null, '/video-api/v1/sysLog/excelTemplateExportMidea', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: Unknown column \'total\' in \'field list\'\r\n### The error may exist in com/liuds/springbootchus/dao/SysExDao.java (best guess)\r\n### The error may involve defaultParameterMap\r\n### The error occurred while setting parameters\r\n### SQL: SELECT  id,po,pi,midea,model,trane,price,quantity,amount,date,total  FROM sys_ex\r\n### Cause: java.sql.SQLSyntaxErrorException: Unknown column \'total\' in \'field list\'\n; bad SQL grammar []; nested exception is java.sql.SQLSyntaxErrorException: Unknown column \'total\' in \'field list\'', '500', null, null, '2022-08-04 16:50:30', null, null);
INSERT INTO `sys_log_operation` VALUES ('1555122444824522754', '2', null, '/video-api/v1/midea/importExcelMideaT', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'java.lang.RuntimeException: 获取公式类型的单元格失败【错误类型】:业务异常403', '403', null, null, '2022-08-04 17:24:18', null, null);
INSERT INTO `sys_log_operation` VALUES ('1555393104591319042', '2', null, '/video-api/v1/midea/delete', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '127.0.0.1', 'nested exception is org.apache.ibatis.exceptions.PersistenceException: \r\n### Error updating database.  Cause: com.baomidou.mybatisplus.core.exceptions.MybatisPlusException: Prohibition of full table deletion\r\n### The error may exist in com/liuds/springbootchus/dao/SysExDao.java (best guess)\r\n### The error may involve com.liuds.springbootchus.dao.SysExDao.delete\r\n### The error occurred while executing an update\r\n### Cause: com.baomidou.mybatisplus.core.exceptions.MybatisPlusException: Prohibition of full table deletion', '500', null, null, '2022-08-05 11:19:49', null, null);
INSERT INTO `sys_log_operation` VALUES ('1555398066830438401', '2', null, '/video-api/v1/midea/importExcelMideaT', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '127.0.0.1', 'nested exception is org.apache.ibatis.exceptions.PersistenceException: \r\n### Error updating database.  Cause: com.baomidou.mybatisplus.core.exceptions.MybatisPlusException: Failed to process, Error SQL: DELETE FROM sys_ex WHERE id IN ( )\r\n### The error may exist in com/liuds/springbootchus/dao/SysExDao.java (best guess)\r\n### The error may involve com.liuds.springbootchus.dao.SysExDao.deleteBatchIds\r\n### The error occurred while executing an update\r\n### Cause: com.baomidou.mybatisplus.core.exceptions.MybatisPlusException: Failed to process, Error SQL: DELETE FROM sys_ex WHERE id IN ( )', '500', null, null, '2022-08-05 11:39:32', null, null);
INSERT INTO `sys_log_operation` VALUES ('1555398484759179266', '2', null, '/video-api/v1/midea/importExcelMideaT', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'nested exception is org.apache.ibatis.exceptions.PersistenceException: \r\n### Error updating database.  Cause: com.baomidou.mybatisplus.core.exceptions.MybatisPlusException: Failed to process, Error SQL: DELETE FROM sys_ex WHERE id IN ( )\r\n### The error may exist in com/liuds/springbootchus/dao/SysExDao.java (best guess)\r\n### The error may involve com.liuds.springbootchus.dao.SysExDao.deleteBatchIds\r\n### The error occurred while executing an update\r\n### Cause: com.baomidou.mybatisplus.core.exceptions.MybatisPlusException: Failed to process, Error SQL: DELETE FROM sys_ex WHERE id IN ( )', '500', null, null, '2022-08-05 11:41:11', null, null);
INSERT INTO `sys_log_operation` VALUES ('1555461034058305537', '2', null, '/video-api/v1/midea/importExcelMideaT', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '创建文件夹失败，请联系管理员【错误类型】:业务异常403', '403', null, null, '2022-08-05 15:49:44', null, null);
INSERT INTO `sys_log_operation` VALUES ('1555467884023635969', '2', null, '/dum-building/v1/midea/importExcelMideaT', 'POST', '{\"accessToken\":\"9e726276-5fe1-4921-bcff-d26c4b87b1a0\"}', null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '58.248.225.36', null, '500', null, null, '2022-08-05 16:16:57', null, null);
INSERT INTO `sys_log_operation` VALUES ('1556476143291457537', '2', null, '/chushi/v1/file/normalUpload', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'com.citycloud.ccuap.seaweedfs.SeaweedFSHandle', '500', null, null, '2022-08-08 11:03:25', null, null);
INSERT INTO `sys_log_operation` VALUES ('1556478542219427842', '2', null, '/chushi/v1/file/normalUpload', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'com.citycloud.ccuap.seaweedfs.SeaweedFSHandle', '500', null, null, '2022-08-08 11:12:57', null, null);
INSERT INTO `sys_log_operation` VALUES ('1556478591385059330', '2', null, '/chushi/v1/file/normalUpload', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'com.citycloud.ccuap.seaweedfs.SeaweedFSHandle', '500', null, null, '2022-08-08 11:13:09', null, null);
INSERT INTO `sys_log_operation` VALUES ('1556479238498951170', '2', null, '/chushi/v1/file/normalUpload', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', null, '500', null, null, '2022-08-08 11:15:43', null, null);
INSERT INTO `sys_log_operation` VALUES ('1556480013451251714', '2', null, '/chushi/v1/file/normalUpload', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'Could not write JSON: getInputStream() has already been called for this request; nested exception is com.fasterxml.jackson.databind.JsonMappingException: getInputStream() has already been called for this request (through reference chain: com.liuds.springbootchus.config.Result[\"data\"]->org.springframework.web.multipart.support.StandardMultipartHttpServletRequest[\"request\"]->org.apache.catalina.connector.RequestFacade[\"reader\"])', '500', null, null, '2022-08-08 11:18:48', null, null);
INSERT INTO `sys_log_operation` VALUES ('1556481637393371137', '2', null, '/chushi/v1/file/normalUpload', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'Type definition error: [simple type, class java.util.logging.ErrorManager]; nested exception is com.fasterxml.jackson.databind.exc.InvalidDefinitionException: No serializer found for class java.util.logging.ErrorManager and no properties discovered to create BeanSerializer (to avoid exception, disable SerializationFeature.FAIL_ON_EMPTY_BEANS) (through reference chain: com.liuds.springbootchus.config.Result[\"data\"]->org.springframework.web.multipart.support.StandardMultipartHttpServletRequest[\"request\"]->org.apache.catalina.connector.RequestFacade[\"servletContext\"]->org.apache.catalina.core.ApplicationContextFacade[\"classLoader\"]->org.springframework.boot.web.embedded.tomcat.TomcatEmbeddedWebappClassLoader[\"resources\"]->org.apache.catalina.webresources.StandardRoot[\"context\"]->org.springframework.boot.web.embedded.tomcat.TomcatEmbeddedContext[\"logger\"]->org.apache.juli.logging.DirectJDKLog[\"logger\"]->java.util.logging.Logger[\"parent\"]->java.util.logging.Logger[\"parent\"]->java.util.logging.Logger[\"parent\"]->java.util.logging.Logger[\"parent\"]->java.util.logging.LogManager$RootLogger[\"handlers\"]->org.slf4j.bridge.SLF4JBridgeHandler[0]->org.slf4j.bridge.SLF4JBridgeHandler[\"errorManager\"])', '500', null, null, '2022-08-08 11:25:15', null, null);
INSERT INTO `sys_log_operation` VALUES ('1556813699031760897', '2', null, '/chushi/v1/sysLog/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '127.0.0.1', '用户操作错误', '400', null, null, '2022-08-09 09:24:45', null, null);
INSERT INTO `sys_log_operation` VALUES ('1556813857807138817', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"2122\",\"requestMethod\":\"333\"}', '229', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '127.0.0.1', '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: Unknown column \'requestMethod\' in \'where clause\'\r\n### The error may exist in com/liuds/springbootchus/dao/SysLogOperationDao.java (best guess)\r\n### The error may involve defaultParameterMap\r\n### The error occurred while setting parameters\r\n### SQL: SELECT  id,operation,type,request_uri,request_method,request_params,request_time,user_agent,ip,code,remark,creator_name,creator,create_date,updater,update_date  FROM sys_log_operation     WHERE (requestMethod = ? AND operation = ?) ORDER BY type DESC\r\n### Cause: java.sql.SQLSyntaxErrorException: Unknown column \'requestMethod\' in \'where clause\'\n; bad SQL grammar []; nested exception is java.sql.SQLSyntaxErrorException: Unknown column \'requestMethod\' in \'where clause\'', '403', '用户名称', null, '2022-08-09 09:25:23', null, null);
INSERT INTO `sys_log_operation` VALUES ('1556813858977349634', '2', null, '/chushi/v1/sysLog/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '127.0.0.1', '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: Unknown column \'requestMethod\' in \'where clause\'\r\n### The error may exist in com/liuds/springbootchus/dao/SysLogOperationDao.java (best guess)\r\n### The error may involve defaultParameterMap\r\n### The error occurred while setting parameters\r\n### SQL: SELECT  id,operation,type,request_uri,request_method,request_params,request_time,user_agent,ip,code,remark,creator_name,creator,create_date,updater,update_date  FROM sys_log_operation     WHERE (requestMethod = ? AND operation = ?) ORDER BY type DESC\r\n### Cause: java.sql.SQLSyntaxErrorException: Unknown column \'requestMethod\' in \'where clause\'\n; bad SQL grammar []; nested exception is java.sql.SQLSyntaxErrorException: Unknown column \'requestMethod\' in \'where clause\'', '500', null, null, '2022-08-09 09:25:23', null, null);
INSERT INTO `sys_log_operation` VALUES ('1556814411040055297', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"2122\",\"requestMethod\":\"333\"}', '840', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: Unknown column \'requestMethod\' in \'where clause\'\r\n### The error may exist in com/liuds/springbootchus/dao/SysLogOperationDao.java (best guess)\r\n### The error may involve defaultParameterMap\r\n### The error occurred while setting parameters\r\n### SQL: SELECT  id,operation,type,request_uri,request_method,request_params,request_time,user_agent,ip,code,remark,creator_name,creator,create_date,updater,update_date  FROM sys_log_operation     WHERE (requestMethod = ? AND operation = ?) ORDER BY type DESC\r\n### Cause: java.sql.SQLSyntaxErrorException: Unknown column \'requestMethod\' in \'where clause\'\n; bad SQL grammar []; nested exception is java.sql.SQLSyntaxErrorException: Unknown column \'requestMethod\' in \'where clause\'', '403', '用户名称', null, '2022-08-09 09:27:34', null, null);
INSERT INTO `sys_log_operation` VALUES ('1556814412268986369', '2', null, '/chushi/v1/sysLog/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: Unknown column \'requestMethod\' in \'where clause\'\r\n### The error may exist in com/liuds/springbootchus/dao/SysLogOperationDao.java (best guess)\r\n### The error may involve defaultParameterMap\r\n### The error occurred while setting parameters\r\n### SQL: SELECT  id,operation,type,request_uri,request_method,request_params,request_time,user_agent,ip,code,remark,creator_name,creator,create_date,updater,update_date  FROM sys_log_operation     WHERE (requestMethod = ? AND operation = ?) ORDER BY type DESC\r\n### Cause: java.sql.SQLSyntaxErrorException: Unknown column \'requestMethod\' in \'where clause\'\n; bad SQL grammar []; nested exception is java.sql.SQLSyntaxErrorException: Unknown column \'requestMethod\' in \'where clause\'', '500', null, null, '2022-08-09 09:27:35', null, null);
INSERT INTO `sys_log_operation` VALUES ('1556814623083094017', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"2122\",\"requestMethod\":\"\"}', '148', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-09 09:28:25', null, null);
INSERT INTO `sys_log_operation` VALUES ('1556814650731945986', '2', null, '/chushi/v1/sysLog/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '用户操作错误', '400', null, null, '2022-08-09 09:28:32', null, null);
INSERT INTO `sys_log_operation` VALUES ('1556814710614024193', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"列表\",\"requestMethod\":\"\"}', '52', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-09 09:28:46', null, null);
INSERT INTO `sys_log_operation` VALUES ('1556815625916014593', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"列表111\",\"requestMethod\":\"\"}', '742', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-09 09:32:24', null, null);
INSERT INTO `sys_log_operation` VALUES ('1556815642198302722', '2', null, '/chushi/v1/sysLog/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '用户操作错误', '400', null, null, '2022-08-09 09:32:28', null, null);
INSERT INTO `sys_log_operation` VALUES ('1557641570637852674', '1', 'redisson锁测试', '/chushi/v1/sysLog/redisson', 'GET', '\"333\"', '10130', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-11 16:14:25', null, null);
INSERT INTO `sys_log_operation` VALUES ('1557641647624302594', '1', 'redisson锁测试', '/chushi/v1/sysLog/redisson', 'GET', '\"333\"', '10103', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-11 16:14:43', null, null);
INSERT INTO `sys_log_operation` VALUES ('1557641766323105794', '1', 'redisson锁测试', '/chushi/v1/sysLog/redisson', 'GET', '\"333\"', '10130', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-11 16:15:11', null, null);
INSERT INTO `sys_log_operation` VALUES ('1557641809763512322', '1', 'redisson锁测试', '/chushi/v1/sysLog/redisson', 'GET', '\"333\"', '10070', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-11 16:15:22', null, null);
INSERT INTO `sys_log_operation` VALUES ('1557641903892082690', '1', 'redisson锁测试', '/chushi/v1/sysLog/redisson', 'GET', '\"333\"', '10111', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-11 16:15:44', null, null);
INSERT INTO `sys_log_operation` VALUES ('1557641911798345730', '1', 'redisson锁测试', '/chushi/v1/sysLog/redisson', 'GET', '\"11\"', '10066', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-11 16:15:46', null, null);
INSERT INTO `sys_log_operation` VALUES ('1557653371521888257', '1', 'redisson锁测试', '/chushi/v1/sysLog/redissonT', 'GET', '\"333\"', '77', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '/ by zero', '403', '用户名称', null, '2022-08-11 17:01:18', null, null);
INSERT INTO `sys_log_operation` VALUES ('1557653372843094017', '2', null, '/chushi/v1/sysLog/redissonT', 'GET', '{\"lockId\":\"333\"}', null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '/ by zero', '500', null, null, '2022-08-11 17:01:19', null, null);
INSERT INTO `sys_log_operation` VALUES ('1557653514446991361', '1', 'redisson锁测试', '/chushi/v1/sysLog/redisson', 'GET', '\"333\"', '10069', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-11 17:01:52', null, null);
INSERT INTO `sys_log_operation` VALUES ('1557653573980942338', '1', 'redisson锁测试', '/chushi/v1/sysLog/redissonT', 'GET', '\"333\"', '33', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '/ by zero', '403', '用户名称', null, '2022-08-11 17:02:06', null, null);
INSERT INTO `sys_log_operation` VALUES ('1557653574710751234', '2', null, '/chushi/v1/sysLog/redissonT', 'GET', '{\"lockId\":\"333\"}', null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '/ by zero', '500', null, null, '2022-08-11 17:02:07', null, null);
INSERT INTO `sys_log_operation` VALUES ('1557653679132143618', '1', 'redisson锁测试', '/chushi/v1/sysLog/redisson', 'GET', '\"333\"', '17660', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-11 17:02:32', null, null);
INSERT INTO `sys_log_operation` VALUES ('1557654336027250690', '2', null, '/chushi/v1/sysLog/redissonT', 'GET', '{\"lockId\":\"333\"}', null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '/ by zero', '500', null, null, '2022-08-11 17:05:08', null, null);
INSERT INTO `sys_log_operation` VALUES ('1557657371713474561', '2', null, '/chushi/v1/sysLog/redissonT', 'GET', '{\"lockId\":\"333\"}', null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '/ by zero【错误类型】:业务异常403', '403', null, null, '2022-08-11 17:17:12', null, null);
INSERT INTO `sys_log_operation` VALUES ('1557936050888818690', '2', 'redisson锁测试', '/chushi/v1/sysLog/redisson', 'GET', '\"333\"', '10145', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-12 11:44:34', null, null);
INSERT INTO `sys_log_operation` VALUES ('1557936052335853569', '1', 'redisson锁测试', '/chushi/v1/sysLog/redisson', 'GET', '\"333\"', '11710', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-12 11:44:35', null, null);
INSERT INTO `sys_log_operation` VALUES ('1557972597063340034', '3', 'redisson锁测试', '/chushi/v1/sysLog/redisson', 'GET', '\"333\"', '10177', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-12 14:09:48', null, null);
INSERT INTO `sys_log_operation` VALUES ('1557972598933999618', '1', 'redisson锁测试', '/chushi/v1/sysLog/redisson', 'GET', '\"333\"', '11692', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-12 14:09:48', null, null);
INSERT INTO `sys_log_operation` VALUES ('1557973550122401794', '3', '下载模板', '/chushi/v1/sysLog/excelTemplate', 'POST', '{\"size\":0,\"current\":0,\"operation\":\"\",\"requestMethod\":\"\"}', '2707', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-12 14:13:35', null, null);
INSERT INTO `sys_log_operation` VALUES ('1557973551338749954', '1', '下载模板', '/chushi/v1/sysLog/excelTemplate', 'POST', '{\"size\":0,\"current\":0,\"operation\":\"\",\"requestMethod\":\"\"}', '3020', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', null, '403', '用户名称', null, '2022-08-12 14:13:35', null, null);
INSERT INTO `sys_log_operation` VALUES ('1557973552517349377', '2', null, '/chushi/v1/sysLog/excelTemplate', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'null【错误类型】:业务异常403', '403', null, null, '2022-08-12 14:13:35', null, null);
INSERT INTO `sys_log_operation` VALUES ('1557973761615986689', '1', '下载模板', '/chushi/v1/sysLog/excelTemplate', 'POST', '{\"size\":10,\"current\":1,\"operation\":\"\",\"requestMethod\":\"\"}', '547', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', null, '403', '用户名称', null, '2022-08-12 14:14:25', null, null);
INSERT INTO `sys_log_operation` VALUES ('1557973763184656386', '2', null, '/chushi/v1/sysLog/excelTemplate', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'null【错误类型】:业务异常403', '403', null, null, '2022-08-12 14:14:26', null, null);
INSERT INTO `sys_log_operation` VALUES ('1557973804091703298', '1', '下载模板', '/chushi/v1/sysLog/excelTemplate', 'POST', '{\"size\":10,\"current\":1,\"operation\":\"\",\"requestMethod\":\"\"}', '324', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', null, '403', '用户名称', null, '2022-08-12 14:14:35', null, null);
INSERT INTO `sys_log_operation` VALUES ('1557973805295468546', '2', null, '/chushi/v1/sysLog/excelTemplate', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'null【错误类型】:业务异常403', '403', null, null, '2022-08-12 14:14:36', null, null);
INSERT INTO `sys_log_operation` VALUES ('1557975139553902594', '1', '下载模板', '/chushi/v1/sysLog/excelTemplate', 'POST', null, '1372', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', null, '403', '用户名称', null, '2022-08-12 14:19:54', null, null);
INSERT INTO `sys_log_operation` VALUES ('1557975140711530498', '2', null, '/chushi/v1/sysLog/excelTemplate', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'null【错误类型】:业务异常403', '403', null, null, '2022-08-12 14:19:54', null, null);
INSERT INTO `sys_log_operation` VALUES ('1557976140813991938', '3', '数据根据模板导出', '/chushi/v1/sysLog/excelTemplateExport', 'POST', '{\"size\":10,\"current\":1,\"operation\":\"\",\"requestMethod\":\"\"}', '3358', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-12 14:23:52', null, null);
INSERT INTO `sys_log_operation` VALUES ('1557976142026145793', '1', '数据根据模板导出', '/chushi/v1/sysLog/excelTemplateExport', 'POST', '{\"size\":10,\"current\":1,\"operation\":\"\",\"requestMethod\":\"\"}', '3800', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-12 14:23:53', null, null);
INSERT INTO `sys_log_operation` VALUES ('1557976434083921922', '1', '下载模板', '/chushi/v1/sysLog/excelTemplate', 'POST', null, '1123', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', null, '403', '用户名称', null, '2022-08-12 14:25:02', null, null);
INSERT INTO `sys_log_operation` VALUES ('1557976435988135937', '2', null, '/chushi/v1/sysLog/excelTemplate', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'null【错误类型】:业务异常403', '403', null, null, '2022-08-12 14:25:03', null, null);
INSERT INTO `sys_log_operation` VALUES ('1557978272493506562', '3', '数据根据模板导出', '/chushi/v1/sysLog/excelTemplateExport', 'POST', '{\"size\":10,\"current\":1,\"operation\":\"\",\"requestMethod\":\"\"}', '3278', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-12 14:32:21', null, null);
INSERT INTO `sys_log_operation` VALUES ('1557978273793740801', '1', '数据根据模板导出', '/chushi/v1/sysLog/excelTemplateExport', 'POST', '{\"size\":10,\"current\":1,\"operation\":\"\",\"requestMethod\":\"\"}', '3606', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-12 14:32:21', null, null);
INSERT INTO `sys_log_operation` VALUES ('1557978573556453377', '1', '下载模板', '/chushi/v1/sysLog/excelTemplate', 'POST', null, '26', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-12 14:33:32', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559010673722183681', '3', '数据导出', '/chushi/v1/sysLog/exportExcel', 'POST', '{\"size\":0,\"current\":0,\"operation\":\"\",\"requestMethod\":\"\"}', '13075', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-15 10:54:44', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559010674993057793', '1', '数据导出', '/chushi/v1/sysLog/exportExcel', 'POST', '{\"size\":0,\"current\":0,\"operation\":\"\",\"requestMethod\":\"\"}', '13396', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-15 10:54:45', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559085504299859970', '2', null, '/chushi/v1/sysLog/redis', 'GET', null, null, 'Apache-HttpClient/4.5.13 (Java/1.8.0_91)', '127.0.0.1', 'Optional int parameter \'timeout\' is present but cannot be translated into a null value due to being declared as a primitive type. Consider declaring it as object wrapper for the corresponding primitive type.', '500', null, null, '2022-08-15 15:52:05', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559085969607557121', '1', 'redis测试', '/chushi/v1/sysLog/redis', 'GET', '60', '432', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-15 15:53:56', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559092543206014978', '2', null, '/chushi/v1/sysLog/redis', 'GET', null, null, 'Apache-HttpClient/4.5.13 (Java/1.8.0_91)', '127.0.0.1', 'Optional int parameter \'timeout\' is present but cannot be translated into a null value due to being declared as a primitive type. Consider declaring it as object wrapper for the corresponding primitive type.', '500', null, null, '2022-08-15 16:20:03', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559092936015167490', '1', 'redis测试', '/chushi/v1/sysLog/redis', 'GET', '60', '337', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-15 16:21:37', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559093064000159745', '1', 'redis测试', '/chushi/v1/sysLog/redis', 'GET', '60', '130', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-15 16:22:08', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559093706101956610', '1', 'redis测试', '/chushi/v1/sysLog/redis', 'GET', '60', '183', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-15 16:24:41', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559093743255101441', '1', 'redis测试', '/chushi/v1/sysLog/redis', 'GET', 'null', '31', 'Apache-HttpClient/4.5.13 (Java/1.8.0_91)', '127.0.0.1', null, '403', '用户名称', null, '2022-08-15 16:24:50', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559093743968133121', '2', null, '/chushi/v1/sysLog/redis', 'GET', null, null, 'Apache-HttpClient/4.5.13 (Java/1.8.0_91)', '127.0.0.1', null, '500', null, null, '2022-08-15 16:24:50', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559096217810620418', '2', null, '/chushi/v1/sysLog/redis', 'GET', '{\"timeout\":\"<{timeout=100},[accessToken:\\\"accessToken\\\", Content-Type:\\\"application/json;charset=UTF-8\\\"]>\"}', null, 'Apache-HttpClient/4.5.13 (Java/1.8.0_91)', '127.0.0.1', 'Failed to convert value of type \'java.lang.String\' to required type \'java.lang.Integer\'; nested exception is java.lang.NumberFormatException: For input string: \"<{timeout=100},[accessToken:\"accessToken\",Content-Type:\"application/json;charset=UTF-8\"]>\"', '500', null, null, '2022-08-15 16:34:40', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559097279078522881', '2', null, '/chushi/v1/sysLog/redis', 'GET', '{\"timeout\":\"<{timeout=100},[accessToken:\\\"accessToken\\\", Content-Type:\\\"application/json;charset=UTF-8\\\"]>\"}', null, 'Apache-HttpClient/4.5.13 (Java/1.8.0_91)', '127.0.0.1', 'For input string: \"<{timeout=100},[accessToken:\"accessToken\", Content-Type:\"application/json;charset=UTF-8\"]>\"', '500', null, null, '2022-08-15 16:38:53', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559098772619812865', '2', null, '/chushi/v1/sysLog/restTemplateGet', 'POST', '{\"tomeout\":\"100\"}', null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'Map has no value for \'tomeout\'', '500', null, null, '2022-08-15 16:44:49', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559099166020419586', '2', null, '/chushi/v1/sysLog/redis', 'GET', null, null, 'Apache-HttpClient/4.5.13 (Java/1.8.0_91)', '127.0.0.1', null, '500', null, null, '2022-08-15 16:46:22', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559099560612151297', '3', null, '/chushi/v1/sysLog/restTemplateGet', 'POST', '10000', '6013', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-15 16:47:57', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559099561920774145', '2', null, '/chushi/v1/sysLog/restTemplateGet', 'POST', '{\"timeout\":\"10000\"}', null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'I/O error on GET request for \"http://localhost:9001/chushi/v1/sysLog/redis\": Read timed out; nested exception is java.net.SocketTimeoutException: Read timed out', '500', null, null, '2022-08-15 16:47:57', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559099575019585537', '3', null, '/chushi/v1/sysLog/redis', 'GET', '10000', '10120', 'Apache-HttpClient/4.5.13 (Java/1.8.0_91)', '127.0.0.1', '成功', '200', '用户名称', null, '2022-08-15 16:48:00', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559100270086995969', '3', null, '/chushi/v1/sysLog/restTemplateGet', 'POST', '10000', '6050', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-15 16:50:46', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559100271320121345', '2', null, '/chushi/v1/sysLog/restTemplateGet', 'POST', '{\"timeout\":\"10000\"}', null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'I/O error on GET request for \"http://localhost:9001/chushi/v1/sysLog/redis\": Read timed out; nested exception is java.net.SocketTimeoutException: Read timed out', '500', null, null, '2022-08-15 16:50:46', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559100285610115073', '3', null, '/chushi/v1/sysLog/redis', 'GET', '10000', '10406', 'Apache-HttpClient/4.5.13 (Java/1.8.0_91)', '127.0.0.1', '成功', '200', '用户名称', null, '2022-08-15 16:50:49', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559100757104410625', '3', null, '/chushi/v1/sysLog/restTemplateGet', 'POST', '6000', '6004', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-15 16:52:42', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559100758274621442', '3', null, '/chushi/v1/sysLog/redis', 'GET', '6000', '6147', 'Apache-HttpClient/4.5.13 (Java/1.8.0_91)', '127.0.0.1', '成功', '200', '用户名称', null, '2022-08-15 16:52:42', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559100759306420226', '2', null, '/chushi/v1/sysLog/restTemplateGet', 'POST', '{\"timeout\":\"6000\"}', null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'I/O error on GET request for \"http://localhost:9001/chushi/v1/sysLog/redis\": Read timed out; nested exception is java.net.SocketTimeoutException: Read timed out', '500', null, null, '2022-08-15 16:52:42', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559100813186449410', '3', null, '/chushi/v1/sysLog/redis', 'GET', '5000', '5113', 'Apache-HttpClient/4.5.13 (Java/1.8.0_91)', '127.0.0.1', '成功', '200', '用户名称', null, '2022-08-15 16:52:55', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559100814386020353', '3', null, '/chushi/v1/sysLog/restTemplateGet', 'POST', '5000', '5422', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-15 16:52:55', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559102234392813570', '3', null, '/chushi/v1/sysLog/redis', 'GET', '5000', '5387', 'Apache-HttpClient/4.5.13 (Java/1.8.0_91)', '127.0.0.1', '成功', '200', '用户名称', null, '2022-08-15 16:58:34', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559102235646910465', '3', null, '/chushi/v1/sysLog/restTemplateGet', 'POST', '5000', '6044', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-15 16:58:34', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559102236817121282', '2', null, '/chushi/v1/sysLog/restTemplateGet', 'POST', '{\"timeout\":\"5000\"}', null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'I/O error on GET request for \"http://localhost:9001/chushi/v1/sysLog/redis\": Read timed out; nested exception is java.net.SocketTimeoutException: Read timed out', '500', null, null, '2022-08-15 16:58:35', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559102348310110210', '2', null, '/chushi/v1/sysLog/redisPost', 'POST', null, null, 'Apache-HttpClient/4.5.13 (Java/1.8.0_91)', '127.0.0.1', 'Required request body is missing: public com.liuds.springbootchus.config.Result com.liuds.springbootchus.controller.DemoController.redisPost(java.lang.Integer)', '500', null, null, '2022-08-15 16:59:01', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559102600584912898', '3', null, '/chushi/v1/sysLog/redisPost', 'POST', '10000', '10245', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-15 17:00:01', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559103390636683266', '2', null, '/chushi/v1/sysLog/redisPost', 'POST', null, null, 'Apache-HttpClient/4.5.13 (Java/1.8.0_91)', '127.0.0.1', 'Required request body is missing: public com.liuds.springbootchus.config.Result com.liuds.springbootchus.controller.DemoController.redisPost(com.liuds.springbootchus.dto.SysLogOperationDto)', '500', null, null, '2022-08-15 17:03:10', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559106285956243458', '3', null, '/chushi/v1/sysLog/redisPost', 'POST', '{\"size\":10,\"current\":1,\"operation\":null,\"requestMethod\":null,\"timeout\":4000}', '4115', 'Apache-HttpClient/4.5.13 (Java/1.8.0_91)', '127.0.0.1', '成功', '200', '用户名称', null, '2022-08-15 17:14:40', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559106287344558082', '3', null, '/chushi/v1/sysLog/restTemplatePost', 'POST', '4000', '5326', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-15 17:14:40', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559106439908171777', '3', null, '/chushi/v1/sysLog/restTemplatePost', 'POST', '6000', '6011', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-15 17:15:17', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559106445650173954', '3', null, '/chushi/v1/sysLog/redisPost', 'POST', '{\"size\":10,\"current\":1,\"operation\":null,\"requestMethod\":null,\"timeout\":6000}', '6149', 'Apache-HttpClient/4.5.13 (Java/1.8.0_91)', '127.0.0.1', '成功', '200', '用户名称', null, '2022-08-15 17:15:18', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559106447881543681', '2', null, '/chushi/v1/sysLog/restTemplatePost', 'POST', '{\"timeout\":\"6000\"}', null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'I/O error on POST request for \"http://localhost:9001/chushi/v1/sysLog/redisPost\": Read timed out; nested exception is java.net.SocketTimeoutException: Read timed out', '500', null, null, '2022-08-15 17:15:19', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559106693265104898', '3', null, '/chushi/v1/sysLog/restTemplatePost', 'POST', '7000', '6002', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-15 17:16:17', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559106694439510017', '2', null, '/chushi/v1/sysLog/restTemplatePost', 'POST', '{\"timeout\":\"7000\"}', null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'I/O error on POST request for \"http://localhost:9001/chushi/v1/sysLog/redisPost\": Read timed out; nested exception is java.net.SocketTimeoutException: Read timed out', '500', null, null, '2022-08-15 17:16:17', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559106697983696897', '3', null, '/chushi/v1/sysLog/redisPost', 'POST', '{\"size\":10,\"current\":1,\"operation\":null,\"requestMethod\":null,\"timeout\":7000}', '7128', 'Apache-HttpClient/4.5.13 (Java/1.8.0_91)', '127.0.0.1', '成功', '200', '用户名称', null, '2022-08-15 17:16:18', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559108433939025921', '3', null, '/chushi/v1/sysLog/restTemplatePost', 'POST', '7000', '6053', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-15 17:23:12', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559108442373771265', '3', null, '/chushi/v1/sysLog/redisPost', 'POST', '{\"size\":10,\"current\":1,\"operation\":null,\"requestMethod\":null,\"timeout\":7000}', '8822', 'Apache-HttpClient/4.5.13 (Java/1.8.0_91)', '127.0.0.1', '成功', '200', '用户名称', null, '2022-08-15 17:23:14', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559109171054379010', '3', null, '/chushi/v1/sysLog/restTemplatePost', 'POST', '7000', '6079', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-15 17:26:08', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559109172660797442', '3', null, '/chushi/v1/sysLog/redisPost', 'POST', '{\"size\":10,\"current\":1,\"operation\":null,\"requestMethod\":null,\"timeout\":7000}', '7326', 'Apache-HttpClient/4.5.13 (Java/1.8.0_91)', '127.0.0.1', '成功', '200', '用户名称', null, '2022-08-15 17:26:08', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559109174363684866', '2', null, '/chushi/v1/sysLog/restTemplatePost', 'POST', '{\"timeout\":\"7000\"}', null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '连接超时，请重新点击或联系管理员！【错误类型】:业务异常403', '403', null, null, '2022-08-15 17:26:09', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559728428201046017', '3', '测试多数据源', '/chushi/v1/sysLog/dynamic', 'GET', '\"\"', '11311', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-17 10:26:50', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559728428838580226', '1', '测试多数据源', '/chushi/v1/sysLog/dynamic', 'GET', '\"\"', '11549', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist\r\n### The error may exist in file [D:\\learnCode\\chushi\\target\\classes\\mapper\\DemoMapper.xml]\r\n### The error may involve defaultParameterMap\r\n### The error occurred while setting parameters\r\n### SQL: SELECT         operation         FROM         sys_log_operation         WHERE         id = ?\r\n### Cause: java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist\n; bad SQL grammar []; nested exception is java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist', '410', '用户名称', null, '2022-08-17 10:26:50', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559728429488697346', '2', null, '/chushi/v1/sysLog/dynamic', 'GET', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist\r\n### The error may exist in file [D:\\learnCode\\chushi\\target\\classes\\mapper\\DemoMapper.xml]\r\n### The error may involve defaultParameterMap\r\n### The error occurred while setting parameters\r\n### SQL: SELECT         operation         FROM         sys_log_operation         WHERE         id = ?\r\n### Cause: java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist\n; bad SQL grammar []; nested exception is java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist', '500', null, null, '2022-08-17 10:26:51', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559847357296721922', '1', 'url', '/chushi/v1/sysLog/url', 'POST', null, '60', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-17 18:19:25', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559849061723422722', '1', 'url', '/chushi/v1/sysLog/url', 'POST', null, '42', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-17 18:26:12', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559856699450425346', '2', null, '/chushi/v1/sysLog/url', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'java.lang.String cannot be cast to java.util.List', '500', null, null, '2022-08-17 18:56:33', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559857411714498562', '2', null, '/chushi/v1/sysLog/url', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'expect \':\' at 0, actual =', '500', null, null, '2022-08-17 18:59:22', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559858038557478914', '2', null, '/chushi/v1/sysLog/url', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'expect \':\' at 0, actual =', '500', null, null, '2022-08-17 19:01:52', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559859368663568386', '2', null, '/chushi/v1/sysLog/url', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'java.lang.String cannot be cast to java.util.List', '500', null, null, '2022-08-17 19:07:09', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559860629521608706', '2', null, '/chushi/v1/sysLog/url', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'java.lang.String cannot be cast to com.liuds.springbootchus.config.Result', '500', null, null, '2022-08-17 19:12:10', null, null);
INSERT INTO `sys_log_operation` VALUES ('1559861491543314434', '2', null, '/chushi/v1/sysLog/url', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'com.alibaba.fastjson.JSONObject cannot be cast to com.liuds.springbootchus.config.Result', '500', null, null, '2022-08-17 19:15:35', null, null);
INSERT INTO `sys_log_operation` VALUES ('1560077412828573698', '1', '分页', '/chushi/v1/sysLog/page', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"\",\"timeout\":0}', '1457', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-18 09:33:35', null, null);
INSERT INTO `sys_log_operation` VALUES ('1560079056563728385', '1', '分页', '/chushi/v1/sysLog/page', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"\",\"timeout\":0}', '905', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-18 09:40:07', null, null);
INSERT INTO `sys_log_operation` VALUES ('1560080101830295553', '1', '分页', '/chushi/v1/sysLog/page', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"\",\"timeout\":0}', '913', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-18 09:44:16', null, null);
INSERT INTO `sys_log_operation` VALUES ('1560087523781353474', '1', '分页', '/chushi/v1/sysLog/page', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"\",\"timeout\":0}', '992', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-18 10:13:45', null, null);
INSERT INTO `sys_log_operation` VALUES ('1560087716408958978', '1', '分页', '/chushi/v1/sysLog/page', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"\",\"timeout\":0}', '174', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-18 10:14:31', null, null);
INSERT INTO `sys_log_operation` VALUES ('1560087976313212930', '1', '分页', '/chushi/v1/sysLog/page', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"\",\"timeout\":0}', '938', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-18 10:15:33', null, null);
INSERT INTO `sys_log_operation` VALUES ('1560088904101613570', '3', '分页', '/chushi/v1/sysLog/page', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"\",\"timeout\":0}', '181878', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-18 10:19:14', null, null);
INSERT INTO `sys_log_operation` VALUES ('1560088969213988865', '1', '分页', '/chushi/v1/sysLog/page', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"\",\"timeout\":0}', '197713', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-18 10:19:30', null, null);
INSERT INTO `sys_log_operation` VALUES ('1560089374652190721', '1', '分页', '/chushi/v1/sysLog/page', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"\",\"timeout\":0}', '812', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-18 10:21:07', null, null);
INSERT INTO `sys_log_operation` VALUES ('1560089393564307458', '1', '分页', '/chushi/v1/sysLog/page', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"\",\"timeout\":0}', '102', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-18 10:21:11', null, null);
INSERT INTO `sys_log_operation` VALUES ('1563551957983977474', '2', null, '/dum-building/v1/midea/importExcelMideaT', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/70.0.3538.77 Safari/537.36', '120.235.95.253', null, '500', null, null, '2022-08-27 23:40:11', null, null);
INSERT INTO `sys_log_operation` VALUES ('1563552437015437313', '2', null, '/dum-building/v1/midea/importExcelMideaT', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/70.0.3538.77 Safari/537.36', '120.235.95.253', null, '500', null, null, '2022-08-27 23:42:05', null, null);
INSERT INTO `sys_log_operation` VALUES ('1563552836514504706', '2', null, '/dum-building/v1/midea/importExcelMideaT', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/70.0.3538.77 Safari/537.36', '120.235.95.253', null, '500', null, null, '2022-08-27 23:43:40', null, null);
INSERT INTO `sys_log_operation` VALUES ('1563552966802169857', '2', null, '/dum-building/v1/midea/importExcelMideaT', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/70.0.3538.77 Safari/537.36', '120.235.95.253', null, '500', null, null, '2022-08-27 23:44:11', null, null);
INSERT INTO `sys_log_operation` VALUES ('1563553362987737089', '2', null, '/dum-building/v1/midea/importExcelMideaT', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/70.0.3538.77 Safari/537.36', '120.235.95.253', null, '500', null, null, '2022-08-27 23:45:46', null, null);
INSERT INTO `sys_log_operation` VALUES ('1563553915406934017', '2', null, '/dum-building/v1/midea/importExcelMideaT', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/70.0.3538.77 Safari/537.36', '120.235.95.253', null, '500', null, null, '2022-08-27 23:47:58', null, null);
INSERT INTO `sys_log_operation` VALUES ('1563554319297437698', '2', null, '/dum-building/v1/midea/importExcelMideaT', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/70.0.3538.77 Safari/537.36', '120.235.95.253', null, '500', null, null, '2022-08-27 23:49:34', null, null);
INSERT INTO `sys_log_operation` VALUES ('1563554662974513153', '2', null, '/dum-building/v1/midea/importExcelMideaT', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/70.0.3538.77 Safari/537.36', '120.235.95.253', null, '500', null, null, '2022-08-27 23:50:56', null, null);
INSERT INTO `sys_log_operation` VALUES ('1563555285526667266', '2', null, '/dum-building/v1/midea/importExcelMideaT', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/70.0.3538.77 Safari/537.36', '120.235.95.253', null, '500', null, null, '2022-08-27 23:53:24', null, null);
INSERT INTO `sys_log_operation` VALUES ('1563555658492567554', '2', null, '/dum-building/v1/midea/importExcelMideaT', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/70.0.3538.77 Safari/537.36', '120.235.95.253', null, '500', null, null, '2022-08-27 23:54:53', null, null);
INSERT INTO `sys_log_operation` VALUES ('1564862834922287105', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"get\",\"timeout\":0}', '265', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'nested exception is org.apache.ibatis.builder.BuilderException: Error evaluating expression \'ew.sqlSegment != null and ew.sqlSegment != \'\' and ew.nonEmptyOfWhere\'. Cause: org.apache.ibatis.ognl.OgnlException: sqlSegment [java.lang.ClassCastException: java.lang.String cannot be cast to com.baomidou.mybatisplus.core.toolkit.support.SFunction]', '410', '用户名称', null, '2022-08-31 14:29:08', null, null);
INSERT INTO `sys_log_operation` VALUES ('1564862837849911297', '2', null, '/chushi/v1/sysLog/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'nested exception is org.apache.ibatis.builder.BuilderException: Error evaluating expression \'ew.sqlSegment != null and ew.sqlSegment != \'\' and ew.nonEmptyOfWhere\'. Cause: org.apache.ibatis.ognl.OgnlException: sqlSegment [java.lang.ClassCastException: java.lang.String cannot be cast to com.baomidou.mybatisplus.core.toolkit.support.SFunction]', '500', null, null, '2022-08-31 14:29:09', null, null);
INSERT INTO `sys_log_operation` VALUES ('1564863238733119490', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"get\",\"timeout\":0}', '740', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: Unknown column \'requestMethod\' in \'where clause\'\r\n### The error may exist in com/liuds/springbootchus/dao/SysLogOperationDao.java (best guess)\r\n### The error may involve defaultParameterMap\r\n### The error occurred while setting parameters\r\n### SQL: SELECT  id,operation,type,request_uri,request_method,request_params,request_time,user_agent,ip,code,remark,creator_name,creator,create_date,updater,update_date  FROM sys_log_operation     WHERE (requestMethod = ? AND timeout = ?) ORDER BY type DESC\r\n### Cause: java.sql.SQLSyntaxErrorException: Unknown column \'requestMethod\' in \'where clause\'\n; bad SQL grammar []; nested exception is java.sql.SQLSyntaxErrorException: Unknown column \'requestMethod\' in \'where clause\'', '410', '用户名称', null, '2022-08-31 14:30:45', null, null);
INSERT INTO `sys_log_operation` VALUES ('1564863239425179649', '2', null, '/chushi/v1/sysLog/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: Unknown column \'requestMethod\' in \'where clause\'\r\n### The error may exist in com/liuds/springbootchus/dao/SysLogOperationDao.java (best guess)\r\n### The error may involve defaultParameterMap\r\n### The error occurred while setting parameters\r\n### SQL: SELECT  id,operation,type,request_uri,request_method,request_params,request_time,user_agent,ip,code,remark,creator_name,creator,create_date,updater,update_date  FROM sys_log_operation     WHERE (requestMethod = ? AND timeout = ?) ORDER BY type DESC\r\n### Cause: java.sql.SQLSyntaxErrorException: Unknown column \'requestMethod\' in \'where clause\'\n; bad SQL grammar []; nested exception is java.sql.SQLSyntaxErrorException: Unknown column \'requestMethod\' in \'where clause\'', '500', null, null, '2022-08-31 14:30:45', null, null);
INSERT INTO `sys_log_operation` VALUES ('1564864282737270785', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"get\",\"timeout\":0}', '895', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-31 14:34:53', null, null);
INSERT INTO `sys_log_operation` VALUES ('1564865072277241857', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"get\",\"timeout\":0}', '65', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'nested exception is org.apache.ibatis.builder.BuilderException: Error evaluating expression \'ew.sqlSegment != null and ew.sqlSegment != \'\' and ew.nonEmptyOfWhere\'. Cause: org.apache.ibatis.ognl.OgnlException: sqlSegment [java.lang.ClassCastException: java.lang.String cannot be cast to com.baomidou.mybatisplus.core.toolkit.support.SFunction]', '410', '用户名称', null, '2022-08-31 14:38:02', null, null);
INSERT INTO `sys_log_operation` VALUES ('1564865073539727362', '2', null, '/chushi/v1/sysLog/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'nested exception is org.apache.ibatis.builder.BuilderException: Error evaluating expression \'ew.sqlSegment != null and ew.sqlSegment != \'\' and ew.nonEmptyOfWhere\'. Cause: org.apache.ibatis.ognl.OgnlException: sqlSegment [java.lang.ClassCastException: java.lang.String cannot be cast to com.baomidou.mybatisplus.core.toolkit.support.SFunction]', '500', null, null, '2022-08-31 14:38:02', null, null);
INSERT INTO `sys_log_operation` VALUES ('1564871041640042497', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"get\",\"timeout\":0}', '1119', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: Unknown column \'SIZE\' in \'where clause\'\r\n### The error may exist in com/liuds/springbootchus/dao/SysLogOperationDao.java (best guess)\r\n### The error may involve defaultParameterMap\r\n### The error occurred while setting parameters\r\n### SQL: SELECT  id,operation,type,request_uri,request_method,request_params,request_time,user_agent,ip,code,remark,creator_name,creator,create_date,updater,update_date  FROM sys_log_operation     WHERE (SIZE = ? AND CURRENT = ? AND REQUEST_METHOD = ? AND TIMEOUT = ?)\r\n### Cause: java.sql.SQLSyntaxErrorException: Unknown column \'SIZE\' in \'where clause\'\n; bad SQL grammar []; nested exception is java.sql.SQLSyntaxErrorException: Unknown column \'SIZE\' in \'where clause\'', '410', '用户名称', null, '2022-08-31 15:01:45', null, null);
INSERT INTO `sys_log_operation` VALUES ('1564871043208712194', '2', null, '/chushi/v1/sysLog/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: Unknown column \'SIZE\' in \'where clause\'\r\n### The error may exist in com/liuds/springbootchus/dao/SysLogOperationDao.java (best guess)\r\n### The error may involve defaultParameterMap\r\n### The error occurred while setting parameters\r\n### SQL: SELECT  id,operation,type,request_uri,request_method,request_params,request_time,user_agent,ip,code,remark,creator_name,creator,create_date,updater,update_date  FROM sys_log_operation     WHERE (SIZE = ? AND CURRENT = ? AND REQUEST_METHOD = ? AND TIMEOUT = ?)\r\n### Cause: java.sql.SQLSyntaxErrorException: Unknown column \'SIZE\' in \'where clause\'\n; bad SQL grammar []; nested exception is java.sql.SQLSyntaxErrorException: Unknown column \'SIZE\' in \'where clause\'', '500', null, null, '2022-08-31 15:01:45', null, null);
INSERT INTO `sys_log_operation` VALUES ('1564872511663935489', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"get\",\"timeout\":0}', '1209', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-31 15:07:35', null, null);
INSERT INTO `sys_log_operation` VALUES ('1564910707219222529', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"get\",\"timeout\":0}', '148', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'nested exception is org.apache.ibatis.builder.BuilderException: Error evaluating expression \'ew.sqlSegment != null and ew.sqlSegment != \'\' and ew.nonEmptyOfWhere\'. Cause: org.apache.ibatis.ognl.OgnlException: sqlSegment [java.lang.ClassCastException: java.lang.String cannot be cast to com.baomidou.mybatisplus.core.toolkit.support.SFunction]', '410', '用户名称', null, '2022-08-31 17:39:22', null, null);
INSERT INTO `sys_log_operation` VALUES ('1564910709341540353', '2', null, '/chushi/v1/sysLog/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'nested exception is org.apache.ibatis.builder.BuilderException: Error evaluating expression \'ew.sqlSegment != null and ew.sqlSegment != \'\' and ew.nonEmptyOfWhere\'. Cause: org.apache.ibatis.ognl.OgnlException: sqlSegment [java.lang.ClassCastException: java.lang.String cannot be cast to com.baomidou.mybatisplus.core.toolkit.support.SFunction]', '500', null, null, '2022-08-31 17:39:22', null, null);
INSERT INTO `sys_log_operation` VALUES ('1564910982331949057', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"get\",\"timeout\":0}', '59', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'nested exception is org.apache.ibatis.builder.BuilderException: Error evaluating expression \'ew.sqlSegment != null and ew.sqlSegment != \'\' and ew.nonEmptyOfWhere\'. Cause: org.apache.ibatis.ognl.OgnlException: sqlSegment [java.lang.ClassCastException: java.lang.String cannot be cast to com.baomidou.mybatisplus.core.toolkit.support.SFunction]', '410', '用户名称', null, '2022-08-31 17:40:27', null, null);
INSERT INTO `sys_log_operation` VALUES ('1564910983430856705', '2', null, '/chushi/v1/sysLog/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'nested exception is org.apache.ibatis.builder.BuilderException: Error evaluating expression \'ew.sqlSegment != null and ew.sqlSegment != \'\' and ew.nonEmptyOfWhere\'. Cause: org.apache.ibatis.ognl.OgnlException: sqlSegment [java.lang.ClassCastException: java.lang.String cannot be cast to com.baomidou.mybatisplus.core.toolkit.support.SFunction]', '500', null, null, '2022-08-31 17:40:28', null, null);
INSERT INTO `sys_log_operation` VALUES ('1564911362394595329', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"get\",\"timeout\":0}', '910', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-31 17:41:58', null, null);
INSERT INTO `sys_log_operation` VALUES ('1564913733040459778', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"get\",\"timeout\":0}', '646', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-08-31 17:51:23', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565146144466591746', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"get\",\"timeout\":0}', '1615', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-09-01 09:14:55', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565147143398760450', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"get\",\"timeout\":0}', '915', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-09-01 09:18:53', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565147616788881409', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"get\",\"timeout\":0}', '738', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-09-01 09:20:46', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565148280151719937', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"get\",\"timeout\":0}', '834', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-09-01 09:23:24', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565304061052395522', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"get\",\"timeout\":0}', '1654', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-09-01 19:42:25', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565304065510940673', '2', null, '/chushi/v1/sysLog/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '[idempotent]:请勿重复添加用户【错误类型】:业务异常410', '410', null, null, '2022-09-01 19:42:26', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565304081189249025', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"get\",\"timeout\":0}', '78', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-09-01 19:42:30', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565304085710708737', '2', null, '/chushi/v1/sysLog/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '[idempotent]:请勿重复添加用户【错误类型】:业务异常410', '410', null, null, '2022-09-01 19:42:31', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565304095206612993', '2', null, '/chushi/v1/sysLog/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '[idempotent]:请勿重复添加用户【错误类型】:业务异常410', '410', null, null, '2022-09-01 19:42:33', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565304100457881601', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"get\",\"timeout\":0}', '76', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-09-01 19:42:34', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565304110855561217', '2', null, '/chushi/v1/sysLog/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '[idempotent]:请勿重复添加用户【错误类型】:业务异常410', '410', null, null, '2022-09-01 19:42:37', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565304113913208834', '2', null, '/chushi/v1/sysLog/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '[idempotent]:请勿重复添加用户【错误类型】:业务异常410', '410', null, null, '2022-09-01 19:42:37', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565304119760068609', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"get\",\"timeout\":0}', '71', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-09-01 19:42:39', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565304148692377602', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"get\",\"timeout\":0}', '79', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-09-01 19:42:46', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565304153339666433', '2', null, '/chushi/v1/sysLog/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '[idempotent]:请勿重复添加用户【错误类型】:业务异常410', '410', null, null, '2022-09-01 19:42:47', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565304155583619073', '2', null, '/chushi/v1/sysLog/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '[idempotent]:请勿重复添加用户【错误类型】:业务异常410', '410', null, null, '2022-09-01 19:42:47', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565304159048114178', '2', null, '/chushi/v1/sysLog/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '[idempotent]:请勿重复添加用户【错误类型】:业务异常410', '410', null, null, '2022-09-01 19:42:48', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565304166551724034', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"get\",\"timeout\":0}', '99', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-09-01 19:42:50', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565304169168969730', '2', null, '/chushi/v1/sysLog/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '[idempotent]:请勿重复添加用户【错误类型】:业务异常410', '410', null, null, '2022-09-01 19:42:51', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565304172469886978', '2', null, '/chushi/v1/sysLog/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '[idempotent]:请勿重复添加用户【错误类型】:业务异常410', '410', null, null, '2022-09-01 19:42:51', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565304174877417474', '2', null, '/chushi/v1/sysLog/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '[idempotent]:请勿重复添加用户【错误类型】:业务异常410', '410', null, null, '2022-09-01 19:42:52', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565615038360760321', '3', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"get\",\"timeout\":0}', '11733', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-09-02 16:18:08', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565615039539359746', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"get\",\"timeout\":0}', '12115', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-09-02 16:18:08', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565615050037702658', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"get\",\"timeout\":0}', '117', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-09-02 16:18:10', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565615057033801729', '2', null, '/chushi/v1/sysLog/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '[idempotent]:请勿重复列表【错误类型】:业务异常410', '410', null, null, '2022-09-02 16:18:12', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565615062587060226', '2', null, '/chushi/v1/sysLog/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '[idempotent]:请勿重复列表【错误类型】:业务异常410', '410', null, null, '2022-09-02 16:18:13', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565615067481812993', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"get\",\"timeout\":0}', '70', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-09-02 16:18:14', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565615077439090689', '2', null, '/chushi/v1/sysLog/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '[idempotent]:请勿重复列表【错误类型】:业务异常410', '410', null, null, '2022-09-02 16:18:17', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565615082518392834', '2', null, '/chushi/v1/sysLog/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '[idempotent]:请勿重复列表【错误类型】:业务异常410', '410', null, null, '2022-09-02 16:18:18', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565615090537902081', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"get\",\"timeout\":0}', '135', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-09-02 16:18:20', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565615621385797633', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"get\",\"timeout\":0}', '975', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-09-02 16:20:27', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565615628574834689', '2', null, '/chushi/v1/sysLog/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '[idempotent]:请勿重复列表【错误类型】:业务异常410', '410', null, null, '2022-09-02 16:20:28', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565615632802693122', '2', null, '/chushi/v1/sysLog/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '[idempotent]:请勿重复列表【错误类型】:业务异常410', '410', null, null, '2022-09-02 16:20:29', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565615729061969922', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"get\",\"timeout\":0}', '74', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-09-02 16:20:52', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565615734279684097', '2', null, '/chushi/v1/sysLog/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '[idempotent]:请勿重复列表【错误类型】:业务异常410', '410', null, null, '2022-09-02 16:20:53', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565629515068137474', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"get\",\"timeout\":0}', '1593', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-09-02 17:15:39', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565629520445235201', '2', null, '/chushi/v1/sysLog/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '[idempotent]:请勿重复列表【错误类型】:业务异常410', '410', null, null, '2022-09-02 17:15:40', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565629524232691713', '2', null, '/chushi/v1/sysLog/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '[idempotent]:请勿重复列表【错误类型】:业务异常410', '410', null, null, '2022-09-02 17:15:41', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565630359729610753', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"get\",\"timeout\":0}', '33', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'ssss', '410', '用户名称', null, '2022-09-02 17:19:00', null, null);
INSERT INTO `sys_log_operation` VALUES ('1565630361520578562', '2', null, '/chushi/v1/sysLog/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'ssss【错误类型】:业务异常410', '410', null, null, '2022-09-02 17:19:01', null, null);
INSERT INTO `sys_log_operation` VALUES ('1571676316242034689', '2', null, '/dum-building/v1/midea/importExcelMideaT', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/70.0.3538.77 Safari/537.36', '218.13.14.217', null, '500', null, null, '2022-09-19 09:43:29', null, null);
INSERT INTO `sys_log_operation` VALUES ('1571676885761409026', '2', null, '/dum-building/v1/midea/importExcelMideaT', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/70.0.3538.77 Safari/537.36', '218.13.14.217', null, '500', null, null, '2022-09-19 09:45:45', null, null);
INSERT INTO `sys_log_operation` VALUES ('1573504803701563394', '1', '测试多数据源', '/chushi/v1/sysLog/dynamic', 'GET', '\"\"', '1932', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist\r\n### The error may exist in file [D:\\learnCode\\chushi\\target\\classes\\mapper\\DemoMapper.xml]\r\n### The error may involve defaultParameterMap\r\n### The error occurred while setting parameters\r\n### SQL: SELECT         operation         FROM         sys_log_operation         WHERE         id = ?\r\n### Cause: java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist\n; bad SQL grammar []; nested exception is java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist', '410', '用户名称', null, '2022-09-24 10:49:14', null, null);
INSERT INTO `sys_log_operation` VALUES ('1573504804943077378', '2', null, '/chushi/v1/sysLog/dynamic', 'GET', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist\r\n### The error may exist in file [D:\\learnCode\\chushi\\target\\classes\\mapper\\DemoMapper.xml]\r\n### The error may involve defaultParameterMap\r\n### The error occurred while setting parameters\r\n### SQL: SELECT         operation         FROM         sys_log_operation         WHERE         id = ?\r\n### Cause: java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist\n; bad SQL grammar []; nested exception is java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist', '500', null, null, '2022-09-24 10:49:14', null, null);
INSERT INTO `sys_log_operation` VALUES ('1573504862841249794', '1', '测试多数据源', '/chushi/v1/sysLog/dynamic', 'GET', '\"1\"', '137', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist\r\n### The error may exist in file [D:\\learnCode\\chushi\\target\\classes\\mapper\\DemoMapper.xml]\r\n### The error may involve defaultParameterMap\r\n### The error occurred while setting parameters\r\n### SQL: SELECT         operation         FROM         sys_log_operation         WHERE         id = ?\r\n### Cause: java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist\n; bad SQL grammar []; nested exception is java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist', '410', '用户名称', null, '2022-09-24 10:49:28', null, null);
INSERT INTO `sys_log_operation` VALUES ('1573504864133095426', '2', null, '/chushi/v1/sysLog/dynamic', 'GET', '{\"id\":\"1\"}', null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist\r\n### The error may exist in file [D:\\learnCode\\chushi\\target\\classes\\mapper\\DemoMapper.xml]\r\n### The error may involve defaultParameterMap\r\n### The error occurred while setting parameters\r\n### SQL: SELECT         operation         FROM         sys_log_operation         WHERE         id = ?\r\n### Cause: java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist\n; bad SQL grammar []; nested exception is java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist', '500', null, null, '2022-09-24 10:49:29', null, null);
INSERT INTO `sys_log_operation` VALUES ('1573504919774732290', '1', '测试多数据源', '/chushi/v1/sysLog/dynamic', 'GET', '\"1030000\"', '127', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist\r\n### The error may exist in file [D:\\learnCode\\chushi\\target\\classes\\mapper\\DemoMapper.xml]\r\n### The error may involve defaultParameterMap\r\n### The error occurred while setting parameters\r\n### SQL: SELECT         operation         FROM         sys_log_operation         WHERE         id = ?\r\n### Cause: java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist\n; bad SQL grammar []; nested exception is java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist', '410', '用户名称', null, '2022-09-24 10:49:42', null, null);
INSERT INTO `sys_log_operation` VALUES ('1573504920978497538', '2', null, '/chushi/v1/sysLog/dynamic', 'GET', '{\"id\":\"1030000\"}', null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist\r\n### The error may exist in file [D:\\learnCode\\chushi\\target\\classes\\mapper\\DemoMapper.xml]\r\n### The error may involve defaultParameterMap\r\n### The error occurred while setting parameters\r\n### SQL: SELECT         operation         FROM         sys_log_operation         WHERE         id = ?\r\n### Cause: java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist\n; bad SQL grammar []; nested exception is java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist', '500', null, null, '2022-09-24 10:49:42', null, null);
INSERT INTO `sys_log_operation` VALUES ('1573504948568629249', '1', '测试多数据源', '/chushi/v1/sysLog/dynamic', 'GET', '\"53\"', '102', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist\r\n### The error may exist in file [D:\\learnCode\\chushi\\target\\classes\\mapper\\DemoMapper.xml]\r\n### The error may involve defaultParameterMap\r\n### The error occurred while setting parameters\r\n### SQL: SELECT         operation         FROM         sys_log_operation         WHERE         id = ?\r\n### Cause: java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist\n; bad SQL grammar []; nested exception is java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist', '410', '用户名称', null, '2022-09-24 10:49:49', null, null);
INSERT INTO `sys_log_operation` VALUES ('1573504949604622337', '2', null, '/chushi/v1/sysLog/dynamic', 'GET', '{\"id\":\"53\"}', null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist\r\n### The error may exist in file [D:\\learnCode\\chushi\\target\\classes\\mapper\\DemoMapper.xml]\r\n### The error may involve defaultParameterMap\r\n### The error occurred while setting parameters\r\n### SQL: SELECT         operation         FROM         sys_log_operation         WHERE         id = ?\r\n### Cause: java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist\n; bad SQL grammar []; nested exception is java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist', '500', null, null, '2022-09-24 10:49:49', null, null);
INSERT INTO `sys_log_operation` VALUES ('1573504968248303618', '1', '测试多数据源', '/chushi/v1/sysLog/dynamic', 'GET', '\"10\"', '80', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist\r\n### The error may exist in file [D:\\learnCode\\chushi\\target\\classes\\mapper\\DemoMapper.xml]\r\n### The error may involve defaultParameterMap\r\n### The error occurred while setting parameters\r\n### SQL: SELECT         operation         FROM         sys_log_operation         WHERE         id = ?\r\n### Cause: java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist\n; bad SQL grammar []; nested exception is java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist', '410', '用户名称', null, '2022-09-24 10:49:53', null, null);
INSERT INTO `sys_log_operation` VALUES ('1573504970462896129', '2', null, '/chushi/v1/sysLog/dynamic', 'GET', '{\"id\":\"10\"}', null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist\r\n### The error may exist in file [D:\\learnCode\\chushi\\target\\classes\\mapper\\DemoMapper.xml]\r\n### The error may involve defaultParameterMap\r\n### The error occurred while setting parameters\r\n### SQL: SELECT         operation         FROM         sys_log_operation         WHERE         id = ?\r\n### Cause: java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist\n; bad SQL grammar []; nested exception is java.sql.SQLSyntaxErrorException: Table \'cc_dum2.sys_log_operation\' doesn\'t exist', '500', null, null, '2022-09-24 10:49:54', null, null);
INSERT INTO `sys_log_operation` VALUES ('1573505203649421314', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"get\",\"timeout\":0}', '263', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-09-24 10:50:50', null, null);
INSERT INTO `sys_log_operation` VALUES ('1573506518324621314', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"get\",\"timeout\":0}', '1714', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-09-24 10:56:03', null, null);
INSERT INTO `sys_log_operation` VALUES ('1573518006561034241', '1', '分页', '/chushi/v1/sysLog/page', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"\",\"timeout\":0}', '700', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-09-24 11:41:42', null, null);
INSERT INTO `sys_log_operation` VALUES ('1574603046002946050', '3', null, '/chushi/v1/sysLog/restTemplatePost', 'POST', '7000', '6101', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-09-27 11:33:16', null, null);
INSERT INTO `sys_log_operation` VALUES ('1574603048574054401', '2', null, '/chushi/v1/sysLog/restTemplatePost', 'POST', '{\"timeout\":\"7000\"}', null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '连接超时，请重新点击或联系管理员！【错误类型】:业务异常410', '410', null, null, '2022-09-27 11:33:16', null, null);
INSERT INTO `sys_log_operation` VALUES ('1574603049891065857', '3', 'redis测试', '/chushi/v1/sysLog/redisPost', 'POST', '{\"size\":10,\"current\":1,\"operation\":null,\"requestMethod\":null,\"timeout\":7000}', '7573', 'Apache-HttpClient/4.5.13 (Java/1.8.0_91)', '127.0.0.1', '成功', '200', '用户名称', null, '2022-09-27 11:33:16', null, null);
INSERT INTO `sys_log_operation` VALUES ('1574603050897698818', '1', 'redis测试', '/chushi/v1/sysLog/redisPost', 'POST', '{\"size\":10,\"current\":1,\"operation\":null,\"requestMethod\":null,\"timeout\":7000}', '8116', 'Apache-HttpClient/4.5.13 (Java/1.8.0_91)', '127.0.0.1', '成功', '200', '用户名称', null, '2022-09-27 11:33:17', null, null);
INSERT INTO `sys_log_operation` VALUES ('1574603126114152449', '3', 'redis测试', '/chushi/v1/sysLog/redisPost', 'POST', '{\"size\":10,\"current\":1,\"operation\":null,\"requestMethod\":null,\"timeout\":5000}', '5107', 'Apache-HttpClient/4.5.13 (Java/1.8.0_91)', '127.0.0.1', '成功', '200', '用户名称', null, '2022-09-27 11:33:35', null, null);
INSERT INTO `sys_log_operation` VALUES ('1574603127116591106', '1', 'redis测试', '/chushi/v1/sysLog/redisPost', 'POST', '{\"size\":10,\"current\":1,\"operation\":null,\"requestMethod\":null,\"timeout\":5000}', '5374', 'Apache-HttpClient/4.5.13 (Java/1.8.0_91)', '127.0.0.1', '成功', '200', '用户名称', null, '2022-09-27 11:33:35', null, null);
INSERT INTO `sys_log_operation` VALUES ('1574603128261636097', '3', null, '/chushi/v1/sysLog/restTemplatePost', 'POST', '5000', '5636', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-09-27 11:33:35', null, null);
INSERT INTO `sys_log_operation` VALUES ('1574604539821092865', '3', null, '/chushi/v1/sysLog/restTemplatePost', 'POST', '8000', '6004', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-09-27 11:39:12', null, null);
INSERT INTO `sys_log_operation` VALUES ('1574604540987109378', '2', null, '/chushi/v1/sysLog/restTemplatePost', 'POST', '{\"timeout\":\"8000\"}', null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '连接超时，请重新点击或联系管理员！【错误类型】:业务异常410', '410', null, null, '2022-09-27 11:39:12', null, null);
INSERT INTO `sys_log_operation` VALUES ('1574604545814753281', '3', 'redis测试', '/chushi/v1/sysLog/redisPost', 'POST', '{\"size\":10,\"current\":1,\"operation\":null,\"requestMethod\":null,\"timeout\":8000}', '8078', 'Apache-HttpClient/4.5.13 (Java/1.8.0_91)', '127.0.0.1', '成功', '200', '用户名称', null, '2022-09-27 11:39:13', null, null);
INSERT INTO `sys_log_operation` VALUES ('1574604546825580545', '1', 'redis测试', '/chushi/v1/sysLog/redisPost', 'POST', '{\"size\":10,\"current\":1,\"operation\":null,\"requestMethod\":null,\"timeout\":8000}', '8366', 'Apache-HttpClient/4.5.13 (Java/1.8.0_91)', '127.0.0.1', '成功', '200', '用户名称', null, '2022-09-27 11:39:13', null, null);
INSERT INTO `sys_log_operation` VALUES ('1574744630950404097', '1', '分页', '/chushi/v1/sysLog/page', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"\",\"timeout\":0}', '1434', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'com.liuds.springbootchus.config.Result cannot be cast to cn.hutool.json.JSONObject', '410', '用户名称', null, '2022-09-27 20:55:52', null, null);
INSERT INTO `sys_log_operation` VALUES ('1574744632271609857', '2', null, '/chushi/v1/sysLog/page', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'com.liuds.springbootchus.config.Result cannot be cast to cn.hutool.json.JSONObject', '500', null, null, '2022-09-27 20:55:52', null, null);
INSERT INTO `sys_log_operation` VALUES ('1574930509773938690', '3', '分页', '/chushi/v1/sysLog/page', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"\",\"timeout\":0}', '10987', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-09-28 09:14:29', null, null);
INSERT INTO `sys_log_operation` VALUES ('1574930510549884930', '1', '分页', '/chushi/v1/sysLog/page', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"\",\"timeout\":0}', '11625', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'com.liuds.springbootchus.config.Result cannot be cast to cn.hutool.json.JSONObject', '410', '用户名称', null, '2022-09-28 09:14:29', null, null);
INSERT INTO `sys_log_operation` VALUES ('1574930511577489410', '2', null, '/chushi/v1/sysLog/page', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'com.liuds.springbootchus.config.Result cannot be cast to cn.hutool.json.JSONObject', '500', null, null, '2022-09-28 09:14:29', null, null);
INSERT INTO `sys_log_operation` VALUES ('1574935287723810817', '1', '分页', '/chushi/v1/sysLog/page', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"\",\"timeout\":0}', '884', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-09-28 09:33:28', null, null);
INSERT INTO `sys_log_operation` VALUES ('1575694787636490241', '1', '单表分页', '/chushi/v1/sysLog/pageOne', 'POST', '{\"size\":0,\"current\":0,\"operation\":\"\",\"requestMethod\":\"get\",\"timeout\":0}', '1149', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: Unknown column \'timeout\' in \'where clause\'\r\n### The error may exist in com/liuds/springbootchus/modular/demo/dao/SysLogOperationDao.java (best guess)\r\n### The error may involve defaultParameterMap\r\n### The error occurred while setting parameters\r\n### SQL: SELECT COUNT(*) AS total FROM sys_log_operation WHERE (request_method = ? AND timeout = ?)\r\n### Cause: java.sql.SQLSyntaxErrorException: Unknown column \'timeout\' in \'where clause\'\n; bad SQL grammar []; nested exception is java.sql.SQLSyntaxErrorException: Unknown column \'timeout\' in \'where clause\'', '410', '用户名称', null, '2022-09-30 11:51:27', null, null);
INSERT INTO `sys_log_operation` VALUES ('1575694789100302338', '2', null, '/chushi/v1/sysLog/pageOne', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: Unknown column \'timeout\' in \'where clause\'\r\n### The error may exist in com/liuds/springbootchus/modular/demo/dao/SysLogOperationDao.java (best guess)\r\n### The error may involve defaultParameterMap\r\n### The error occurred while setting parameters\r\n### SQL: SELECT COUNT(*) AS total FROM sys_log_operation WHERE (request_method = ? AND timeout = ?)\r\n### Cause: java.sql.SQLSyntaxErrorException: Unknown column \'timeout\' in \'where clause\'\n; bad SQL grammar []; nested exception is java.sql.SQLSyntaxErrorException: Unknown column \'timeout\' in \'where clause\'', '500', null, null, '2022-09-30 11:51:27', null, null);
INSERT INTO `sys_log_operation` VALUES ('1575694861309440001', '2', null, '/chushi/v1/sysLog/pageOne', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'JSON parse error: Unexpected character (\'}\' (code 125)): was expecting double-quote to start field name; nested exception is com.fasterxml.jackson.core.JsonParseException: Unexpected character (\'}\' (code 125)): was expecting double-quote to start field name\n at [Source: (PushbackInputStream); line: 7, column: 2]', '500', null, null, '2022-09-30 11:51:45', null, null);
INSERT INTO `sys_log_operation` VALUES ('1575694871946194945', '1', '单表分页', '/chushi/v1/sysLog/pageOne', 'POST', '{\"size\":0,\"current\":0,\"operation\":\"\",\"requestMethod\":\"get\",\"timeout\":0}', '34', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: Unknown column \'timeout\' in \'where clause\'\r\n### The error may exist in com/liuds/springbootchus/modular/demo/dao/SysLogOperationDao.java (best guess)\r\n### The error may involve defaultParameterMap\r\n### The error occurred while setting parameters\r\n### SQL: SELECT COUNT(*) AS total FROM sys_log_operation WHERE (request_method = ? AND timeout = ?)\r\n### Cause: java.sql.SQLSyntaxErrorException: Unknown column \'timeout\' in \'where clause\'\n; bad SQL grammar []; nested exception is java.sql.SQLSyntaxErrorException: Unknown column \'timeout\' in \'where clause\'', '410', '用户名称', null, '2022-09-30 11:51:47', null, null);
INSERT INTO `sys_log_operation` VALUES ('1575694873007353858', '2', null, '/chushi/v1/sysLog/pageOne', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: Unknown column \'timeout\' in \'where clause\'\r\n### The error may exist in com/liuds/springbootchus/modular/demo/dao/SysLogOperationDao.java (best guess)\r\n### The error may involve defaultParameterMap\r\n### The error occurred while setting parameters\r\n### SQL: SELECT COUNT(*) AS total FROM sys_log_operation WHERE (request_method = ? AND timeout = ?)\r\n### Cause: java.sql.SQLSyntaxErrorException: Unknown column \'timeout\' in \'where clause\'\n; bad SQL grammar []; nested exception is java.sql.SQLSyntaxErrorException: Unknown column \'timeout\' in \'where clause\'', '500', null, null, '2022-09-30 11:51:47', null, null);
INSERT INTO `sys_log_operation` VALUES ('1575694950673281026', '1', '分页', '/chushi/v1/sysLog/page', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"\",\"timeout\":0}', '933', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-09-30 11:52:06', null, null);
INSERT INTO `sys_log_operation` VALUES ('1579314874209562626', '1', '列表', '/chushi/v1/sysLog/list', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"get\",\"requestTimeStart\":null,\"requestTimeEnd\":null,\"timeout\":0}', '1265', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: Unknown column \'timeout\' in \'where clause\'\r\n### The error may exist in com/liuds/springbootchus/modular/demo/dao/SysLogOperationDao.java (best guess)\r\n### The error may involve defaultParameterMap\r\n### The error occurred while setting parameters\r\n### SQL: SELECT  id,operation,type,request_uri,request_method,request_params,request_time,user_agent,ip,code,remark,creator_name,creator,create_date,updater,update_date  FROM sys_log_operation     WHERE (request_method = ? AND timeout = ?) ORDER BY request_time DESC\r\n### Cause: java.sql.SQLSyntaxErrorException: Unknown column \'timeout\' in \'where clause\'\n; bad SQL grammar []; nested exception is java.sql.SQLSyntaxErrorException: Unknown column \'timeout\' in \'where clause\'', '410', '用户名称', null, '2022-10-10 11:36:23', null, null);
INSERT INTO `sys_log_operation` VALUES ('1579314875870507009', '2', null, '/chushi/v1/sysLog/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: Unknown column \'timeout\' in \'where clause\'\r\n### The error may exist in com/liuds/springbootchus/modular/demo/dao/SysLogOperationDao.java (best guess)\r\n### The error may involve defaultParameterMap\r\n### The error occurred while setting parameters\r\n### SQL: SELECT  id,operation,type,request_uri,request_method,request_params,request_time,user_agent,ip,code,remark,creator_name,creator,create_date,updater,update_date  FROM sys_log_operation     WHERE (request_method = ? AND timeout = ?) ORDER BY request_time DESC\r\n### Cause: java.sql.SQLSyntaxErrorException: Unknown column \'timeout\' in \'where clause\'\n; bad SQL grammar []; nested exception is java.sql.SQLSyntaxErrorException: Unknown column \'timeout\' in \'where clause\'', '500', null, null, '2022-10-10 11:36:23', null, null);
INSERT INTO `sys_log_operation` VALUES ('1579315295862943745', '3', '分页', '/chushi/v1/sysLog/page', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"\",\"requestTimeStart\":null,\"requestTimeEnd\":null,\"timeout\":0}', '2163', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-10-10 11:38:03', null, null);
INSERT INTO `sys_log_operation` VALUES ('1579315297305784322', '1', '分页', '/chushi/v1/sysLog/page', 'POST', '{\"size\":10,\"current\":0,\"operation\":\"\",\"requestMethod\":\"\",\"requestTimeStart\":null,\"requestTimeEnd\":null,\"timeout\":0}', '3278', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-10-10 11:38:04', null, null);
INSERT INTO `sys_log_operation` VALUES ('1579718758086230018', '2', null, '/chushi/sysuser/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: Unknown column \'size\' in \'field list\'\r\n### The error may exist in com/liuds/springbootchus/modular/test/mapper/SysUserMapper.java (best guess)\r\n### The error may involve defaultParameterMap\r\n### The error occurred while setting parameters\r\n### SQL: SELECT  id,name,password,real_name,head_url,gender,email,mobile,dept_id,super_admin,status,size,current,creator,create_date,updater,update_date  FROM sys_user     WHERE (id = ? AND gender = ? AND dept_id = ? AND super_admin = ? AND status = ?) ORDER BY update_date DESC\r\n### Cause: java.sql.SQLSyntaxErrorException: Unknown column \'size\' in \'field list\'\n; bad SQL grammar []; nested exception is java.sql.SQLSyntaxErrorException: Unknown column \'size\' in \'field list\'', '500', null, null, '2022-10-11 14:21:16', null, null);
INSERT INTO `sys_log_operation` VALUES ('1579720214138970113', '3', null, '/chushi/sysuser/list', 'POST', '{\"creator\":null,\"createDate\":null,\"updater\":null,\"updateDate\":null,\"id\":null,\"name\":null,\"password\":null,\"realName\":null,\"headUrl\":null,\"gender\":null,\"email\":null,\"mobile\":null,\"deptId\":null,\"superAdmin\":null,\"status\":null}', '2075', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-10-11 14:27:03', null, null);
INSERT INTO `sys_log_operation` VALUES ('1579737182317318145', '2', null, '/chushi/v1/sysLog/security', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'An Authentication object was not found in the SecurityContext', '500', null, null, '2022-10-11 15:34:29', null, null);
INSERT INTO `sys_log_operation` VALUES ('1579737543493029889', '1', 'redis测试', '/chushi/v1/sysLog/redisPost', 'POST', '{\"size\":0,\"current\":0,\"operation\":\"\",\"requestMethod\":\"\",\"requestTimeStart\":null,\"requestTimeEnd\":null,\"timeout\":10}', '310', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-10-11 15:35:55', null, null);
INSERT INTO `sys_log_operation` VALUES ('1579737964097830913', '1', 'redis测试', '/chushi/v1/sysLog/redisPost', 'POST', '{\"size\":0,\"current\":0,\"operation\":\"\",\"requestMethod\":\"\",\"requestTimeStart\":null,\"requestTimeEnd\":null,\"timeout\":10}', '190', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-10-11 15:37:35', null, null);
INSERT INTO `sys_log_operation` VALUES ('1579755532460351490', '2', null, '/chushi/v1/sysuser/findById', 'POST', '{\"id\":\"1574744630950404097\"}', null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', 'Request method \'POST\' not supported', '500', null, null, '2022-10-11 16:47:24', null, null);
INSERT INTO `sys_log_operation` VALUES ('1579756832069640193', '1', '测试用户新增', '/chushi/v1/sysuser/save', 'POST', '{\"creator\":null,\"createDate\":1665478353654,\"updater\":null,\"updateDate\":null,\"id\":1579756831092367362,\"name\":\"cv第三方\",\"password\":\"234234\",\"realName\":\"撒大声地\",\"headUrl\":\"sdgfas\",\"gender\":1,\"email\":\"2\",\"mobile\":\"13123\",\"deptId\":1,\"superAdmin\":0,\"status\":null}', '1001', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '成功', '200', '用户名称', null, '2022-10-11 16:52:34', null, null);
INSERT INTO `sys_log_operation` VALUES ('1579757853583872001', '2', null, '/chushi/v1/sysuser/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: Unknown column \'size\' in \'field list\'\r\n### The error may exist in com/liuds/springbootchus/modular/sysuser1/mapper/SysUserMapper.java (best guess)\r\n### The error may involve defaultParameterMap\r\n### The error occurred while setting parameters\r\n### SQL: SELECT  id,name,password,real_name,head_url,gender,email,mobile,dept_id,super_admin,status,size,current,creator,create_date,updater,update_date  FROM sys_user           ORDER BY update_date DESC\r\n### Cause: java.sql.SQLSyntaxErrorException: Unknown column \'size\' in \'field list\'\n; bad SQL grammar []; nested exception is java.sql.SQLSyntaxErrorException: Unknown column \'size\' in \'field list\'', '500', null, null, '2022-10-11 16:56:37', null, null);
INSERT INTO `sys_log_operation` VALUES ('1579759719969501185', '2', null, '/chushi/v1/sysuser/list', 'POST', null, null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/105.0.0.0 Safari/537.36', '0:0:0:0:0:0:0:1', '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: Unknown column \'current\' in \'field list\'\r\n### The error may exist in com/liuds/springbootchus/modular/sysuser1/mapper/SysUserMapper.java (best guess)\r\n### The error may involve defaultParameterMap\r\n### The error occurred while setting parameters\r\n### SQL: SELECT  id,name,password,real_name,head_url,gender,email,mobile,dept_id,super_admin,status,current,creator,create_date,updater,update_date  FROM sys_user           ORDER BY update_date DESC\r\n### Cause: java.sql.SQLSyntaxErrorException: Unknown column \'current\' in \'field list\'\n; bad SQL grammar []; nested exception is java.sql.SQLSyntaxErrorException: Unknown column \'current\' in \'field list\'', '500', null, null, '2022-10-11 17:04:02', null, null);

-- ----------------------------
-- Table structure for sys_menu
-- ----------------------------
DROP TABLE IF EXISTS `sys_menu`;
CREATE TABLE `sys_menu` (
  `id` bigint(20) NOT NULL COMMENT 'id',
  `pid` bigint(20) DEFAULT NULL COMMENT '上级ID，一级菜单为0',
  `name` varchar(200) DEFAULT NULL COMMENT '名称',
  `url` varchar(200) DEFAULT NULL COMMENT '菜单URL',
  `permissions` varchar(500) DEFAULT NULL COMMENT '授权(多个用逗号分隔，如：sys:user:list,sys:user:save)',
  `type` tinyint(3) unsigned DEFAULT NULL COMMENT '类型   0：菜单   1：按钮',
  `icon` varchar(50) DEFAULT NULL COMMENT '菜单图标',
  `sort` int(11) DEFAULT NULL COMMENT '排序',
  `dept_id` bigint(20) DEFAULT NULL COMMENT '所属顶级部门id',
  `status` tinyint(3) DEFAULT '1' COMMENT '状态（0：删除 1：正常）',
  `creator` bigint(20) DEFAULT NULL COMMENT '创建者',
  `create_date` datetime DEFAULT NULL COMMENT '创建时间',
  `updater` bigint(20) DEFAULT NULL COMMENT '更新者',
  `update_date` datetime DEFAULT NULL COMMENT '更新时间',
  PRIMARY KEY (`id`),
  KEY `idx_pid` (`pid`),
  KEY `idx_sort` (`sort`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='菜单管理';

-- ----------------------------
-- Records of sys_menu
-- ----------------------------
INSERT INTO `sys_menu` VALUES ('1067246875800000002', '0', '权限管理', null, null, '0', 'icon-safetycertificate', '0', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000003', '1067246875800000055', '新增', null, 'sys:user:save,sys:dept:list,sys:role:list', '1', null, '1', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000004', '1067246875800000055', '修改', null, 'sys:user:update,sys:dept:list,sys:role:list', '1', null, '2', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000005', '1067246875800000055', '删除', null, 'sys:user:delete', '1', null, '3', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000006', '1067246875800000055', '导出', null, 'sys:user:export', '1', null, '4', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000007', '1067246875800000002', '角色管理', 'sys/role', null, '0', 'icon-team', '2', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000008', '1067246875800000007', '查看', null, 'sys:role:page,sys:role:info', '1', null, '0', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000009', '1067246875800000007', '新增', null, 'sys:role:save,sys:menu:select,sys:dept:list', '1', null, '1', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000010', '1067246875800000007', '修改', null, 'sys:role:update,sys:menu:select,sys:dept:list', '1', null, '2', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000011', '1067246875800000007', '删除', null, 'sys:role:delete', '1', null, '3', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000012', '1067246875800000002', '部门管理', 'sys/dept', null, '0', 'icon-apartment', '1', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000014', '1067246875800000012', '查看', null, 'sys:dept:list,sys:dept:info', '1', null, '0', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000015', '1067246875800000012', '新增', null, 'sys:dept:save', '1', null, '1', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000016', '1067246875800000012', '修改', null, 'sys:dept:update', '1', null, '2', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000017', '1067246875800000012', '删除', null, 'sys:dept:delete', '1', null, '3', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000025', '1067246875800000035', '菜单管理', 'sys/menu', null, '0', 'icon-unorderedlist', '0', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000026', '1067246875800000025', '查看', null, 'sys:menu:list,sys:menu:info', '1', null, '0', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000027', '1067246875800000025', '新增', null, 'sys:menu:save', '1', null, '1', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000028', '1067246875800000025', '修改', null, 'sys:menu:update', '1', null, '2', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000029', '1067246875800000025', '删除', null, 'sys:menu:delete', '1', null, '3', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000030', '1067246875800000035', '定时任务', 'job/schedule', null, '0', 'icon-dashboard', '3', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000031', '1067246875800000030', '查看', null, 'sys:schedule:page,sys:schedule:info', '1', null, '0', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000032', '1067246875800000030', '新增', null, 'sys:schedule:save', '1', null, '1', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000033', '1067246875800000030', '修改', null, 'sys:schedule:update', '1', null, '2', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000034', '1067246875800000030', '删除', null, 'sys:schedule:delete', '1', null, '3', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000035', '0', '系统设置', null, null, '0', 'icon-setting', '1', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000036', '1067246875800000030', '暂停', null, 'sys:schedule:pause', '1', null, '4', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000037', '1067246875800000030', '恢复', null, 'sys:schedule:resume', '1', null, '5', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000038', '1067246875800000030', '立即执行', null, 'sys:schedule:run', '1', null, '6', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000039', '1067246875800000030', '日志列表', null, 'sys:schedule:log', '1', null, '7', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000040', '1067246875800000035', '参数管理', 'sys/params', '', '0', 'icon-fileprotect', '1', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000041', '1067246875800000035', '字典管理', 'sys/dict-type', null, '0', 'icon-golden-fill', '2', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000042', '1067246875800000041', '查看', null, 'sys:dict:page,sys:dict:info', '1', null, '0', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000043', '1067246875800000041', '新增', null, 'sys:dict:save', '1', null, '1', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000044', '1067246875800000041', '修改', null, 'sys:dict:update', '1', null, '2', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000045', '1067246875800000041', '删除', null, 'sys:dict:delete', '1', null, '3', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000046', '0', '日志管理', null, null, '0', 'icon-container', '2', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000047', '1067246875800000035', '文件上传', 'oss/oss', 'sys:oss:all', '0', 'icon-upload', '4', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000048', '1067246875800000046', '登录日志', 'sys/log-login', 'sys:log:login', '0', 'icon-filedone', '0', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000049', '1067246875800000046', '操作日志', 'sys/log-operation', 'sys:log:operation', '0', 'icon-solution', '1', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000050', '1067246875800000046', '异常日志', 'sys/log-error', 'sys:log:error', '0', 'icon-file-exception', '2', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000051', '1067246875800000053', 'SQL监控', '{{ window.SITE_CONFIG[\"apiURL\"] }}/druid/sql.html', null, '0', 'icon-database', '0', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000053', '0', '系统监控', null, null, '0', 'icon-desktop', '3', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000055', '1067246875800000002', '用户管理', 'sys/user', null, '0', 'icon-user', '0', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000056', '1067246875800000055', '查看', null, 'sys:user:page,sys:user:info', '1', null, '0', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000057', '1067246875800000040', '新增', null, 'sys:params:save', '1', null, '1', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000058', '1067246875800000040', '导出', null, 'sys:params:export', '1', null, '4', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000059', '1067246875800000040', '查看', '', 'sys:params:page,sys:params:info', '1', null, '0', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000060', '1067246875800000040', '修改', null, 'sys:params:update', '1', null, '2', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1067246875800000061', '1067246875800000040', '删除', '', 'sys:params:delete', '1', '', '3', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_menu` VALUES ('1156748733921165314', '1067246875800000053', '接口文档', '{{ window.SITE_CONFIG[\"apiURL\"] }}/doc.html', '', '0', 'icon-file-word', '1', null, '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');

-- ----------------------------
-- Table structure for sys_oss
-- ----------------------------
DROP TABLE IF EXISTS `sys_oss`;
CREATE TABLE `sys_oss` (
  `id` bigint(20) NOT NULL COMMENT 'id',
  `url` varchar(200) DEFAULT NULL COMMENT 'URL地址',
  `creator` bigint(20) DEFAULT NULL COMMENT '创建者',
  `create_date` datetime DEFAULT NULL COMMENT '创建时间',
  PRIMARY KEY (`id`),
  KEY `idx_create_date` (`create_date`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='文件上传';

-- ----------------------------
-- Records of sys_oss
-- ----------------------------

-- ----------------------------
-- Table structure for sys_role
-- ----------------------------
DROP TABLE IF EXISTS `sys_role`;
CREATE TABLE `sys_role` (
  `id` bigint(20) NOT NULL COMMENT 'id',
  `name` varchar(50) DEFAULT NULL COMMENT '角色名称',
  `remark` varchar(100) DEFAULT NULL COMMENT '备注',
  `dept_id` bigint(20) DEFAULT NULL COMMENT '角色所属的顶级部门ID',
  `status` tinyint(3) DEFAULT '1' COMMENT '状态（ 0:删除 1:正常）',
  `creator` bigint(20) DEFAULT NULL COMMENT '创建者',
  `create_date` datetime DEFAULT NULL COMMENT '创建时间',
  `updater` bigint(20) DEFAULT NULL COMMENT '更新者',
  `update_date` datetime DEFAULT NULL COMMENT '更新时间',
  PRIMARY KEY (`id`),
  KEY `idx_dept_id` (`dept_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='角色管理';

-- ----------------------------
-- Records of sys_role
-- ----------------------------

-- ----------------------------
-- Table structure for sys_role_user
-- ----------------------------
DROP TABLE IF EXISTS `sys_role_user`;
CREATE TABLE `sys_role_user` (
  `id` bigint(20) NOT NULL COMMENT 'id',
  `role_id` bigint(20) DEFAULT NULL COMMENT '角色ID',
  `user_id` bigint(20) DEFAULT NULL COMMENT '用户ID',
  `status` tinyint(3) DEFAULT '1' COMMENT '状态（0：删除 1：正常）',
  `creator` bigint(20) DEFAULT NULL COMMENT '创建者',
  `create_date` datetime DEFAULT NULL COMMENT '创建时间',
  `updater` bigint(20) DEFAULT NULL COMMENT '更新人',
  `update_date` datetime DEFAULT NULL COMMENT '更新时间',
  PRIMARY KEY (`id`),
  KEY `idx_role_id` (`role_id`),
  KEY `idx_user_id` (`user_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='角色用户关系';

-- ----------------------------
-- Records of sys_role_user
-- ----------------------------

-- ----------------------------
-- Table structure for sys_user
-- ----------------------------
DROP TABLE IF EXISTS `sys_user`;
CREATE TABLE `sys_user` (
  `id` bigint(20) NOT NULL COMMENT 'id',
  `name` varchar(50) NOT NULL COMMENT '用户名',
  `password` varchar(100) DEFAULT NULL COMMENT '密码',
  `real_name` varchar(50) DEFAULT NULL COMMENT '姓名',
  `head_url` varchar(200) DEFAULT NULL COMMENT '头像',
  `gender` tinyint(3) unsigned DEFAULT '2' COMMENT '性别   0：男   1：女    2：未知',
  `email` varchar(100) DEFAULT NULL COMMENT '邮箱',
  `mobile` varchar(100) DEFAULT NULL COMMENT '手机号',
  `dept_id` bigint(20) DEFAULT NULL COMMENT '部门ID',
  `super_admin` tinyint(3) unsigned DEFAULT '0' COMMENT '超级管理员   0：否   1：是',
  `status` tinyint(4) DEFAULT '1' COMMENT '状态  0：停用   1：正常',
  `creator` bigint(20) DEFAULT NULL COMMENT '创建者',
  `create_date` datetime DEFAULT NULL COMMENT '创建时间',
  `updater` bigint(20) DEFAULT NULL COMMENT '更新者',
  `update_date` datetime DEFAULT NULL COMMENT '更新时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `uk_username` (`name`),
  KEY `idx_create_date` (`create_date`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='系统用户';

-- ----------------------------
-- Records of sys_user
-- ----------------------------
INSERT INTO `sys_user` VALUES ('1067246875800000001', 'admin', '$2a$10$012Kx2ba5jzqr9gLlG4MX.bnQJTD9UWqF57XDo2N3.fPtLne02u/m', '管理员', null, '0', 'root', '13612345678', null, '1', '1', '1067246875800000001', '2022-07-28 14:51:24', '1067246875800000001', '2022-07-28 14:51:24');
INSERT INTO `sys_user` VALUES ('1579756831092367362', 'cv第三方', '234234', '撒大声地', 'sdgfas', '1', '2', '13123', '1', '0', '1', null, '2022-10-11 16:52:34', null, null);

-- ----------------------------
-- Table structure for sys_user_token
-- ----------------------------
DROP TABLE IF EXISTS `sys_user_token`;
CREATE TABLE `sys_user_token` (
  `id` bigint(20) NOT NULL COMMENT 'id',
  `user_id` bigint(20) NOT NULL COMMENT '用户id',
  `token` varchar(100) NOT NULL COMMENT '用户token',
  `expire_date` datetime DEFAULT NULL COMMENT '过期时间',
  `update_date` datetime DEFAULT NULL COMMENT '更新时间',
  `create_date` datetime DEFAULT NULL COMMENT '创建时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `user_id` (`user_id`),
  UNIQUE KEY `token` (`token`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='系统用户Token';

-- ----------------------------
-- Records of sys_user_token
-- ----------------------------

-- ----------------------------
-- Procedure structure for proc_init
-- ----------------------------
DROP PROCEDURE IF EXISTS `proc_init`;
DELIMITER ;;
CREATE DEFINER=`root`@`%` PROCEDURE `proc_init`()
BEGIN
	DECLARE
		i INT DEFAULT 1;
	WHILE
			i <= 1551 DO
			INSERT INTO igj ( id,a, b,c)
		VALUES
			( CONCAT(i,'2','3',CONVERT(i,char)), i );
		
		SET i = i + 1;
		
	END WHILE;

END
;;
DELIMITER ;

-- ----------------------------
-- Procedure structure for proc_init1
-- ----------------------------
DROP PROCEDURE IF EXISTS `proc_init1`;
DELIMITER ;;
CREATE DEFINER=`root`@`%` PROCEDURE `proc_init1`()
BEGIN
	DECLARE
		i INT DEFAULT 1;
	WHILE
			i <= 1551 DO
			INSERT INTO igj (id,a,b,c)
		VALUES
			( CONCAT(i,'2'), i );
		
		SET i = i + 1;
		
	END WHILE;

END
;;
DELIMITER ;

-- ----------------------------
-- Procedure structure for proc_init12
-- ----------------------------
DROP PROCEDURE IF EXISTS `proc_init12`;
DELIMITER ;;
CREATE DEFINER=`root`@`%` PROCEDURE `proc_init12`()
BEGIN
	DECLARE
		i INT DEFAULT 1;
	WHILE
			i <= 1551 DO
			INSERT INTO igj (id,a,b,c)
		VALUES
			( CONCAT(i,'sdf'), i );
		
		SET i = i + 1;
		
	END WHILE;

END
;;
DELIMITER ;

-- ----------------------------
-- Procedure structure for proc_init123
-- ----------------------------
DROP PROCEDURE IF EXISTS `proc_init123`;
DELIMITER ;;
CREATE DEFINER=`root`@`%` PROCEDURE `proc_init123`()
BEGIN
	DECLARE
		i INT DEFAULT 1;
	WHILE
			i <= 1551 DO
			INSERT INTO igj (id,a)
		VALUES
			( CONCAT(i,'sdf'), i );
		
		SET i = i + 1;
		
	END WHILE;

END
;;
DELIMITER ;

-- ----------------------------
-- Procedure structure for proc_init1234
-- ----------------------------
DROP PROCEDURE IF EXISTS `proc_init1234`;
DELIMITER ;;
CREATE DEFINER=`root`@`%` PROCEDURE `proc_init1234`()
BEGIN
	DECLARE
		i INT DEFAULT 1;
	WHILE
			i <= 1551 DO
			INSERT INTO igj (id,a,b,c,d,f,h,j)
		VALUES
			( 1, 2, 3, 4, 5, 6, 7, 8 );
		
		SET i = i + 1;
		
	END WHILE;

END
;;
DELIMITER ;

-- ----------------------------
-- Procedure structure for proc_init12345
-- ----------------------------
DROP PROCEDURE IF EXISTS `proc_init12345`;
DELIMITER ;;
CREATE DEFINER=`root`@`%` PROCEDURE `proc_init12345`()
BEGIN
	DECLARE
		i INT DEFAULT 1;
	WHILE
			i <= 1551 DO
			INSERT INTO igj (id,a,b,c,d,f,h,g)
		VALUES
			( 1, 2, 3, 4, 5, 6, 7, 8 );
		
		SET i = i + 1;
		
	END WHILE;

END
;;
DELIMITER ;

-- ----------------------------
-- Procedure structure for proc_init123456
-- ----------------------------
DROP PROCEDURE IF EXISTS `proc_init123456`;
DELIMITER ;;
CREATE DEFINER=`root`@`%` PROCEDURE `proc_init123456`()
BEGIN
	DECLARE
		i INT DEFAULT 1;
	WHILE
			i <= 1551 DO
			INSERT INTO igj (id,a,b,c,d,f,h,g,k)
		VALUES
			( 1, 2, 3, 4, 5, 6, 7, 8, 1);
		
		SET i = i + 1;
		
	END WHILE;

END
;;
DELIMITER ;

-- ----------------------------
-- Procedure structure for proc_init1234567
-- ----------------------------
DROP PROCEDURE IF EXISTS `proc_init1234567`;
DELIMITER ;;
CREATE DEFINER=`root`@`%` PROCEDURE `proc_init1234567`()
BEGIN
	DECLARE
		i INT DEFAULT 1;
	WHILE
			i <= 1551 DO
			INSERT INTO igj (id,a,b,c,d,f,h,g,k)
		VALUES
			( 1, 2, 3, 4, 5, 6, 7, 8, 1);
		
		SET i = i + 1;
		
	END WHILE;

END
;;
DELIMITER ;

-- ----------------------------
-- Procedure structure for proc_initD
-- ----------------------------
DROP PROCEDURE IF EXISTS `proc_initD`;
DELIMITER ;;
CREATE DEFINER=`root`@`%` PROCEDURE `proc_initD`()
BEGIN
	DECLARE
		i INT DEFAULT 1;
	WHILE
			i <= 1551 DO
			INSERT INTO igj ( id,a, b,c)
		VALUES
			( CONCAT(1,'2','3',CONVERT(i,char)), i );
		
		SET i = i + 1;
		
	END WHILE;

END
;;
DELIMITER ;

-- ----------------------------
-- Procedure structure for proc_initDa
-- ----------------------------
DROP PROCEDURE IF EXISTS `proc_initDa`;
DELIMITER ;;
CREATE DEFINER=`root`@`%` PROCEDURE `proc_initDa`()
BEGIN
	DECLARE
		i INT DEFAULT 1;
	WHILE
			i <= 1551 DO
			INSERT INTO igj ( id,a, b,c)
		VALUES
			( CONCAT(1,2,3,CONVERT(i,char)), i );
		
		SET i = i + 1;
		
	END WHILE;

END
;;
DELIMITER ;

-- ----------------------------
-- Procedure structure for proc_initDat
-- ----------------------------
DROP PROCEDURE IF EXISTS `proc_initDat`;
DELIMITER ;;
CREATE DEFINER=`root`@`%` PROCEDURE `proc_initDat`()
BEGIN
	DECLARE
		i INT DEFAULT 1;
	WHILE
			i <= 1551 DO
			INSERT INTO igj ( id,a, b,c,d,f,h,j,k)
		VALUES
			( CONCAT(1,2,3,4,5,6,7,8,CONVERT(i,char)), i );
		
		SET i = i + 1;
		
	END WHILE;

END
;;
DELIMITER ;

-- ----------------------------
-- Procedure structure for proc_initData
-- ----------------------------
DROP PROCEDURE IF EXISTS `proc_initData`;
DELIMITER ;;
CREATE DEFINER=`root`@`%` PROCEDURE `proc_initData`()
BEGIN
	DECLARE
		i INT DEFAULT 1;
	WHILE
			i <= 15000 DO
			INSERT INTO igj ( a, b )
		VALUES
			( CONCAT('测试a',CONVERT(i,char)), i );
		
		SET i = i + 1;
		
	END WHILE;

END
;;
DELIMITER ;

-- ----------------------------
-- Procedure structure for proc_initData1
-- ----------------------------
DROP PROCEDURE IF EXISTS `proc_initData1`;
DELIMITER ;;
CREATE DEFINER=`root`@`%` PROCEDURE `proc_initData1`()
BEGIN
	DECLARE
		i INT DEFAULT 1;
	WHILE
			i <= 5000 DO
			INSERT INTO igj ( a, b )
		VALUES
			( CONCAT('测试a',CONVERT(i,char)), i );
		
		SET i = i + 1;
		
	END WHILE;

END
;;
DELIMITER ;

-- ----------------------------
-- Procedure structure for proc_initData2
-- ----------------------------
DROP PROCEDURE IF EXISTS `proc_initData2`;
DELIMITER ;;
CREATE DEFINER=`root`@`%` PROCEDURE `proc_initData2`()
BEGIN
	DECLARE
		i INT DEFAULT 1;
	WHILE
			i <= 1551 DO
			INSERT INTO igj ( a, b )
		VALUES
			( CONCAT('测试a',CONVERT(i,char)), i );
		
		SET i = i + 1;
		
	END WHILE;

END
;;
DELIMITER ;

-- ----------------------------
-- Procedure structure for proc_initData3
-- ----------------------------
DROP PROCEDURE IF EXISTS `proc_initData3`;
DELIMITER ;;
CREATE DEFINER=`root`@`%` PROCEDURE `proc_initData3`()
BEGIN
	DECLARE
		i INT DEFAULT 1;
	WHILE
			i <= 1551 DO
			INSERT INTO igj ( id,a, b,c,d,f,h.j,k )
		VALUES
			( CONCAT(1,2,3,4,5,6,7,8,CONVERT(i,char)), i );
		
		SET i = i + 1;
		
	END WHILE;

END
;;
DELIMITER ;

-- ----------------------------
-- Procedure structure for proc_initData4
-- ----------------------------
DROP PROCEDURE IF EXISTS `proc_initData4`;
DELIMITER ;;
CREATE DEFINER=`root`@`%` PROCEDURE `proc_initData4`()
BEGIN
	DECLARE
		i INT DEFAULT 1;
	WHILE
			i <= 1551 DO
			INSERT INTO igj ( id,a, b,c,d,f,h.j,k )
		VALUES
			( CONCAT(CONVERT(i,char),CONVERT(i,char),CONVERT(i,char),CONVERT(i,char),CONVERT(i,char),CONVERT(i,char),CONVERT(i,char),CONVERT(i,char),CONVERT(i,char)), i );
		
		SET i = i + 1;
		
	END WHILE;

END
;;
DELIMITER ;

-- ----------------------------
-- Procedure structure for proc_initData7
-- ----------------------------
DROP PROCEDURE IF EXISTS `proc_initData7`;
DELIMITER ;;
CREATE DEFINER=`root`@`%` PROCEDURE `proc_initData7`()
BEGIN
	DECLARE
		i INT DEFAULT 1;
	WHILE
			i <= 1551 DO
			INSERT INTO igj ( id,a )
		VALUES
			( CONCAT(1,CONVERT(i,char)), i );
		
		SET i = i + 1;
		
	END WHILE;

END
;;
DELIMITER ;
